Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/**
 * \file IfxGtm_bf.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 * Version: tc39x_its_SFR_V1.0.1_1.3_230715.xml dated 28.07.2015
 * Specification: its_V1.0.1_1.3.pdf
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Gtm_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxLld_Gtm
 *
 */
#ifndef IFXGTM_BF_H
#define IFXGTM_BF_H                                       1
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Gtm_BitfieldsMask
 * \{  */

/** \\brief  Length for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL0 */
#define IFX_GTM_ADCTRIG4OUT0_SEL0_LEN                     (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL0 */
#define IFX_GTM_ADCTRIG4OUT0_SEL0_MSK                     (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL0 */
#define IFX_GTM_ADCTRIG4OUT0_SEL0_OFF                     (0)

/** \\brief  Length for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL1 */
#define IFX_GTM_ADCTRIG4OUT0_SEL1_LEN                     (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL1 */
#define IFX_GTM_ADCTRIG4OUT0_SEL1_MSK                     (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL1 */
#define IFX_GTM_ADCTRIG4OUT0_SEL1_OFF                     (4)

/** \\brief  Length for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL2 */
#define IFX_GTM_ADCTRIG4OUT0_SEL2_LEN                     (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL2 */
#define IFX_GTM_ADCTRIG4OUT0_SEL2_MSK                     (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL2 */
#define IFX_GTM_ADCTRIG4OUT0_SEL2_OFF                     (8)

/** \\brief  Length for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL3 */
#define IFX_GTM_ADCTRIG4OUT0_SEL3_LEN                     (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL3 */
#define IFX_GTM_ADCTRIG4OUT0_SEL3_MSK                     (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL3 */
#define IFX_GTM_ADCTRIG4OUT0_SEL3_OFF                     (12)

/** \\brief  Length for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL4 */
#define IFX_GTM_ADCTRIG4OUT0_SEL4_LEN                     (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL4 */
#define IFX_GTM_ADCTRIG4OUT0_SEL4_MSK                     (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL4 */
#define IFX_GTM_ADCTRIG4OUT0_SEL4_OFF                     (16)

/** \\brief  Length for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL5 */
#define IFX_GTM_ADCTRIG4OUT0_SEL5_LEN                     (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL5 */
#define IFX_GTM_ADCTRIG4OUT0_SEL5_MSK                     (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL5 */
#define IFX_GTM_ADCTRIG4OUT0_SEL5_OFF                     (20)

/** \\brief  Length for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG4OUT0_SEL6_LEN                     (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG4OUT0_SEL6_MSK                     (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG4OUT0_SEL6_OFF                     (24)

/** \\brief  Length for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG4OUT0_SEL7_LEN                     (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG4OUT0_SEL7_MSK                     (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG4OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG4OUT0_SEL7_OFF                     (28)

/** \\brief  Length for Ifx_GTM_ADCTRIG4OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG4OUT1_SEL0_LEN                     (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG4OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG4OUT1_SEL0_MSK                     (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG4OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG4OUT1_SEL0_OFF                     (0)

/** \\brief  Length for Ifx_GTM_ADCTRIG4OUT1_Bits.SEL1 */
#define IFX_GTM_ADCTRIG4OUT1_SEL1_LEN                     (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG4OUT1_Bits.SEL1 */
#define IFX_GTM_ADCTRIG4OUT1_SEL1_MSK                     (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG4OUT1_Bits.SEL1 */
#define IFX_GTM_ADCTRIG4OUT1_SEL1_OFF                     (4)

/** \\brief  Length for Ifx_GTM_ADCTRIG4OUT1_Bits.SEL2 */
#define IFX_GTM_ADCTRIG4OUT1_SEL2_LEN                     (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG4OUT1_Bits.SEL2 */
#define IFX_GTM_ADCTRIG4OUT1_SEL2_MSK                     (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG4OUT1_Bits.SEL2 */
#define IFX_GTM_ADCTRIG4OUT1_SEL2_OFF                     (8)

/** \\brief  Length for Ifx_GTM_ADCTRIG4OUT1_Bits.SEL3 */
#define IFX_GTM_ADCTRIG4OUT1_SEL3_LEN                     (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG4OUT1_Bits.SEL3 */
#define IFX_GTM_ADCTRIG4OUT1_SEL3_MSK                     (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG4OUT1_Bits.SEL3 */
#define IFX_GTM_ADCTRIG4OUT1_SEL3_OFF                     (12)

/** \\brief  Length for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_ADDR */
#define IFX_GTM_AEI_ADDR_XPT_TO_ADDR_LEN                  (20)

/** \\brief  Mask for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_ADDR */
#define IFX_GTM_AEI_ADDR_XPT_TO_ADDR_MSK                  (0xfffff)

/** \\brief  Offset for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_ADDR */
#define IFX_GTM_AEI_ADDR_XPT_TO_ADDR_OFF                  (0)

