Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_W1R0 */
#define IFX_GTM_AEI_ADDR_XPT_TO_W1R0_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_W1R0 */
#define IFX_GTM_AEI_ADDR_XPT_TO_W1R0_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_W1R0 */
#define IFX_GTM_AEI_ADDR_XPT_TO_W1R0_OFF                  (20)

/** \\brief  Length for Ifx_GTM_AEI_STA_XPT_Bits.ADDR */
#define IFX_GTM_AEI_STA_XPT_ADDR_LEN                      (20)

/** \\brief  Mask for Ifx_GTM_AEI_STA_XPT_Bits.ADDR */
#define IFX_GTM_AEI_STA_XPT_ADDR_MSK                      (0xfffff)

/** \\brief  Offset for Ifx_GTM_AEI_STA_XPT_Bits.ADDR */
#define IFX_GTM_AEI_STA_XPT_ADDR_OFF                      (0)

/** \\brief  Length for Ifx_GTM_AEI_STA_XPT_Bits.W1R0 */
#define IFX_GTM_AEI_STA_XPT_W1R0_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_AEI_STA_XPT_Bits.W1R0 */
#define IFX_GTM_AEI_STA_XPT_W1R0_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_AEI_STA_XPT_Bits.W1R0 */
#define IFX_GTM_AEI_STA_XPT_W1R0_OFF                      (20)

/** \\brief  Length for Ifx_GTM_AFD_CH_BUF_ACC_Bits.DATA */
#define IFX_GTM_AFD_CH_BUF_ACC_DATA_LEN                   (29)

/** \\brief  Mask for Ifx_GTM_AFD_CH_BUF_ACC_Bits.DATA */
#define IFX_GTM_AFD_CH_BUF_ACC_DATA_MSK                   (0x1fffffff)

/** \\brief  Offset for Ifx_GTM_AFD_CH_BUF_ACC_Bits.DATA */
#define IFX_GTM_AFD_CH_BUF_ACC_DATA_OFF                   (0)

/** \\brief  Length for Ifx_GTM_AFD_CH_BUF_ACC_Bits.Reserved */
#define IFX_GTM_AFD_CH_BUF_ACC_RESERVED_LEN               (3)

/** \\brief  Mask for Ifx_GTM_AFD_CH_BUF_ACC_Bits.Reserved */
#define IFX_GTM_AFD_CH_BUF_ACC_RESERVED_MSK               (0x7)

/** \\brief  Offset for Ifx_GTM_AFD_CH_BUF_ACC_Bits.Reserved */
#define IFX_GTM_AFD_CH_BUF_ACC_RESERVED_OFF               (29)

/** \\brief  Length for Ifx_GTM_ARU_0_DYN_CTRL_Bits.DYN_ARU_UPDATE_EN */
#define IFX_GTM_ARU_0_DYN_CTRL_DYN_ARU_UPDATE_EN_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ARU_0_DYN_CTRL_Bits.DYN_ARU_UPDATE_EN */
#define IFX_GTM_ARU_0_DYN_CTRL_DYN_ARU_UPDATE_EN_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ARU_0_DYN_CTRL_Bits.DYN_ARU_UPDATE_EN */
#define IFX_GTM_ARU_0_DYN_CTRL_DYN_ARU_UPDATE_EN_OFF      (0)

/** \\brief  Length for Ifx_GTM_ARU_0_DYN_CTRL_Bits.DYN_ROUTE_SWAP */
#define IFX_GTM_ARU_0_DYN_CTRL_DYN_ROUTE_SWAP_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ARU_0_DYN_CTRL_Bits.DYN_ROUTE_SWAP */
#define IFX_GTM_ARU_0_DYN_CTRL_DYN_ROUTE_SWAP_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ARU_0_DYN_CTRL_Bits.DYN_ROUTE_SWAP */
#define IFX_GTM_ARU_0_DYN_CTRL_DYN_ROUTE_SWAP_OFF         (1)

/** \\brief  Length for Ifx_GTM_ARU_0_DYN_RDADDR_Bits.DYN_ARU_RDADDR */
#define IFX_GTM_ARU_0_DYN_RDADDR_DYN_ARU_RDADDR_LEN       (9)

/** \\brief  Mask for Ifx_GTM_ARU_0_DYN_RDADDR_Bits.DYN_ARU_RDADDR */
#define IFX_GTM_ARU_0_DYN_RDADDR_DYN_ARU_RDADDR_MSK       (0x1ff)

/** \\brief  Offset for Ifx_GTM_ARU_0_DYN_RDADDR_Bits.DYN_ARU_RDADDR */
#define IFX_GTM_ARU_0_DYN_RDADDR_DYN_ARU_RDADDR_OFF       (0)

/** \\brief  Length for Ifx_GTM_ARU_0_DYN_ROUTE_HIGH_Bits.DYN_CLK_WAIT */
#define IFX_GTM_ARU_0_DYN_ROUTE_HIGH_DYN_CLK_WAIT_LEN     (4)

/** \\brief  Mask for Ifx_GTM_ARU_0_DYN_ROUTE_HIGH_Bits.DYN_CLK_WAIT */
#define IFX_GTM_ARU_0_DYN_ROUTE_HIGH_DYN_CLK_WAIT_MSK     (0xf)

/** \\brief  Offset for Ifx_GTM_ARU_0_DYN_ROUTE_HIGH_Bits.DYN_CLK_WAIT */
#define IFX_GTM_ARU_0_DYN_ROUTE_HIGH_DYN_CLK_WAIT_OFF     (24)

/** \\brief  Length for Ifx_GTM_ARU_0_DYN_ROUTE_HIGH_Bits.DYN_READ_ID3 */
#define IFX_GTM_ARU_0_DYN_ROUTE_HIGH_DYN_READ_ID3_LEN     (8)

/** \\brief  Mask for Ifx_GTM_ARU_0_DYN_ROUTE_HIGH_Bits.DYN_READ_ID3 */
#define IFX_GTM_ARU_0_DYN_ROUTE_HIGH_DYN_READ_ID3_MSK     (0xff)

/** \\brief  Offset for Ifx_GTM_ARU_0_DYN_ROUTE_HIGH_Bits.DYN_READ_ID3 */
#define IFX_GTM_ARU_0_DYN_ROUTE_HIGH_DYN_READ_ID3_OFF     (0)

/** \\brief  Length for Ifx_GTM_ARU_0_DYN_ROUTE_HIGH_Bits.DYN_READ_ID4 */
#define IFX_GTM_ARU_0_DYN_ROUTE_HIGH_DYN_READ_ID4_LEN     (8)

/** \\brief  Mask for Ifx_GTM_ARU_0_DYN_ROUTE_HIGH_Bits.DYN_READ_ID4 */
#define IFX_GTM_ARU_0_DYN_ROUTE_HIGH_DYN_READ_ID4_MSK     (0xff)

/** \\brief  Offset for Ifx_GTM_ARU_0_DYN_ROUTE_HIGH_Bits.DYN_READ_ID4 */
#define IFX_GTM_ARU_0_DYN_ROUTE_HIGH_DYN_READ_ID4_OFF     (8)

/** \\brief  Length for Ifx_GTM_ARU_0_DYN_ROUTE_HIGH_Bits.DYN_READ_ID5 */
#define IFX_GTM_ARU_0_DYN_ROUTE_HIGH_DYN_READ_ID5_LEN     (8)

/** \\brief  Mask for Ifx_GTM_ARU_0_DYN_ROUTE_HIGH_Bits.DYN_READ_ID5 */
#define IFX_GTM_ARU_0_DYN_ROUTE_HIGH_DYN_READ_ID5_MSK     (0xff)

/** \\brief  Offset for Ifx_GTM_ARU_0_DYN_ROUTE_HIGH_Bits.DYN_READ_ID5 */
#define IFX_GTM_ARU_0_DYN_ROUTE_HIGH_DYN_READ_ID5_OFF     (16)

/** \\brief  Length for Ifx_GTM_ARU_0_DYN_ROUTE_LOW_Bits.DYN_READ_ID0 */
#define IFX_GTM_ARU_0_DYN_ROUTE_LOW_DYN_READ_ID0_LEN      (8)

/** \\brief  Mask for Ifx_GTM_ARU_0_DYN_ROUTE_LOW_Bits.DYN_READ_ID0 */
#define IFX_GTM_ARU_0_DYN_ROUTE_LOW_DYN_READ_ID0_MSK      (0xff)

/** \\brief  Offset for Ifx_GTM_ARU_0_DYN_ROUTE_LOW_Bits.DYN_READ_ID0 */
#define IFX_GTM_ARU_0_DYN_ROUTE_LOW_DYN_READ_ID0_OFF      (0)

/** \\brief  Length for Ifx_GTM_ARU_0_DYN_ROUTE_LOW_Bits.DYN_READ_ID1 */
#define IFX_GTM_ARU_0_DYN_ROUTE_LOW_DYN_READ_ID1_LEN      (8)

/** \\brief  Mask for Ifx_GTM_ARU_0_DYN_ROUTE_LOW_Bits.DYN_READ_ID1 */
#define IFX_GTM_ARU_0_DYN_ROUTE_LOW_DYN_READ_ID1_MSK      (0xff)

/** \\brief  Offset for Ifx_GTM_ARU_0_DYN_ROUTE_LOW_Bits.DYN_READ_ID1 */
#define IFX_GTM_ARU_0_DYN_ROUTE_LOW_DYN_READ_ID1_OFF      (8)

/** \\brief  Length for Ifx_GTM_ARU_0_DYN_ROUTE_LOW_Bits.DYN_READ_ID2 */
#define IFX_GTM_ARU_0_DYN_ROUTE_LOW_DYN_READ_ID2_LEN      (8)

/** \\brief  Mask for Ifx_GTM_ARU_0_DYN_ROUTE_LOW_Bits.DYN_READ_ID2 */
#define IFX_GTM_ARU_0_DYN_ROUTE_LOW_DYN_READ_ID2_MSK      (0xff)

/** \\brief  Offset for Ifx_GTM_ARU_0_DYN_ROUTE_LOW_Bits.DYN_READ_ID2 */
#define IFX_GTM_ARU_0_DYN_ROUTE_LOW_DYN_READ_ID2_OFF      (16)

/** \\brief  Length for Ifx_GTM_ARU_0_DYN_ROUTE_SR_HIGH_Bits.DYN_CLK_WAIT */
#define IFX_GTM_ARU_0_DYN_ROUTE_SR_HIGH_DYN_CLK_WAIT_LEN  (4)

/** \\brief  Mask for Ifx_GTM_ARU_0_DYN_ROUTE_SR_HIGH_Bits.DYN_CLK_WAIT */
#define IFX_GTM_ARU_0_DYN_ROUTE_SR_HIGH_DYN_CLK_WAIT_MSK  (0xf)

/** \\brief  Offset for Ifx_GTM_ARU_0_DYN_ROUTE_SR_HIGH_Bits.DYN_CLK_WAIT */
#define IFX_GTM_ARU_0_DYN_ROUTE_SR_HIGH_DYN_CLK_WAIT_OFF  (24)

/** \\brief  Length for Ifx_GTM_ARU_0_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID10 */
#define IFX_GTM_ARU_0_DYN_ROUTE_SR_HIGH_DYN_READ_ID10_LEN (8)

/** \\brief  Mask for Ifx_GTM_ARU_0_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID10 */
#define IFX_GTM_ARU_0_DYN_ROUTE_SR_HIGH_DYN_READ_ID10_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_ARU_0_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID10 */
#define IFX_GTM_ARU_0_DYN_ROUTE_SR_HIGH_DYN_READ_ID10_OFF (8)

