Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ARU_1_DYN_ROUTE_LOW_Bits.DYN_READ_ID2 */
#define IFX_GTM_ARU_1_DYN_ROUTE_LOW_DYN_READ_ID2_LEN      (8)

/** \\brief  Mask for Ifx_GTM_ARU_1_DYN_ROUTE_LOW_Bits.DYN_READ_ID2 */
#define IFX_GTM_ARU_1_DYN_ROUTE_LOW_DYN_READ_ID2_MSK      (0xff)

/** \\brief  Offset for Ifx_GTM_ARU_1_DYN_ROUTE_LOW_Bits.DYN_READ_ID2 */
#define IFX_GTM_ARU_1_DYN_ROUTE_LOW_DYN_READ_ID2_OFF      (16)

/** \\brief  Length for Ifx_GTM_ARU_1_DYN_ROUTE_SR_HIGH_Bits.DYN_CLK_WAIT */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_HIGH_DYN_CLK_WAIT_LEN  (4)

/** \\brief  Mask for Ifx_GTM_ARU_1_DYN_ROUTE_SR_HIGH_Bits.DYN_CLK_WAIT */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_HIGH_DYN_CLK_WAIT_MSK  (0xf)

/** \\brief  Offset for Ifx_GTM_ARU_1_DYN_ROUTE_SR_HIGH_Bits.DYN_CLK_WAIT */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_HIGH_DYN_CLK_WAIT_OFF  (24)

/** \\brief  Length for Ifx_GTM_ARU_1_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID10 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_HIGH_DYN_READ_ID10_LEN (8)

/** \\brief  Mask for Ifx_GTM_ARU_1_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID10 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_HIGH_DYN_READ_ID10_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_ARU_1_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID10 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_HIGH_DYN_READ_ID10_OFF (8)

/** \\brief  Length for Ifx_GTM_ARU_1_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID11 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_HIGH_DYN_READ_ID11_LEN (8)

/** \\brief  Mask for Ifx_GTM_ARU_1_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID11 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_HIGH_DYN_READ_ID11_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_ARU_1_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID11 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_HIGH_DYN_READ_ID11_OFF (16)

/** \\brief  Length for Ifx_GTM_ARU_1_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID9 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_HIGH_DYN_READ_ID9_LEN  (8)

/** \\brief  Mask for Ifx_GTM_ARU_1_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID9 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_HIGH_DYN_READ_ID9_MSK  (0xff)

/** \\brief  Offset for Ifx_GTM_ARU_1_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID9 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_HIGH_DYN_READ_ID9_OFF  (0)

/** \\brief  Length for Ifx_GTM_ARU_1_DYN_ROUTE_SR_HIGH_Bits.DYN_UPDATE_EN */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_HIGH_DYN_UPDATE_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_ARU_1_DYN_ROUTE_SR_HIGH_Bits.DYN_UPDATE_EN */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_HIGH_DYN_UPDATE_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ARU_1_DYN_ROUTE_SR_HIGH_Bits.DYN_UPDATE_EN */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_HIGH_DYN_UPDATE_EN_OFF (28)

/** \\brief  Length for Ifx_GTM_ARU_1_DYN_ROUTE_SR_LOW_Bits.DYN_READ_ID6 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_LOW_DYN_READ_ID6_LEN   (8)

/** \\brief  Mask for Ifx_GTM_ARU_1_DYN_ROUTE_SR_LOW_Bits.DYN_READ_ID6 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_LOW_DYN_READ_ID6_MSK   (0xff)

/** \\brief  Offset for Ifx_GTM_ARU_1_DYN_ROUTE_SR_LOW_Bits.DYN_READ_ID6 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_LOW_DYN_READ_ID6_OFF   (0)

/** \\brief  Length for Ifx_GTM_ARU_1_DYN_ROUTE_SR_LOW_Bits.DYN_READ_ID7 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_LOW_DYN_READ_ID7_LEN   (8)

/** \\brief  Mask for Ifx_GTM_ARU_1_DYN_ROUTE_SR_LOW_Bits.DYN_READ_ID7 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_LOW_DYN_READ_ID7_MSK   (0xff)

/** \\brief  Offset for Ifx_GTM_ARU_1_DYN_ROUTE_SR_LOW_Bits.DYN_READ_ID7 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_LOW_DYN_READ_ID7_OFF   (8)

/** \\brief  Length for Ifx_GTM_ARU_1_DYN_ROUTE_SR_LOW_Bits.DYN_READ_ID8 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_LOW_DYN_READ_ID8_LEN   (8)

/** \\brief  Mask for Ifx_GTM_ARU_1_DYN_ROUTE_SR_LOW_Bits.DYN_READ_ID8 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_LOW_DYN_READ_ID8_MSK   (0xff)

/** \\brief  Offset for Ifx_GTM_ARU_1_DYN_ROUTE_SR_LOW_Bits.DYN_READ_ID8 */
#define IFX_GTM_ARU_1_DYN_ROUTE_SR_LOW_DYN_READ_ID8_OFF   (16)

/** \\brief  Length for Ifx_GTM_ARU_ARU_ACCESS_Bits.ADDR */
#define IFX_GTM_ARU_ARU_ACCESS_ADDR_LEN                   (9)

/** \\brief  Mask for Ifx_GTM_ARU_ARU_ACCESS_Bits.ADDR */
#define IFX_GTM_ARU_ARU_ACCESS_ADDR_MSK                   (0x1ff)

/** \\brief  Offset for Ifx_GTM_ARU_ARU_ACCESS_Bits.ADDR */
#define IFX_GTM_ARU_ARU_ACCESS_ADDR_OFF                   (0)

/** \\brief  Length for Ifx_GTM_ARU_ARU_ACCESS_Bits.RREQ */
#define IFX_GTM_ARU_ARU_ACCESS_RREQ_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_ARU_ARU_ACCESS_Bits.RREQ */
#define IFX_GTM_ARU_ARU_ACCESS_RREQ_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_ARU_ARU_ACCESS_Bits.RREQ */
#define IFX_GTM_ARU_ARU_ACCESS_RREQ_OFF                   (12)

/** \\brief  Length for Ifx_GTM_ARU_ARU_ACCESS_Bits.WREQ */
#define IFX_GTM_ARU_ARU_ACCESS_WREQ_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_ARU_ARU_ACCESS_Bits.WREQ */
#define IFX_GTM_ARU_ARU_ACCESS_WREQ_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_ARU_ARU_ACCESS_Bits.WREQ */
#define IFX_GTM_ARU_ARU_ACCESS_WREQ_OFF                   (13)

/** \\brief  Length for Ifx_GTM_ARU_CADDR_Bits.CADDR_0 */
#define IFX_GTM_ARU_CADDR_CADDR_0_LEN                     (7)

/** \\brief  Mask for Ifx_GTM_ARU_CADDR_Bits.CADDR_0 */
#define IFX_GTM_ARU_CADDR_CADDR_0_MSK                     (0x7f)

/** \\brief  Offset for Ifx_GTM_ARU_CADDR_Bits.CADDR_0 */
#define IFX_GTM_ARU_CADDR_CADDR_0_OFF                     (0)

/** \\brief  Length for Ifx_GTM_ARU_CADDR_Bits.CADDR_1 */
#define IFX_GTM_ARU_CADDR_CADDR_1_LEN                     (7)

/** \\brief  Mask for Ifx_GTM_ARU_CADDR_Bits.CADDR_1 */
#define IFX_GTM_ARU_CADDR_CADDR_1_MSK                     (0x7f)

/** \\brief  Offset for Ifx_GTM_ARU_CADDR_Bits.CADDR_1 */
#define IFX_GTM_ARU_CADDR_CADDR_1_OFF                     (16)

/** \\brief  Length for Ifx_GTM_ARU_CADDR_END_Bits.CADDR_END */
#define IFX_GTM_ARU_CADDR_END_CADDR_END_LEN               (7)

/** \\brief  Mask for Ifx_GTM_ARU_CADDR_END_Bits.CADDR_END */
#define IFX_GTM_ARU_CADDR_END_CADDR_END_MSK               (0x7f)

/** \\brief  Offset for Ifx_GTM_ARU_CADDR_END_Bits.CADDR_END */
#define IFX_GTM_ARU_CADDR_END_CADDR_END_OFF               (0)

/** \\brief  Length for Ifx_GTM_ARU_CTRL_Bits.ARU_0_DYN_EN */
#define IFX_GTM_ARU_CTRL_ARU_0_DYN_EN_LEN                 (2)

/** \\brief  Mask for Ifx_GTM_ARU_CTRL_Bits.ARU_0_DYN_EN */
#define IFX_GTM_ARU_CTRL_ARU_0_DYN_EN_MSK                 (0x3)

/** \\brief  Offset for Ifx_GTM_ARU_CTRL_Bits.ARU_0_DYN_EN */
#define IFX_GTM_ARU_CTRL_ARU_0_DYN_EN_OFF                 (0)

/** \\brief  Length for Ifx_GTM_ARU_CTRL_Bits.ARU_1_DYN_EN */
#define IFX_GTM_ARU_CTRL_ARU_1_DYN_EN_LEN                 (2)

/** \\brief  Mask for Ifx_GTM_ARU_CTRL_Bits.ARU_1_DYN_EN */
#define IFX_GTM_ARU_CTRL_ARU_1_DYN_EN_MSK                 (0x3)

/** \\brief  Offset for Ifx_GTM_ARU_CTRL_Bits.ARU_1_DYN_EN */
#define IFX_GTM_ARU_CTRL_ARU_1_DYN_EN_OFF                 (2)

/** \\brief  Length for Ifx_GTM_ARU_CTRL_Bits.ARU_DYN_RING_MODE */
#define IFX_GTM_ARU_CTRL_ARU_DYN_RING_MODE_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ARU_CTRL_Bits.ARU_DYN_RING_MODE */
#define IFX_GTM_ARU_CTRL_ARU_DYN_RING_MODE_MSK            (0x1)

