Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ARU_IRQ_NOTIFY_Bits.NEW_DATA0 */
#define IFX_GTM_ARU_IRQ_NOTIFY_NEW_DATA0_OFF              (0)

/** \\brief  Length for Ifx_GTM_ARU_IRQ_NOTIFY_Bits.NEW_DATA1 */
#define IFX_GTM_ARU_IRQ_NOTIFY_NEW_DATA1_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ARU_IRQ_NOTIFY_Bits.NEW_DATA1 */
#define IFX_GTM_ARU_IRQ_NOTIFY_NEW_DATA1_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ARU_IRQ_NOTIFY_Bits.NEW_DATA1 */
#define IFX_GTM_ARU_IRQ_NOTIFY_NEW_DATA1_OFF              (1)

/** \\brief  Length for Ifx_GTM_ATOM10_OUT_Bits.ATOM_I_OUT */
#define IFX_GTM_ATOM10_OUT_ATOM_I_OUT_LEN                 (8)

/** \\brief  Mask for Ifx_GTM_ATOM10_OUT_Bits.ATOM_I_OUT */
#define IFX_GTM_ATOM10_OUT_ATOM_I_OUT_MSK                 (0xff)

/** \\brief  Length for Ifx_GTM_ATOM10_OUT_Bits.ATOM_I_OUT_N */
#define IFX_GTM_ATOM10_OUT_ATOM_I_OUT_N_LEN               (8)

/** \\brief  Mask for Ifx_GTM_ATOM10_OUT_Bits.ATOM_I_OUT_N */
#define IFX_GTM_ATOM10_OUT_ATOM_I_OUT_N_MSK               (0xff)

/** \\brief  Offset for Ifx_GTM_ATOM10_OUT_Bits.ATOM_I_OUT_N */
#define IFX_GTM_ATOM10_OUT_ATOM_I_OUT_N_OFF               (8)

/** \\brief  Offset for Ifx_GTM_ATOM10_OUT_Bits.ATOM_I_OUT */
#define IFX_GTM_ATOM10_OUT_ATOM_I_OUT_OFF                 (0)

/** \\brief  Length for Ifx_GTM_ATOM10_OUT_Bits.ATOM_IP1_OUT */
#define IFX_GTM_ATOM10_OUT_ATOM_IP1_OUT_LEN               (8)

/** \\brief  Mask for Ifx_GTM_ATOM10_OUT_Bits.ATOM_IP1_OUT */
#define IFX_GTM_ATOM10_OUT_ATOM_IP1_OUT_MSK               (0xff)

/** \\brief  Length for Ifx_GTM_ATOM10_OUT_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_ATOM10_OUT_ATOM_IP1_OUT_N_LEN             (8)

/** \\brief  Mask for Ifx_GTM_ATOM10_OUT_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_ATOM10_OUT_ATOM_IP1_OUT_N_MSK             (0xff)

/** \\brief  Offset for Ifx_GTM_ATOM10_OUT_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_ATOM10_OUT_ATOM_IP1_OUT_N_OFF             (24)

/** \\brief  Offset for Ifx_GTM_ATOM10_OUT_Bits.ATOM_IP1_OUT */
#define IFX_GTM_ATOM10_OUT_ATOM_IP1_OUT_OFF               (16)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ACT_TB_Bits.ACT_TB */
#define IFX_GTM_ATOM_AGC_ACT_TB_ACT_TB_LEN                (24)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ACT_TB_Bits.ACT_TB */
#define IFX_GTM_ATOM_AGC_ACT_TB_ACT_TB_MSK                (0xffffff)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ACT_TB_Bits.ACT_TB */
#define IFX_GTM_ATOM_AGC_ACT_TB_ACT_TB_OFF                (0)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ACT_TB_Bits.TB_TRIG */
#define IFX_GTM_ATOM_AGC_ACT_TB_TB_TRIG_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ACT_TB_Bits.TB_TRIG */
#define IFX_GTM_ATOM_AGC_ACT_TB_TB_TRIG_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ACT_TB_Bits.TB_TRIG */
#define IFX_GTM_ATOM_AGC_ACT_TB_TB_TRIG_OFF               (24)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ACT_TB_Bits.TBU_SEL */
#define IFX_GTM_ATOM_AGC_ACT_TB_TBU_SEL_LEN               (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ACT_TB_Bits.TBU_SEL */
#define IFX_GTM_ATOM_AGC_ACT_TB_TBU_SEL_MSK               (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ACT_TB_Bits.TBU_SEL */
#define IFX_GTM_ATOM_AGC_ACT_TB_TBU_SEL_OFF               (25)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL0 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL0_LEN       (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL0 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL0_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL0 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL0_OFF       (0)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL1 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL1_LEN       (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL1 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL1_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL1 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL1_OFF       (2)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL2 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL2_LEN       (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL2 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL2_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL2 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL2_OFF       (4)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL3 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL3_LEN       (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL3 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL3_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL3 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL3_OFF       (6)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL4 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL4_LEN       (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL4 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL4_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL4 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL4_OFF       (8)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL5 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL5_LEN       (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL5 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL5_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL5 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL5_OFF       (10)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL6 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL6_LEN       (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL6 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL6_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL6 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL6_OFF       (12)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL7 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL7_LEN       (2)

