Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL7 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL7_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_CTRL_Bits.ENDIS_CTRL7 */
#define IFX_GTM_ATOM_AGC_ENDIS_CTRL_ENDIS_CTRL7_OFF       (14)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL0 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL0_LEN       (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL0 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL0_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL0 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL0_OFF       (0)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL1 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL1_LEN       (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL1 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL1_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL1 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL1_OFF       (2)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL2 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL2_LEN       (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL2 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL2_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL2 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL2_OFF       (4)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL3 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL3_LEN       (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL3 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL3_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL3 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL3_OFF       (6)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL4 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL4_LEN       (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL4 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL4_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL4 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL4_OFF       (8)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL5 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL5_LEN       (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL5 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL5_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL5 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL5_OFF       (10)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL6 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL6_LEN       (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL6 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL6_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL6 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL6_OFF       (12)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL7 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL7_LEN       (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL7 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL7_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_CTRL7 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_CTRL7_OFF       (14)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL0 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL0_LEN         (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL0 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL0_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL0 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL0_OFF         (0)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL1 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL1_LEN         (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL1 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL1_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL1 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL1_OFF         (2)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL2 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL2_LEN         (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL2 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL2_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL2 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL2_OFF         (4)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL3 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL3_LEN         (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL3 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL3_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL3 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL3_OFF         (6)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL4 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL4_LEN         (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL4 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL4_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL4 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL4_OFF         (8)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL5 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL5_LEN         (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL5 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL5_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL5 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL5_OFF         (10)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL6 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL6_LEN         (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL6 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL6_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL6 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL6_OFF         (12)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL7 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL7_LEN         (2)

