Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL7 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL7_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL7 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL7_OFF         (14)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH0 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH0_LEN         (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH0 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH0_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH0 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH0_OFF         (16)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH1 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH1_LEN         (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH1 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH1_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH1 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH1_OFF         (18)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH2 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH2_LEN         (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH2 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH2_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH2 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH2_OFF         (20)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH3 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH3_LEN         (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH3 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH3_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH3 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH3_OFF         (22)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH4 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH4_LEN         (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH4 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH4_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH4 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH4_OFF         (24)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH5 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH5_LEN         (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH5 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH5_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH5 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH5_OFF         (26)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH6 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH6_LEN         (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH6 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH6_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH6 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH6_OFF         (28)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH7 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH7_LEN         (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH7 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH7_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH7 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH7_OFF         (30)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.0 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH0_LEN             (1)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.0 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH0_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.0 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH0_OFF             (8)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.1 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH1_LEN             (1)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.1 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH1_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.1 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH1_OFF             (9)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.2 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH2_LEN             (1)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.2 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH2_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.2 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH2_OFF             (10)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.3 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH3_LEN             (1)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.3 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH3_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.3 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH3_OFF             (11)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.4 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH4_LEN             (1)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.4 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH4_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.4 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH4_OFF             (12)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.5 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH5_LEN             (1)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.5 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH5_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.5 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH5_OFF             (13)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.6 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH6_LEN             (1)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.6 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH6_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.6 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH6_OFF             (14)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.7 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH7_LEN             (1)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.7 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH7_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_GLB_CTRL_Bits.7 */
#define IFX_GTM_ATOM_AGC_GLB_CTRL_RST_CH7_OFF             (15)

