Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ATOM_CH_SR1_Bits.SR1 */
#define IFX_GTM_ATOM_CH_SR1_SR1_LEN                       (24)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_SR1_Bits.SR1 */
#define IFX_GTM_ATOM_CH_SR1_SR1_MSK                       (0xffffff)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_SR1_Bits.SR1 */
#define IFX_GTM_ATOM_CH_SR1_SR1_OFF                       (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_STAT_Bits.ACBI */
#define IFX_GTM_ATOM_CH_STAT_ACBI_LEN                     (5)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_STAT_Bits.ACBI */
#define IFX_GTM_ATOM_CH_STAT_ACBI_MSK                     (0x1f)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_STAT_Bits.ACBI */
#define IFX_GTM_ATOM_CH_STAT_ACBI_OFF                     (16)

/** \\brief  Length for Ifx_GTM_ATOM_CH_STAT_Bits.ACBO */
#define IFX_GTM_ATOM_CH_STAT_ACBO_LEN                     (5)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_STAT_Bits.ACBO */
#define IFX_GTM_ATOM_CH_STAT_ACBO_MSK                     (0x1f)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_STAT_Bits.ACBO */
#define IFX_GTM_ATOM_CH_STAT_ACBO_OFF                     (24)

/** \\brief  Length for Ifx_GTM_ATOM_CH_STAT_Bits.DR */
#define IFX_GTM_ATOM_CH_STAT_DR_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_STAT_Bits.DR */
#define IFX_GTM_ATOM_CH_STAT_DR_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_STAT_Bits.DR */
#define IFX_GTM_ATOM_CH_STAT_DR_OFF                       (23)

/** \\brief  Length for Ifx_GTM_ATOM_CH_STAT_Bits.DV */
#define IFX_GTM_ATOM_CH_STAT_DV_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_STAT_Bits.DV */
#define IFX_GTM_ATOM_CH_STAT_DV_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_STAT_Bits.DV */
#define IFX_GTM_ATOM_CH_STAT_DV_OFF                       (21)

/** \\brief  Length for Ifx_GTM_ATOM_CH_STAT_Bits.OL */
#define IFX_GTM_ATOM_CH_STAT_OL_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_STAT_Bits.OL */
#define IFX_GTM_ATOM_CH_STAT_OL_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_STAT_Bits.OL */
#define IFX_GTM_ATOM_CH_STAT_OL_OFF                       (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_STAT_Bits.WRF */
#define IFX_GTM_ATOM_CH_STAT_WRF_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_STAT_Bits.WRF */
#define IFX_GTM_ATOM_CH_STAT_WRF_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_STAT_Bits.WRF */
#define IFX_GTM_ATOM_CH_STAT_WRF_OFF                      (22)

/** \\brief  Length for Ifx_GTM_ATOM_OUT_Bits.ATOM_I_OUT */
#define IFX_GTM_ATOM_OUT_ATOM_I_OUT_LEN                   (8)

/** \\brief  Mask for Ifx_GTM_ATOM_OUT_Bits.ATOM_I_OUT */
#define IFX_GTM_ATOM_OUT_ATOM_I_OUT_MSK                   (0xff)

/** \\brief  Length for Ifx_GTM_ATOM_OUT_Bits.ATOM_I_OUT_N */
#define IFX_GTM_ATOM_OUT_ATOM_I_OUT_N_LEN                 (8)

/** \\brief  Mask for Ifx_GTM_ATOM_OUT_Bits.ATOM_I_OUT_N */
#define IFX_GTM_ATOM_OUT_ATOM_I_OUT_N_MSK                 (0xff)

/** \\brief  Offset for Ifx_GTM_ATOM_OUT_Bits.ATOM_I_OUT_N */
#define IFX_GTM_ATOM_OUT_ATOM_I_OUT_N_OFF                 (8)

/** \\brief  Offset for Ifx_GTM_ATOM_OUT_Bits.ATOM_I_OUT */
#define IFX_GTM_ATOM_OUT_ATOM_I_OUT_OFF                   (0)

/** \\brief  Length for Ifx_GTM_ATOM_OUT_Bits.ATOM_IP1_OUT */
#define IFX_GTM_ATOM_OUT_ATOM_IP1_OUT_LEN                 (8)

/** \\brief  Mask for Ifx_GTM_ATOM_OUT_Bits.ATOM_IP1_OUT */
#define IFX_GTM_ATOM_OUT_ATOM_IP1_OUT_MSK                 (0xff)

/** \\brief  Length for Ifx_GTM_ATOM_OUT_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_ATOM_OUT_ATOM_IP1_OUT_N_LEN               (8)

/** \\brief  Mask for Ifx_GTM_ATOM_OUT_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_ATOM_OUT_ATOM_IP1_OUT_N_MSK               (0xff)

/** \\brief  Offset for Ifx_GTM_ATOM_OUT_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_ATOM_OUT_ATOM_IP1_OUT_N_OFF               (24)

/** \\brief  Offset for Ifx_GTM_ATOM_OUT_Bits.ATOM_IP1_OUT */
#define IFX_GTM_ATOM_OUT_ATOM_IP1_OUT_OFF                 (16)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DEST_ERR_EIRQ_EN */
#define IFX_GTM_BRC_EIRQ_EN_DEST_ERR_EIRQ_EN_LEN          (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DEST_ERR_EIRQ_EN */
#define IFX_GTM_BRC_EIRQ_EN_DEST_ERR_EIRQ_EN_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DEST_ERR_EIRQ_EN */
#define IFX_GTM_BRC_EIRQ_EN_DEST_ERR_EIRQ_EN_OFF          (0)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN0 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN0_LEN              (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN0 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN0_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN0 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN0_OFF              (1)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN10 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN10_LEN             (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN10 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN10_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN10 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN10_OFF             (11)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN11 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN11_LEN             (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN11 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN11_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN11 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN11_OFF             (12)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN1 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN1_LEN              (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN1 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN1_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN1 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN1_OFF              (2)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN2 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN2_LEN              (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN2 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN2_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN2 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN2_OFF              (3)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN3 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN3_LEN              (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN3 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN3_MSK              (0x1)

