Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN3 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN3_OFF              (4)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN4 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN4_LEN              (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN4 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN4_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN4 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN4_OFF              (5)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN5 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN5_LEN              (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN5 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN5_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN5 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN5_OFF              (6)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN6 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN6_LEN              (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN6 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN6_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN6 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN6_OFF              (7)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN7 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN7_LEN              (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN7 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN7_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN7 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN7_OFF              (8)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN8 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN8_LEN              (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN8 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN8_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN8 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN8_OFF              (9)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN9 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN9_LEN              (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN9 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN9_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN9 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN9_OFF              (10)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.Reserved */
#define IFX_GTM_BRC_EIRQ_EN_RESERVED_LEN                  (19)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.Reserved */
#define IFX_GTM_BRC_EIRQ_EN_RESERVED_MSK                  (0x7ffff)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.Reserved */
#define IFX_GTM_BRC_EIRQ_EN_RESERVED_OFF                  (13)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DEST_ERR_IRQ_EN */
#define IFX_GTM_BRC_IRQ_EN_DEST_ERR_IRQ_EN_LEN            (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DEST_ERR_IRQ_EN */
#define IFX_GTM_BRC_IRQ_EN_DEST_ERR_IRQ_EN_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DEST_ERR_IRQ_EN */
#define IFX_GTM_BRC_IRQ_EN_DEST_ERR_IRQ_EN_OFF            (0)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN0 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN0_LEN                (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN0 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN0_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN0 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN0_OFF                (1)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN10 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN10_LEN               (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN10 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN10_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN10 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN10_OFF               (11)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN11 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN11_LEN               (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN11 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN11_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN11 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN11_OFF               (12)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN1 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN1_LEN                (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN1 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN1_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN1 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN1_OFF                (2)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN2 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN2_LEN                (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN2 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN2_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN2 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN2_OFF                (3)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN3 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN3_LEN                (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN3 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN3_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN3 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN3_OFF                (4)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN4 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN4_LEN                (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN4 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN4_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN4 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN4_OFF                (5)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN5 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN5_LEN                (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN5 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN5_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN5 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN5_OFF                (6)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN6 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN6_LEN                (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN6 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN6_MSK                (0x1)

