Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID8 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID8_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID8 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID8_OFF              (9)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID9 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID9_LEN              (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID9 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID9_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID9 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID9_OFF              (10)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_BRC_IRQ_MODE_IRQ_MODE_LEN                 (2)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_BRC_IRQ_MODE_IRQ_MODE_MSK                 (0x3)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_BRC_IRQ_MODE_IRQ_MODE_OFF                 (0)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DEST_ERR */
#define IFX_GTM_BRC_IRQ_NOTIFY_DEST_ERR_LEN               (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DEST_ERR */
#define IFX_GTM_BRC_IRQ_NOTIFY_DEST_ERR_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DEST_ERR */
#define IFX_GTM_BRC_IRQ_NOTIFY_DEST_ERR_OFF               (0)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID0 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID0_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID0 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID0_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID0 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID0_OFF                   (1)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID10 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID10_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID10 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID10_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID10 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID10_OFF                  (11)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID11 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID11_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID11 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID11_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID11 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID11_OFF                  (12)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID1 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID1_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID1 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID1_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID1 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID1_OFF                   (2)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID2 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID2_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID2 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID2_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID2 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID2_OFF                   (3)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID3 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID3_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID3 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID3_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID3 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID3_OFF                   (4)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID4 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID4_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID4 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID4_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID4 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID4_OFF                   (5)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID5 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID5_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID5 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID5_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID5 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID5_OFF                   (6)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID6 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID6_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID6 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID6_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID6 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID6_OFF                   (7)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID7 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID7_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID7 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID7_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID7 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID7_OFF                   (8)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID8 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID8_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID8 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID8_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID8 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID8_OFF                   (9)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID9 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID9_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID9 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID9_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID9 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID9_OFF                   (10)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.Reserved */
#define IFX_GTM_BRC_IRQ_NOTIFY_RESERVED_LEN               (19)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.Reserved */
#define IFX_GTM_BRC_IRQ_NOTIFY_RESERVED_MSK               (0x7ffff)

