Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST21_OFF                (21)

/** \\brief  Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST2_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST2_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST2_OFF                 (2)

/** \\brief  Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST3_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST3_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST3_OFF                 (3)

/** \\brief  Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST4_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST4_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST4_OFF                 (4)

/** \\brief  Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST5_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST5_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST5_OFF                 (5)

/** \\brief  Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST6_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST6_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST6_OFF                 (6)

/** \\brief  Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST7_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST7_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST7_OFF                 (7)

/** \\brief  Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST8_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST8_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST8_OFF                 (8)

/** \\brief  Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST9_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST9_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC_DEST_EN_DEST9_OFF                 (9)

/** \\brief  Length for Ifx_GTM_BRC_SRC_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC_DEST_EN_TRASHBIN_LEN              (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC_DEST_EN_TRASHBIN_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC_DEST_EN_TRASHBIN_OFF              (22)

/** \\brief  Length for Ifx_GTM_BRC_SRC_DEST_Bits.Reserved */
#define IFX_GTM_BRC_SRC_DEST_RESERVED_LEN                 (9)

/** \\brief  Mask for Ifx_GTM_BRC_SRC_DEST_Bits.Reserved */
#define IFX_GTM_BRC_SRC_DEST_RESERVED_MSK                 (0x1ff)

/** \\brief  Offset for Ifx_GTM_BRC_SRC_DEST_Bits.Reserved */
#define IFX_GTM_BRC_SRC_DEST_RESERVED_OFF                 (23)

/** \\brief  Length for Ifx_GTM_BRIDGE_MODE_Bits.BRG_MODE */
#define IFX_GTM_BRIDGE_MODE_BRG_MODE_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_BRIDGE_MODE_Bits.BRG_MODE */
#define IFX_GTM_BRIDGE_MODE_BRG_MODE_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_BRIDGE_MODE_Bits.BRG_MODE */
#define IFX_GTM_BRIDGE_MODE_BRG_MODE_OFF                  (0)

/** \\brief  Length for Ifx_GTM_BRIDGE_MODE_Bits.BRG_RST */
#define IFX_GTM_BRIDGE_MODE_BRG_RST_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_BRIDGE_MODE_Bits.BRG_RST */
#define IFX_GTM_BRIDGE_MODE_BRG_RST_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_BRIDGE_MODE_Bits.BRG_RST */
#define IFX_GTM_BRIDGE_MODE_BRG_RST_OFF                   (16)

/** \\brief  Length for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_DPT */
#define IFX_GTM_BRIDGE_MODE_BUFF_DPT_LEN                  (8)

/** \\brief  Mask for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_DPT */
#define IFX_GTM_BRIDGE_MODE_BUFF_DPT_MSK                  (0xff)

/** \\brief  Offset for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_DPT */
#define IFX_GTM_BRIDGE_MODE_BUFF_DPT_OFF                  (24)

/** \\brief  Length for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_OVL */
#define IFX_GTM_BRIDGE_MODE_BUFF_OVL_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_OVL */
#define IFX_GTM_BRIDGE_MODE_BUFF_OVL_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_OVL */
#define IFX_GTM_BRIDGE_MODE_BUFF_OVL_OFF                  (9)

/** \\brief  Length for Ifx_GTM_BRIDGE_MODE_Bits.BYPASS_SYNC */
#define IFX_GTM_BRIDGE_MODE_BYPASS_SYNC_LEN               (1)

/** \\brief  Mask for Ifx_GTM_BRIDGE_MODE_Bits.BYPASS_SYNC */
#define IFX_GTM_BRIDGE_MODE_BYPASS_SYNC_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_BRIDGE_MODE_Bits.BYPASS_SYNC */
#define IFX_GTM_BRIDGE_MODE_BYPASS_SYNC_OFF               (2)

/** \\brief  Length for Ifx_GTM_BRIDGE_MODE_Bits.MODE_UP_PGR */
#define IFX_GTM_BRIDGE_MODE_MODE_UP_PGR_LEN               (1)

/** \\brief  Mask for Ifx_GTM_BRIDGE_MODE_Bits.MODE_UP_PGR */
#define IFX_GTM_BRIDGE_MODE_MODE_UP_PGR_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_BRIDGE_MODE_Bits.MODE_UP_PGR */
#define IFX_GTM_BRIDGE_MODE_MODE_UP_PGR_OFF               (8)

