Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_BRIDGE_MODE_Bits.MSK_WR_RSP */
#define IFX_GTM_BRIDGE_MODE_MSK_WR_RSP_LEN                (1)

/** \\brief  Mask for Ifx_GTM_BRIDGE_MODE_Bits.MSK_WR_RSP */
#define IFX_GTM_BRIDGE_MODE_MSK_WR_RSP_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_BRIDGE_MODE_Bits.MSK_WR_RSP */
#define IFX_GTM_BRIDGE_MODE_MSK_WR_RSP_OFF                (1)

/** \\brief  Length for Ifx_GTM_BRIDGE_MODE_Bits.SYNC_INPUT_REG */
#define IFX_GTM_BRIDGE_MODE_SYNC_INPUT_REG_LEN            (1)

/** \\brief  Mask for Ifx_GTM_BRIDGE_MODE_Bits.SYNC_INPUT_REG */
#define IFX_GTM_BRIDGE_MODE_SYNC_INPUT_REG_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_BRIDGE_MODE_Bits.SYNC_INPUT_REG */
#define IFX_GTM_BRIDGE_MODE_SYNC_INPUT_REG_OFF            (12)

/** \\brief  Length for Ifx_GTM_BRIDGE_PTR1_Bits.ABT_TRAN_PGR */
#define IFX_GTM_BRIDGE_PTR1_ABT_TRAN_PGR_LEN              (5)

/** \\brief  Mask for Ifx_GTM_BRIDGE_PTR1_Bits.ABT_TRAN_PGR */
#define IFX_GTM_BRIDGE_PTR1_ABT_TRAN_PGR_MSK              (0x1f)

/** \\brief  Offset for Ifx_GTM_BRIDGE_PTR1_Bits.ABT_TRAN_PGR */
#define IFX_GTM_BRIDGE_PTR1_ABT_TRAN_PGR_OFF              (15)

/** \\brief  Length for Ifx_GTM_BRIDGE_PTR1_Bits.FBC */
#define IFX_GTM_BRIDGE_PTR1_FBC_LEN                       (6)

/** \\brief  Mask for Ifx_GTM_BRIDGE_PTR1_Bits.FBC */
#define IFX_GTM_BRIDGE_PTR1_FBC_MSK                       (0x3f)

/** \\brief  Offset for Ifx_GTM_BRIDGE_PTR1_Bits.FBC */
#define IFX_GTM_BRIDGE_PTR1_FBC_OFF                       (20)

/** \\brief  Length for Ifx_GTM_BRIDGE_PTR1_Bits.FIRST_RSP_PTR */
#define IFX_GTM_BRIDGE_PTR1_FIRST_RSP_PTR_LEN             (5)

/** \\brief  Mask for Ifx_GTM_BRIDGE_PTR1_Bits.FIRST_RSP_PTR */
#define IFX_GTM_BRIDGE_PTR1_FIRST_RSP_PTR_MSK             (0x1f)

/** \\brief  Offset for Ifx_GTM_BRIDGE_PTR1_Bits.FIRST_RSP_PTR */
#define IFX_GTM_BRIDGE_PTR1_FIRST_RSP_PTR_OFF             (5)

/** \\brief  Length for Ifx_GTM_BRIDGE_PTR1_Bits.NEW_TRAN_PTR */
#define IFX_GTM_BRIDGE_PTR1_NEW_TRAN_PTR_LEN              (5)

/** \\brief  Mask for Ifx_GTM_BRIDGE_PTR1_Bits.NEW_TRAN_PTR */
#define IFX_GTM_BRIDGE_PTR1_NEW_TRAN_PTR_MSK              (0x1f)

/** \\brief  Offset for Ifx_GTM_BRIDGE_PTR1_Bits.NEW_TRAN_PTR */
#define IFX_GTM_BRIDGE_PTR1_NEW_TRAN_PTR_OFF              (0)

/** \\brief  Length for Ifx_GTM_BRIDGE_PTR1_Bits.RSP_TRAN_RDY */
#define IFX_GTM_BRIDGE_PTR1_RSP_TRAN_RDY_LEN              (6)

/** \\brief  Mask for Ifx_GTM_BRIDGE_PTR1_Bits.RSP_TRAN_RDY */
#define IFX_GTM_BRIDGE_PTR1_RSP_TRAN_RDY_MSK              (0x3f)

/** \\brief  Offset for Ifx_GTM_BRIDGE_PTR1_Bits.RSP_TRAN_RDY */
#define IFX_GTM_BRIDGE_PTR1_RSP_TRAN_RDY_OFF              (26)

/** \\brief  Length for Ifx_GTM_BRIDGE_PTR1_Bits.TRAN_IN_PGR */
#define IFX_GTM_BRIDGE_PTR1_TRAN_IN_PGR_LEN               (5)

/** \\brief  Mask for Ifx_GTM_BRIDGE_PTR1_Bits.TRAN_IN_PGR */
#define IFX_GTM_BRIDGE_PTR1_TRAN_IN_PGR_MSK               (0x1f)

/** \\brief  Offset for Ifx_GTM_BRIDGE_PTR1_Bits.TRAN_IN_PGR */
#define IFX_GTM_BRIDGE_PTR1_TRAN_IN_PGR_OFF               (10)

/** \\brief  Length for Ifx_GTM_BRIDGE_PTR2_Bits.TRAN_IN_PGR2 */
#define IFX_GTM_BRIDGE_PTR2_TRAN_IN_PGR2_LEN              (5)

/** \\brief  Mask for Ifx_GTM_BRIDGE_PTR2_Bits.TRAN_IN_PGR2 */
#define IFX_GTM_BRIDGE_PTR2_TRAN_IN_PGR2_MSK              (0x1f)

/** \\brief  Offset for Ifx_GTM_BRIDGE_PTR2_Bits.TRAN_IN_PGR2 */
#define IFX_GTM_BRIDGE_PTR2_TRAN_IN_PGR2_OFF              (0)

/** \\brief  Length for Ifx_GTM_CCM10_CFG_Bits.CLS_CLK_DIV */
#define IFX_GTM_CCM10_CFG_CLS_CLK_DIV_LEN                 (2)

/** \\brief  Mask for Ifx_GTM_CCM10_CFG_Bits.CLS_CLK_DIV */
#define IFX_GTM_CCM10_CFG_CLS_CLK_DIV_MSK                 (0x3)

/** \\brief  Offset for Ifx_GTM_CCM10_CFG_Bits.CLS_CLK_DIV */
#define IFX_GTM_CCM10_CFG_CLS_CLK_DIV_OFF                 (16)

/** \\brief  Length for Ifx_GTM_CCM10_CFG_Bits.EN_ATOM_ADTM */
#define IFX_GTM_CCM10_CFG_EN_ATOM_ADTM_LEN                (1)

/** \\brief  Mask for Ifx_GTM_CCM10_CFG_Bits.EN_ATOM_ADTM */
#define IFX_GTM_CCM10_CFG_EN_ATOM_ADTM_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_CFG_Bits.EN_ATOM_ADTM */
#define IFX_GTM_CCM10_CFG_EN_ATOM_ADTM_OFF                (2)

/** \\brief  Length for Ifx_GTM_CCM10_CFG_Bits.EN_BRC */
#define IFX_GTM_CCM10_CFG_EN_BRC_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_CCM10_CFG_Bits.EN_BRC */
#define IFX_GTM_CCM10_CFG_EN_BRC_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_CFG_Bits.EN_BRC */
#define IFX_GTM_CCM10_CFG_EN_BRC_OFF                      (5)

/** \\brief  Length for Ifx_GTM_CCM10_CFG_Bits.EN_CMP_MON */
#define IFX_GTM_CCM10_CFG_EN_CMP_MON_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM10_CFG_Bits.EN_CMP_MON */
#define IFX_GTM_CCM10_CFG_EN_CMP_MON_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_CFG_Bits.EN_CMP_MON */
#define IFX_GTM_CCM10_CFG_EN_CMP_MON_OFF                  (7)

/** \\brief  Length for Ifx_GTM_CCM10_CFG_Bits.EN_DPLL_MAP */
#define IFX_GTM_CCM10_CFG_EN_DPLL_MAP_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_CCM10_CFG_Bits.EN_DPLL_MAP */
#define IFX_GTM_CCM10_CFG_EN_DPLL_MAP_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_CFG_Bits.EN_DPLL_MAP */
#define IFX_GTM_CCM10_CFG_EN_DPLL_MAP_OFF                 (4)

/** \\brief  Length for Ifx_GTM_CCM10_CFG_Bits.EN_MCS */
#define IFX_GTM_CCM10_CFG_EN_MCS_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_CCM10_CFG_Bits.EN_MCS */
#define IFX_GTM_CCM10_CFG_EN_MCS_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_CFG_Bits.EN_MCS */
#define IFX_GTM_CCM10_CFG_EN_MCS_OFF                      (3)

/** \\brief  Length for Ifx_GTM_CCM10_CFG_Bits.EN_PSM */
#define IFX_GTM_CCM10_CFG_EN_PSM_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_CCM10_CFG_Bits.EN_PSM */
#define IFX_GTM_CCM10_CFG_EN_PSM_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_CFG_Bits.EN_PSM */
#define IFX_GTM_CCM10_CFG_EN_PSM_OFF                      (6)

