Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_CCM10_HW_CONF_Bits.ATOM_TRIG_CHAIN */
#define IFX_GTM_CCM10_HW_CONF_ATOM_TRIG_CHAIN_OFF         (5)

/** \\brief  Length for Ifx_GTM_CCM10_HW_CONF_Bits.ATOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM10_HW_CONF_ATOM_TRIG_INTCHAIN_LEN      (4)

/** \\brief  Mask for Ifx_GTM_CCM10_HW_CONF_Bits.ATOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM10_HW_CONF_ATOM_TRIG_INTCHAIN_MSK      (0xf)

/** \\brief  Offset for Ifx_GTM_CCM10_HW_CONF_Bits.ATOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM10_HW_CONF_ATOM_TRIG_INTCHAIN_OFF      (20)

/** \\brief  Length for Ifx_GTM_CCM10_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_CCM10_HW_CONF_BRIDGE_MODE_RST_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CCM10_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_CCM10_HW_CONF_BRIDGE_MODE_RST_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_CCM10_HW_CONF_BRIDGE_MODE_RST_OFF         (1)

/** \\brief  Length for Ifx_GTM_CCM10_HW_CONF_Bits.CFG_CLOCK_RATE */
#define IFX_GTM_CCM10_HW_CONF_CFG_CLOCK_RATE_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CCM10_HW_CONF_Bits.CFG_CLOCK_RATE */
#define IFX_GTM_CCM10_HW_CONF_CFG_CLOCK_RATE_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_HW_CONF_Bits.CFG_CLOCK_RATE */
#define IFX_GTM_CCM10_HW_CONF_CFG_CLOCK_RATE_OFF          (3)

/** \\brief  Length for Ifx_GTM_CCM10_HW_CONF_Bits.ERM */
#define IFX_GTM_CCM10_HW_CONF_ERM_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_CCM10_HW_CONF_Bits.ERM */
#define IFX_GTM_CCM10_HW_CONF_ERM_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_HW_CONF_Bits.ERM */
#define IFX_GTM_CCM10_HW_CONF_ERM_OFF                     (13)

/** \\brief  Length for Ifx_GTM_CCM10_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_CCM10_HW_CONF_GRSTEN_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM10_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_CCM10_HW_CONF_GRSTEN_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_CCM10_HW_CONF_GRSTEN_OFF                  (0)

/** \\brief  Length for Ifx_GTM_CCM10_HW_CONF_Bits.INT_CLK_EN_GEN */
#define IFX_GTM_CCM10_HW_CONF_INT_CLK_EN_GEN_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CCM10_HW_CONF_Bits.INT_CLK_EN_GEN */
#define IFX_GTM_CCM10_HW_CONF_INT_CLK_EN_GEN_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_HW_CONF_Bits.INT_CLK_EN_GEN */
#define IFX_GTM_CCM10_HW_CONF_INT_CLK_EN_GEN_OFF          (29)

/** \\brief  Length for Ifx_GTM_CCM10_HW_CONF_Bits.IRQ_MODE_LEVEL */
#define IFX_GTM_CCM10_HW_CONF_IRQ_MODE_LEVEL_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CCM10_HW_CONF_Bits.IRQ_MODE_LEVEL */
#define IFX_GTM_CCM10_HW_CONF_IRQ_MODE_LEVEL_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_HW_CONF_Bits.IRQ_MODE_LEVEL */
#define IFX_GTM_CCM10_HW_CONF_IRQ_MODE_LEVEL_OFF          (16)

/** \\brief  Length for Ifx_GTM_CCM10_HW_CONF_Bits.IRQ_MODE_PULSE */
#define IFX_GTM_CCM10_HW_CONF_IRQ_MODE_PULSE_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CCM10_HW_CONF_Bits.IRQ_MODE_PULSE */
#define IFX_GTM_CCM10_HW_CONF_IRQ_MODE_PULSE_MSK          (0x1)

/** \\brief  Length for Ifx_GTM_CCM10_HW_CONF_Bits.IRQ_MODE_PULSE_NOTIFY */
#define IFX_GTM_CCM10_HW_CONF_IRQ_MODE_PULSE_NOTIFY_LEN   (1)

/** \\brief  Mask for Ifx_GTM_CCM10_HW_CONF_Bits.IRQ_MODE_PULSE_NOTIFY */
#define IFX_GTM_CCM10_HW_CONF_IRQ_MODE_PULSE_NOTIFY_MSK   (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_HW_CONF_Bits.IRQ_MODE_PULSE_NOTIFY */
#define IFX_GTM_CCM10_HW_CONF_IRQ_MODE_PULSE_NOTIFY_OFF   (18)

/** \\brief  Offset for Ifx_GTM_CCM10_HW_CONF_Bits.IRQ_MODE_PULSE */
#define IFX_GTM_CCM10_HW_CONF_IRQ_MODE_PULSE_OFF          (17)

/** \\brief  Length for Ifx_GTM_CCM10_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_CCM10_HW_CONF_IRQ_MODE_SINGLE_PULSE_LEN   (1)

/** \\brief  Mask for Ifx_GTM_CCM10_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_CCM10_HW_CONF_IRQ_MODE_SINGLE_PULSE_MSK   (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_CCM10_HW_CONF_IRQ_MODE_SINGLE_PULSE_OFF   (19)

/** \\brief  Length for Ifx_GTM_CCM10_HW_CONF_Bits.RAM_INIT_RST */
#define IFX_GTM_CCM10_HW_CONF_RAM_INIT_RST_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CCM10_HW_CONF_Bits.RAM_INIT_RST */
#define IFX_GTM_CCM10_HW_CONF_RAM_INIT_RST_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_HW_CONF_Bits.RAM_INIT_RST */
#define IFX_GTM_CCM10_HW_CONF_RAM_INIT_RST_OFF            (12)

/** \\brief  Length for Ifx_GTM_CCM10_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_CCM10_HW_CONF_SYNC_INPUT_REG_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CCM10_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_CCM10_HW_CONF_SYNC_INPUT_REG_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_CCM10_HW_CONF_SYNC_INPUT_REG_OFF          (2)

/** \\brief  Length for Ifx_GTM_CCM10_HW_CONF_Bits.TOM_OUT_RST */
#define IFX_GTM_CCM10_HW_CONF_TOM_OUT_RST_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CCM10_HW_CONF_Bits.TOM_OUT_RST */
#define IFX_GTM_CCM10_HW_CONF_TOM_OUT_RST_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_HW_CONF_Bits.TOM_OUT_RST */
#define IFX_GTM_CCM10_HW_CONF_TOM_OUT_RST_OFF             (8)

/** \\brief  Length for Ifx_GTM_CCM10_HW_CONF_Bits.TOM_TRIG_CHAIN */
#define IFX_GTM_CCM10_HW_CONF_TOM_TRIG_CHAIN_LEN          (3)

/** \\brief  Mask for Ifx_GTM_CCM10_HW_CONF_Bits.TOM_TRIG_CHAIN */
#define IFX_GTM_CCM10_HW_CONF_TOM_TRIG_CHAIN_MSK          (0x7)

/** \\brief  Offset for Ifx_GTM_CCM10_HW_CONF_Bits.TOM_TRIG_CHAIN */
#define IFX_GTM_CCM10_HW_CONF_TOM_TRIG_CHAIN_OFF          (9)

/** \\brief  Length for Ifx_GTM_CCM10_HW_CONF_Bits.TOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM10_HW_CONF_TOM_TRIG_INTCHAIN_LEN       (5)

/** \\brief  Mask for Ifx_GTM_CCM10_HW_CONF_Bits.TOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM10_HW_CONF_TOM_TRIG_INTCHAIN_MSK       (0x1f)

/** \\brief  Offset for Ifx_GTM_CCM10_HW_CONF_Bits.TOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM10_HW_CONF_TOM_TRIG_INTCHAIN_OFF       (24)

/** \\brief  Length for Ifx_GTM_CCM10_PROT_Bits.CLS_PROT */
#define IFX_GTM_CCM10_PROT_CLS_PROT_LEN                   (1)

