Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_CCM10_PROT_Bits.CLS_PROT */
#define IFX_GTM_CCM10_PROT_CLS_PROT_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_CCM10_PROT_Bits.CLS_PROT */
#define IFX_GTM_CCM10_PROT_CLS_PROT_OFF                   (0)

/** \\brief  Length for Ifx_GTM_CCM10_PROT_Bits.Reserved */
#define IFX_GTM_CCM10_PROT_RESERVED_LEN                   (31)

/** \\brief  Mask for Ifx_GTM_CCM10_PROT_Bits.Reserved */
#define IFX_GTM_CCM10_PROT_RESERVED_MSK                   (0x7fffffff)

/** \\brief  Offset for Ifx_GTM_CCM10_PROT_Bits.Reserved */
#define IFX_GTM_CCM10_PROT_RESERVED_OFF                   (1)

/** \\brief  Length for Ifx_GTM_CCM11_CFG_Bits.CLS_CLK_DIV */
#define IFX_GTM_CCM11_CFG_CLS_CLK_DIV_LEN                 (2)

/** \\brief  Mask for Ifx_GTM_CCM11_CFG_Bits.CLS_CLK_DIV */
#define IFX_GTM_CCM11_CFG_CLS_CLK_DIV_MSK                 (0x3)

/** \\brief  Offset for Ifx_GTM_CCM11_CFG_Bits.CLS_CLK_DIV */
#define IFX_GTM_CCM11_CFG_CLS_CLK_DIV_OFF                 (16)

/** \\brief  Length for Ifx_GTM_CCM11_CFG_Bits.EN_ATOM_ADTM */
#define IFX_GTM_CCM11_CFG_EN_ATOM_ADTM_LEN                (1)

/** \\brief  Mask for Ifx_GTM_CCM11_CFG_Bits.EN_ATOM_ADTM */
#define IFX_GTM_CCM11_CFG_EN_ATOM_ADTM_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_CFG_Bits.EN_ATOM_ADTM */
#define IFX_GTM_CCM11_CFG_EN_ATOM_ADTM_OFF                (2)

/** \\brief  Length for Ifx_GTM_CCM11_CFG_Bits.EN_BRC */
#define IFX_GTM_CCM11_CFG_EN_BRC_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_CCM11_CFG_Bits.EN_BRC */
#define IFX_GTM_CCM11_CFG_EN_BRC_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_CFG_Bits.EN_BRC */
#define IFX_GTM_CCM11_CFG_EN_BRC_OFF                      (5)

/** \\brief  Length for Ifx_GTM_CCM11_CFG_Bits.EN_CMP_MON */
#define IFX_GTM_CCM11_CFG_EN_CMP_MON_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM11_CFG_Bits.EN_CMP_MON */
#define IFX_GTM_CCM11_CFG_EN_CMP_MON_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_CFG_Bits.EN_CMP_MON */
#define IFX_GTM_CCM11_CFG_EN_CMP_MON_OFF                  (7)

/** \\brief  Length for Ifx_GTM_CCM11_CFG_Bits.EN_DPLL_MAP */
#define IFX_GTM_CCM11_CFG_EN_DPLL_MAP_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_CCM11_CFG_Bits.EN_DPLL_MAP */
#define IFX_GTM_CCM11_CFG_EN_DPLL_MAP_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_CFG_Bits.EN_DPLL_MAP */
#define IFX_GTM_CCM11_CFG_EN_DPLL_MAP_OFF                 (4)

/** \\brief  Length for Ifx_GTM_CCM11_CFG_Bits.EN_MCS */
#define IFX_GTM_CCM11_CFG_EN_MCS_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_CCM11_CFG_Bits.EN_MCS */
#define IFX_GTM_CCM11_CFG_EN_MCS_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_CFG_Bits.EN_MCS */
#define IFX_GTM_CCM11_CFG_EN_MCS_OFF                      (3)

/** \\brief  Length for Ifx_GTM_CCM11_CFG_Bits.EN_PSM */
#define IFX_GTM_CCM11_CFG_EN_PSM_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_CCM11_CFG_Bits.EN_PSM */
#define IFX_GTM_CCM11_CFG_EN_PSM_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_CFG_Bits.EN_PSM */
#define IFX_GTM_CCM11_CFG_EN_PSM_OFF                      (6)

/** \\brief  Length for Ifx_GTM_CCM11_CFG_Bits.EN_TIM */
#define IFX_GTM_CCM11_CFG_EN_TIM_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_CCM11_CFG_Bits.EN_TIM */
#define IFX_GTM_CCM11_CFG_EN_TIM_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_CFG_Bits.EN_TIM */
#define IFX_GTM_CCM11_CFG_EN_TIM_OFF                      (0)

/** \\brief  Length for Ifx_GTM_CCM11_CFG_Bits.EN_TOM_SPE_TDTM */
#define IFX_GTM_CCM11_CFG_EN_TOM_SPE_TDTM_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CCM11_CFG_Bits.EN_TOM_SPE_TDTM */
#define IFX_GTM_CCM11_CFG_EN_TOM_SPE_TDTM_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_CFG_Bits.EN_TOM_SPE_TDTM */
#define IFX_GTM_CCM11_CFG_EN_TOM_SPE_TDTM_OFF             (1)

/** \\brief  Length for Ifx_GTM_CCM11_CFG_Bits.TBU_DIR1 */
#define IFX_GTM_CCM11_CFG_TBU_DIR1_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_CCM11_CFG_Bits.TBU_DIR1 */
#define IFX_GTM_CCM11_CFG_TBU_DIR1_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_CFG_Bits.TBU_DIR1 */
#define IFX_GTM_CCM11_CFG_TBU_DIR1_OFF                    (30)

/** \\brief  Length for Ifx_GTM_CCM11_CFG_Bits.TBU_DIR2 */
#define IFX_GTM_CCM11_CFG_TBU_DIR2_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_CCM11_CFG_Bits.TBU_DIR2 */
#define IFX_GTM_CCM11_CFG_TBU_DIR2_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_CFG_Bits.TBU_DIR2 */
#define IFX_GTM_CCM11_CFG_TBU_DIR2_OFF                    (31)

/** \\brief  Length for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK0_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK0_SRC_LEN            (2)

/** \\brief  Mask for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK0_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK0_SRC_MSK            (0x3)

/** \\brief  Offset for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK0_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK0_SRC_OFF            (0)

/** \\brief  Length for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK1_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK1_SRC_LEN            (2)

/** \\brief  Mask for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK1_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK1_SRC_MSK            (0x3)

/** \\brief  Offset for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK1_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK1_SRC_OFF            (4)

/** \\brief  Length for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK2_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK2_SRC_LEN            (2)

/** \\brief  Mask for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK2_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK2_SRC_MSK            (0x3)

/** \\brief  Offset for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK2_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK2_SRC_OFF            (8)

/** \\brief  Length for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK3_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK3_SRC_LEN            (2)

/** \\brief  Mask for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK3_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK3_SRC_MSK            (0x3)

/** \\brief  Offset for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK3_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK3_SRC_OFF            (12)

/** \\brief  Length for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK4_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK4_SRC_LEN            (2)

/** \\brief  Mask for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK4_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK4_SRC_MSK            (0x3)

