Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK4_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK4_SRC_OFF            (16)

/** \\brief  Length for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK5_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK5_SRC_LEN            (2)

/** \\brief  Mask for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK5_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK5_SRC_MSK            (0x3)

/** \\brief  Offset for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK5_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK5_SRC_OFF            (20)

/** \\brief  Length for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK6_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK6_SRC_LEN            (2)

/** \\brief  Mask for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK6_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK6_SRC_MSK            (0x3)

/** \\brief  Offset for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK6_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK6_SRC_OFF            (24)

/** \\brief  Length for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK7_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK7_SRC_LEN            (2)

/** \\brief  Mask for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK7_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK7_SRC_MSK            (0x3)

/** \\brief  Offset for Ifx_GTM_CCM11_CMU_CLK_CFG_Bits.CLK7_SRC */
#define IFX_GTM_CCM11_CMU_CLK_CFG_CLK7_SRC_OFF            (28)

/** \\brief  Length for Ifx_GTM_CCM11_CMU_FXCLK_CFG_Bits.FXCLK0_SRC */
#define IFX_GTM_CCM11_CMU_FXCLK_CFG_FXCLK0_SRC_LEN        (4)

/** \\brief  Mask for Ifx_GTM_CCM11_CMU_FXCLK_CFG_Bits.FXCLK0_SRC */
#define IFX_GTM_CCM11_CMU_FXCLK_CFG_FXCLK0_SRC_MSK        (0xf)

/** \\brief  Offset for Ifx_GTM_CCM11_CMU_FXCLK_CFG_Bits.FXCLK0_SRC */
#define IFX_GTM_CCM11_CMU_FXCLK_CFG_FXCLK0_SRC_OFF        (0)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.ARU_CONNECT_CONFIG */
#define IFX_GTM_CCM11_HW_CONF_ARU_CONNECT_CONFIG_LEN      (1)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.ARU_CONNECT_CONFIG */
#define IFX_GTM_CCM11_HW_CONF_ARU_CONNECT_CONFIG_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.ARU_CONNECT_CONFIG */
#define IFX_GTM_CCM11_HW_CONF_ARU_CONNECT_CONFIG_OFF      (14)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.ATOM_OUT_RST */
#define IFX_GTM_CCM11_HW_CONF_ATOM_OUT_RST_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.ATOM_OUT_RST */
#define IFX_GTM_CCM11_HW_CONF_ATOM_OUT_RST_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.ATOM_OUT_RST */
#define IFX_GTM_CCM11_HW_CONF_ATOM_OUT_RST_OFF            (4)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.ATOM_TRIG_CHAIN */
#define IFX_GTM_CCM11_HW_CONF_ATOM_TRIG_CHAIN_LEN         (3)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.ATOM_TRIG_CHAIN */
#define IFX_GTM_CCM11_HW_CONF_ATOM_TRIG_CHAIN_MSK         (0x7)

/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.ATOM_TRIG_CHAIN */
#define IFX_GTM_CCM11_HW_CONF_ATOM_TRIG_CHAIN_OFF         (5)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.ATOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM11_HW_CONF_ATOM_TRIG_INTCHAIN_LEN      (4)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.ATOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM11_HW_CONF_ATOM_TRIG_INTCHAIN_MSK      (0xf)

/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.ATOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM11_HW_CONF_ATOM_TRIG_INTCHAIN_OFF      (20)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_CCM11_HW_CONF_BRIDGE_MODE_RST_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_CCM11_HW_CONF_BRIDGE_MODE_RST_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_CCM11_HW_CONF_BRIDGE_MODE_RST_OFF         (1)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.CFG_CLOCK_RATE */
#define IFX_GTM_CCM11_HW_CONF_CFG_CLOCK_RATE_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.CFG_CLOCK_RATE */
#define IFX_GTM_CCM11_HW_CONF_CFG_CLOCK_RATE_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.CFG_CLOCK_RATE */
#define IFX_GTM_CCM11_HW_CONF_CFG_CLOCK_RATE_OFF          (3)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.ERM */
#define IFX_GTM_CCM11_HW_CONF_ERM_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.ERM */
#define IFX_GTM_CCM11_HW_CONF_ERM_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.ERM */
#define IFX_GTM_CCM11_HW_CONF_ERM_OFF                     (13)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_CCM11_HW_CONF_GRSTEN_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_CCM11_HW_CONF_GRSTEN_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_CCM11_HW_CONF_GRSTEN_OFF                  (0)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.INT_CLK_EN_GEN */
#define IFX_GTM_CCM11_HW_CONF_INT_CLK_EN_GEN_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.INT_CLK_EN_GEN */
#define IFX_GTM_CCM11_HW_CONF_INT_CLK_EN_GEN_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.INT_CLK_EN_GEN */
#define IFX_GTM_CCM11_HW_CONF_INT_CLK_EN_GEN_OFF          (29)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.IRQ_MODE_LEVEL */
#define IFX_GTM_CCM11_HW_CONF_IRQ_MODE_LEVEL_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.IRQ_MODE_LEVEL */
#define IFX_GTM_CCM11_HW_CONF_IRQ_MODE_LEVEL_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.IRQ_MODE_LEVEL */
#define IFX_GTM_CCM11_HW_CONF_IRQ_MODE_LEVEL_OFF          (16)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.IRQ_MODE_PULSE */
#define IFX_GTM_CCM11_HW_CONF_IRQ_MODE_PULSE_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.IRQ_MODE_PULSE */
#define IFX_GTM_CCM11_HW_CONF_IRQ_MODE_PULSE_MSK          (0x1)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.IRQ_MODE_PULSE_NOTIFY */
#define IFX_GTM_CCM11_HW_CONF_IRQ_MODE_PULSE_NOTIFY_LEN   (1)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.IRQ_MODE_PULSE_NOTIFY */
#define IFX_GTM_CCM11_HW_CONF_IRQ_MODE_PULSE_NOTIFY_MSK   (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.IRQ_MODE_PULSE_NOTIFY */
#define IFX_GTM_CCM11_HW_CONF_IRQ_MODE_PULSE_NOTIFY_OFF   (18)

/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.IRQ_MODE_PULSE */
#define IFX_GTM_CCM11_HW_CONF_IRQ_MODE_PULSE_OFF          (17)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_CCM11_HW_CONF_IRQ_MODE_SINGLE_PULSE_LEN   (1)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_CCM11_HW_CONF_IRQ_MODE_SINGLE_PULSE_MSK   (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_CCM11_HW_CONF_IRQ_MODE_SINGLE_PULSE_OFF   (19)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.RAM_INIT_RST */
#define IFX_GTM_CCM11_HW_CONF_RAM_INIT_RST_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.RAM_INIT_RST */
#define IFX_GTM_CCM11_HW_CONF_RAM_INIT_RST_MSK            (0x1)

