Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.RAM_INIT_RST */
#define IFX_GTM_CCM11_HW_CONF_RAM_INIT_RST_OFF            (12)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_CCM11_HW_CONF_SYNC_INPUT_REG_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_CCM11_HW_CONF_SYNC_INPUT_REG_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_CCM11_HW_CONF_SYNC_INPUT_REG_OFF          (2)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.TOM_OUT_RST */
#define IFX_GTM_CCM11_HW_CONF_TOM_OUT_RST_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.TOM_OUT_RST */
#define IFX_GTM_CCM11_HW_CONF_TOM_OUT_RST_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.TOM_OUT_RST */
#define IFX_GTM_CCM11_HW_CONF_TOM_OUT_RST_OFF             (8)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.TOM_TRIG_CHAIN */
#define IFX_GTM_CCM11_HW_CONF_TOM_TRIG_CHAIN_LEN          (3)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.TOM_TRIG_CHAIN */
#define IFX_GTM_CCM11_HW_CONF_TOM_TRIG_CHAIN_MSK          (0x7)

/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.TOM_TRIG_CHAIN */
#define IFX_GTM_CCM11_HW_CONF_TOM_TRIG_CHAIN_OFF          (9)

/** \\brief  Length for Ifx_GTM_CCM11_HW_CONF_Bits.TOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM11_HW_CONF_TOM_TRIG_INTCHAIN_LEN       (5)

/** \\brief  Mask for Ifx_GTM_CCM11_HW_CONF_Bits.TOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM11_HW_CONF_TOM_TRIG_INTCHAIN_MSK       (0x1f)

/** \\brief  Offset for Ifx_GTM_CCM11_HW_CONF_Bits.TOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM11_HW_CONF_TOM_TRIG_INTCHAIN_OFF       (24)

/** \\brief  Length for Ifx_GTM_CCM11_PROT_Bits.CLS_PROT */
#define IFX_GTM_CCM11_PROT_CLS_PROT_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_CCM11_PROT_Bits.CLS_PROT */
#define IFX_GTM_CCM11_PROT_CLS_PROT_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_CCM11_PROT_Bits.CLS_PROT */
#define IFX_GTM_CCM11_PROT_CLS_PROT_OFF                   (0)

/** \\brief  Length for Ifx_GTM_CCM11_PROT_Bits.Reserved */
#define IFX_GTM_CCM11_PROT_RESERVED_LEN                   (31)

/** \\brief  Mask for Ifx_GTM_CCM11_PROT_Bits.Reserved */
#define IFX_GTM_CCM11_PROT_RESERVED_MSK                   (0x7fffffff)

/** \\brief  Offset for Ifx_GTM_CCM11_PROT_Bits.Reserved */
#define IFX_GTM_CCM11_PROT_RESERVED_OFF                   (1)

/** \\brief  Length for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_ADDR */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_ADDR_LEN            (16)

/** \\brief  Mask for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_ADDR */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_ADDR_MSK            (0xffff)

/** \\brief  Offset for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_ADDR */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_ADDR_OFF            (0)

/** \\brief  Length for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_STA */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_STA_LEN             (2)

/** \\brief  Mask for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_STA */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_STA_MSK             (0x3)

/** \\brief  Offset for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_STA */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_STA_OFF             (24)

/** \\brief  Length for Ifx_GTM_CCM_ARP0_CTRL_Bits.ADDR */
#define IFX_GTM_CCM_ARP0_CTRL_ADDR_LEN                    (16)

/** \\brief  Mask for Ifx_GTM_CCM_ARP0_CTRL_Bits.ADDR */
#define IFX_GTM_CCM_ARP0_CTRL_ADDR_MSK                    (0xffff)

/** \\brief  Offset for Ifx_GTM_CCM_ARP0_CTRL_Bits.ADDR */
#define IFX_GTM_CCM_ARP0_CTRL_ADDR_OFF                    (0)

/** \\brief  Length for Ifx_GTM_CCM_ARP0_CTRL_Bits.DIS_PROT */
#define IFX_GTM_CCM_ARP0_CTRL_DIS_PROT_LEN                (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP0_CTRL_Bits.DIS_PROT */
#define IFX_GTM_CCM_ARP0_CTRL_DIS_PROT_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP0_CTRL_Bits.DIS_PROT */
#define IFX_GTM_CCM_ARP0_CTRL_DIS_PROT_OFF                (24)

/** \\brief  Length for Ifx_GTM_CCM_ARP0_CTRL_Bits.SIZE */
#define IFX_GTM_CCM_ARP0_CTRL_SIZE_LEN                    (4)

/** \\brief  Mask for Ifx_GTM_CCM_ARP0_CTRL_Bits.SIZE */
#define IFX_GTM_CCM_ARP0_CTRL_SIZE_MSK                    (0xf)

/** \\brief  Offset for Ifx_GTM_CCM_ARP0_CTRL_Bits.SIZE */
#define IFX_GTM_CCM_ARP0_CTRL_SIZE_OFF                    (16)

/** \\brief  Length for Ifx_GTM_CCM_ARP0_CTRL_Bits.WPROT_AEI */
#define IFX_GTM_CCM_ARP0_CTRL_WPROT_AEI_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP0_CTRL_Bits.WPROT_AEI */
#define IFX_GTM_CCM_ARP0_CTRL_WPROT_AEI_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP0_CTRL_Bits.WPROT_AEI */
#define IFX_GTM_CCM_ARP0_CTRL_WPROT_AEI_OFF               (31)

/** \\brief  Length for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT0 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT0_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT0 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT0_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT0 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT0_OFF                  (0)

/** \\brief  Length for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT1 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT1_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT1 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT1_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT1 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT1_OFF                  (1)

/** \\brief  Length for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT2 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT2_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT2 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT2_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT2 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT2_OFF                  (2)

/** \\brief  Length for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT3 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT3_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT3 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT3_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT3 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT3_OFF                  (3)

/** \\brief  Length for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT4 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT4_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT4 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT4_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT4 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT4_OFF                  (4)

/** \\brief  Length for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT5 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT5_LEN                  (1)

