Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT5 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT5_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT5 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT5_OFF                  (5)

/** \\brief  Length for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT6 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT6_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT6 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT6_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT6 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT6_OFF                  (6)

/** \\brief  Length for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT7 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT7_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT7 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT7_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP0_PROT_Bits.WPROT7 */
#define IFX_GTM_CCM_ARP0_PROT_WPROT7_OFF                  (7)

/** \\brief  Length for Ifx_GTM_CCM_ARP1_CTRL_Bits.ADDR */
#define IFX_GTM_CCM_ARP1_CTRL_ADDR_LEN                    (16)

/** \\brief  Mask for Ifx_GTM_CCM_ARP1_CTRL_Bits.ADDR */
#define IFX_GTM_CCM_ARP1_CTRL_ADDR_MSK                    (0xffff)

/** \\brief  Offset for Ifx_GTM_CCM_ARP1_CTRL_Bits.ADDR */
#define IFX_GTM_CCM_ARP1_CTRL_ADDR_OFF                    (0)

/** \\brief  Length for Ifx_GTM_CCM_ARP1_CTRL_Bits.DIS_PROT */
#define IFX_GTM_CCM_ARP1_CTRL_DIS_PROT_LEN                (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP1_CTRL_Bits.DIS_PROT */
#define IFX_GTM_CCM_ARP1_CTRL_DIS_PROT_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP1_CTRL_Bits.DIS_PROT */
#define IFX_GTM_CCM_ARP1_CTRL_DIS_PROT_OFF                (24)

/** \\brief  Length for Ifx_GTM_CCM_ARP1_CTRL_Bits.SIZE */
#define IFX_GTM_CCM_ARP1_CTRL_SIZE_LEN                    (4)

/** \\brief  Mask for Ifx_GTM_CCM_ARP1_CTRL_Bits.SIZE */
#define IFX_GTM_CCM_ARP1_CTRL_SIZE_MSK                    (0xf)

/** \\brief  Offset for Ifx_GTM_CCM_ARP1_CTRL_Bits.SIZE */
#define IFX_GTM_CCM_ARP1_CTRL_SIZE_OFF                    (16)

/** \\brief  Length for Ifx_GTM_CCM_ARP1_CTRL_Bits.WPROT_AEI */
#define IFX_GTM_CCM_ARP1_CTRL_WPROT_AEI_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP1_CTRL_Bits.WPROT_AEI */
#define IFX_GTM_CCM_ARP1_CTRL_WPROT_AEI_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP1_CTRL_Bits.WPROT_AEI */
#define IFX_GTM_CCM_ARP1_CTRL_WPROT_AEI_OFF               (31)

/** \\brief  Length for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT0 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT0_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT0 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT0_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT0 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT0_OFF                  (0)

/** \\brief  Length for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT1 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT1_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT1 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT1_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT1 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT1_OFF                  (1)

/** \\brief  Length for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT2 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT2_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT2 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT2_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT2 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT2_OFF                  (2)

/** \\brief  Length for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT3 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT3_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT3 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT3_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT3 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT3_OFF                  (3)

/** \\brief  Length for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT4 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT4_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT4 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT4_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT4 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT4_OFF                  (4)

/** \\brief  Length for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT5 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT5_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT5 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT5_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT5 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT5_OFF                  (5)

/** \\brief  Length for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT6 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT6_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT6 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT6_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT6 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT6_OFF                  (6)

/** \\brief  Length for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT7 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT7_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT7 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT7_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP1_PROT_Bits.WPROT7 */
#define IFX_GTM_CCM_ARP1_PROT_WPROT7_OFF                  (7)

/** \\brief  Length for Ifx_GTM_CCM_ARP2_CTRL_Bits.ADDR */
#define IFX_GTM_CCM_ARP2_CTRL_ADDR_LEN                    (16)

/** \\brief  Mask for Ifx_GTM_CCM_ARP2_CTRL_Bits.ADDR */
#define IFX_GTM_CCM_ARP2_CTRL_ADDR_MSK                    (0xffff)

/** \\brief  Offset for Ifx_GTM_CCM_ARP2_CTRL_Bits.ADDR */
#define IFX_GTM_CCM_ARP2_CTRL_ADDR_OFF                    (0)

/** \\brief  Length for Ifx_GTM_CCM_ARP2_CTRL_Bits.DIS_PROT */
#define IFX_GTM_CCM_ARP2_CTRL_DIS_PROT_LEN                (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP2_CTRL_Bits.DIS_PROT */
#define IFX_GTM_CCM_ARP2_CTRL_DIS_PROT_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP2_CTRL_Bits.DIS_PROT */
#define IFX_GTM_CCM_ARP2_CTRL_DIS_PROT_OFF                (24)

/** \\brief  Length for Ifx_GTM_CCM_ARP2_CTRL_Bits.SIZE */
#define IFX_GTM_CCM_ARP2_CTRL_SIZE_LEN                    (4)

