Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_CCM_ARP9_PROT_Bits.WPROT3 */
#define IFX_GTM_CCM_ARP9_PROT_WPROT3_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP9_PROT_Bits.WPROT3 */
#define IFX_GTM_CCM_ARP9_PROT_WPROT3_OFF                  (3)

/** \\brief  Length for Ifx_GTM_CCM_ARP9_PROT_Bits.WPROT4 */
#define IFX_GTM_CCM_ARP9_PROT_WPROT4_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP9_PROT_Bits.WPROT4 */
#define IFX_GTM_CCM_ARP9_PROT_WPROT4_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP9_PROT_Bits.WPROT4 */
#define IFX_GTM_CCM_ARP9_PROT_WPROT4_OFF                  (4)

/** \\brief  Length for Ifx_GTM_CCM_ARP9_PROT_Bits.WPROT5 */
#define IFX_GTM_CCM_ARP9_PROT_WPROT5_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP9_PROT_Bits.WPROT5 */
#define IFX_GTM_CCM_ARP9_PROT_WPROT5_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP9_PROT_Bits.WPROT5 */
#define IFX_GTM_CCM_ARP9_PROT_WPROT5_OFF                  (5)

/** \\brief  Length for Ifx_GTM_CCM_ARP9_PROT_Bits.WPROT6 */
#define IFX_GTM_CCM_ARP9_PROT_WPROT6_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP9_PROT_Bits.WPROT6 */
#define IFX_GTM_CCM_ARP9_PROT_WPROT6_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP9_PROT_Bits.WPROT6 */
#define IFX_GTM_CCM_ARP9_PROT_WPROT6_OFF                  (6)

/** \\brief  Length for Ifx_GTM_CCM_ARP9_PROT_Bits.WPROT7 */
#define IFX_GTM_CCM_ARP9_PROT_WPROT7_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_ARP9_PROT_Bits.WPROT7 */
#define IFX_GTM_CCM_ARP9_PROT_WPROT7_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_ARP9_PROT_Bits.WPROT7 */
#define IFX_GTM_CCM_ARP9_PROT_WPROT7_OFF                  (7)

/** \\brief  Length for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_I_OUT */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_I_OUT_LEN               (8)

/** \\brief  Mask for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_I_OUT */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_I_OUT_MSK               (0xff)

/** \\brief  Length for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_I_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_I_OUT_N_LEN             (8)

/** \\brief  Mask for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_I_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_I_OUT_N_MSK             (0xff)

/** \\brief  Offset for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_I_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_I_OUT_N_OFF             (8)

/** \\brief  Offset for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_I_OUT */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_I_OUT_OFF               (0)

/** \\brief  Length for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_LEN             (8)

/** \\brief  Mask for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_MSK             (0xff)

/** \\brief  Length for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_N_LEN           (8)

/** \\brief  Mask for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_N_MSK           (0xff)

/** \\brief  Offset for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT_N */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_N_OFF           (24)

/** \\brief  Offset for Ifx_GTM_CCM_ATOM_OUT_Bits.ATOM_IP1_OUT */
#define IFX_GTM_CCM_ATOM_OUT_ATOM_IP1_OUT_OFF             (16)

/** \\brief  Length for Ifx_GTM_CCM_CFG_Bits.CLS_CLK_DIV */
#define IFX_GTM_CCM_CFG_CLS_CLK_DIV_LEN                   (2)

/** \\brief  Mask for Ifx_GTM_CCM_CFG_Bits.CLS_CLK_DIV */
#define IFX_GTM_CCM_CFG_CLS_CLK_DIV_MSK                   (0x3)

/** \\brief  Offset for Ifx_GTM_CCM_CFG_Bits.CLS_CLK_DIV */
#define IFX_GTM_CCM_CFG_CLS_CLK_DIV_OFF                   (16)

/** \\brief  Length for Ifx_GTM_CCM_CFG_Bits.EN_ATOM_ADTM */
#define IFX_GTM_CCM_CFG_EN_ATOM_ADTM_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_CCM_CFG_Bits.EN_ATOM_ADTM */
#define IFX_GTM_CCM_CFG_EN_ATOM_ADTM_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_CFG_Bits.EN_ATOM_ADTM */
#define IFX_GTM_CCM_CFG_EN_ATOM_ADTM_OFF                  (2)

/** \\brief  Length for Ifx_GTM_CCM_CFG_Bits.EN_BRC */
#define IFX_GTM_CCM_CFG_EN_BRC_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_CCM_CFG_Bits.EN_BRC */
#define IFX_GTM_CCM_CFG_EN_BRC_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_CFG_Bits.EN_BRC */
#define IFX_GTM_CCM_CFG_EN_BRC_OFF                        (5)

/** \\brief  Length for Ifx_GTM_CCM_CFG_Bits.EN_CMP_MON */
#define IFX_GTM_CCM_CFG_EN_CMP_MON_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_CCM_CFG_Bits.EN_CMP_MON */
#define IFX_GTM_CCM_CFG_EN_CMP_MON_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_CFG_Bits.EN_CMP_MON */
#define IFX_GTM_CCM_CFG_EN_CMP_MON_OFF                    (7)

/** \\brief  Length for Ifx_GTM_CCM_CFG_Bits.EN_DPLL_MAP */
#define IFX_GTM_CCM_CFG_EN_DPLL_MAP_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_CCM_CFG_Bits.EN_DPLL_MAP */
#define IFX_GTM_CCM_CFG_EN_DPLL_MAP_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_CFG_Bits.EN_DPLL_MAP */
#define IFX_GTM_CCM_CFG_EN_DPLL_MAP_OFF                   (4)

/** \\brief  Length for Ifx_GTM_CCM_CFG_Bits.EN_MCS */
#define IFX_GTM_CCM_CFG_EN_MCS_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_CCM_CFG_Bits.EN_MCS */
#define IFX_GTM_CCM_CFG_EN_MCS_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_CFG_Bits.EN_MCS */
#define IFX_GTM_CCM_CFG_EN_MCS_OFF                        (3)

/** \\brief  Length for Ifx_GTM_CCM_CFG_Bits.EN_PSM */
#define IFX_GTM_CCM_CFG_EN_PSM_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_CCM_CFG_Bits.EN_PSM */
#define IFX_GTM_CCM_CFG_EN_PSM_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_CFG_Bits.EN_PSM */
#define IFX_GTM_CCM_CFG_EN_PSM_OFF                        (6)

/** \\brief  Length for Ifx_GTM_CCM_CFG_Bits.EN_TIM */
#define IFX_GTM_CCM_CFG_EN_TIM_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_CCM_CFG_Bits.EN_TIM */
#define IFX_GTM_CCM_CFG_EN_TIM_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_CFG_Bits.EN_TIM */
#define IFX_GTM_CCM_CFG_EN_TIM_OFF                        (0)

/** \\brief  Length for Ifx_GTM_CCM_CFG_Bits.EN_TOM_SPE_TDTM */
#define IFX_GTM_CCM_CFG_EN_TOM_SPE_TDTM_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CCM_CFG_Bits.EN_TOM_SPE_TDTM */
#define IFX_GTM_CCM_CFG_EN_TOM_SPE_TDTM_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_CFG_Bits.EN_TOM_SPE_TDTM */
#define IFX_GTM_CCM_CFG_EN_TOM_SPE_TDTM_OFF               (1)

