Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_CCM_CFG_Bits.TBU_DIR1 */
#define IFX_GTM_CCM_CFG_TBU_DIR1_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_CCM_CFG_Bits.TBU_DIR1 */
#define IFX_GTM_CCM_CFG_TBU_DIR1_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_CFG_Bits.TBU_DIR1 */
#define IFX_GTM_CCM_CFG_TBU_DIR1_OFF                      (30)

/** \\brief  Length for Ifx_GTM_CCM_CFG_Bits.TBU_DIR2 */
#define IFX_GTM_CCM_CFG_TBU_DIR2_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_CCM_CFG_Bits.TBU_DIR2 */
#define IFX_GTM_CCM_CFG_TBU_DIR2_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_CFG_Bits.TBU_DIR2 */
#define IFX_GTM_CCM_CFG_TBU_DIR2_OFF                      (31)

/** \\brief  Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK0_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK0_SRC_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK0_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK0_SRC_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK0_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK0_SRC_OFF              (0)

/** \\brief  Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK1_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK1_SRC_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK1_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK1_SRC_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK1_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK1_SRC_OFF              (4)

/** \\brief  Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK2_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK2_SRC_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK2_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK2_SRC_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK2_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK2_SRC_OFF              (8)

/** \\brief  Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK3_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK3_SRC_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK3_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK3_SRC_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK3_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK3_SRC_OFF              (12)

/** \\brief  Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK4_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK4_SRC_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK4_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK4_SRC_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK4_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK4_SRC_OFF              (16)

/** \\brief  Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK5_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK5_SRC_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK5_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK5_SRC_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK5_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK5_SRC_OFF              (20)

/** \\brief  Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK6_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK6_SRC_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK6_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK6_SRC_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK6_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK6_SRC_OFF              (24)

/** \\brief  Length for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK7_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK7_SRC_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK7_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK7_SRC_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CCM_CMU_CLK_CFG_Bits.CLK7_SRC */
#define IFX_GTM_CCM_CMU_CLK_CFG_CLK7_SRC_OFF              (28)

/** \\brief  Length for Ifx_GTM_CCM_CMU_FXCLK_CFG_Bits.FXCLK0_SRC */
#define IFX_GTM_CCM_CMU_FXCLK_CFG_FXCLK0_SRC_LEN          (4)

/** \\brief  Mask for Ifx_GTM_CCM_CMU_FXCLK_CFG_Bits.FXCLK0_SRC */
#define IFX_GTM_CCM_CMU_FXCLK_CFG_FXCLK0_SRC_MSK          (0xf)

/** \\brief  Offset for Ifx_GTM_CCM_CMU_FXCLK_CFG_Bits.FXCLK0_SRC */
#define IFX_GTM_CCM_CMU_FXCLK_CFG_FXCLK0_SRC_OFF          (0)

/** \\brief  Length for Ifx_GTM_CCM_EXT_CAP_EN_Bits.TIM_I_EXT_CAP_EN */
#define IFX_GTM_CCM_EXT_CAP_EN_TIM_I_EXT_CAP_EN_LEN       (8)

/** \\brief  Mask for Ifx_GTM_CCM_EXT_CAP_EN_Bits.TIM_I_EXT_CAP_EN */
#define IFX_GTM_CCM_EXT_CAP_EN_TIM_I_EXT_CAP_EN_MSK       (0xff)

/** \\brief  Offset for Ifx_GTM_CCM_EXT_CAP_EN_Bits.TIM_I_EXT_CAP_EN */
#define IFX_GTM_CCM_EXT_CAP_EN_TIM_I_EXT_CAP_EN_OFF       (0)

/** \\brief  Length for Ifx_GTM_CCM_EXT_CAP_EN_Bits.TIM_IP1_EXT_CAP_EN */
#define IFX_GTM_CCM_EXT_CAP_EN_TIM_IP1_EXT_CAP_EN_LEN     (8)

/** \\brief  Mask for Ifx_GTM_CCM_EXT_CAP_EN_Bits.TIM_IP1_EXT_CAP_EN */
#define IFX_GTM_CCM_EXT_CAP_EN_TIM_IP1_EXT_CAP_EN_MSK     (0xff)

/** \\brief  Offset for Ifx_GTM_CCM_EXT_CAP_EN_Bits.TIM_IP1_EXT_CAP_EN */
#define IFX_GTM_CCM_EXT_CAP_EN_TIM_IP1_EXT_CAP_EN_OFF     (8)

/** \\brief  Length for Ifx_GTM_CCM_HW_CONF_Bits.ARU_CONNECT_CONFIG */
#define IFX_GTM_CCM_HW_CONF_ARU_CONNECT_CONFIG_LEN        (1)

/** \\brief  Mask for Ifx_GTM_CCM_HW_CONF_Bits.ARU_CONNECT_CONFIG */
#define IFX_GTM_CCM_HW_CONF_ARU_CONNECT_CONFIG_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_HW_CONF_Bits.ARU_CONNECT_CONFIG */
#define IFX_GTM_CCM_HW_CONF_ARU_CONNECT_CONFIG_OFF        (14)

/** \\brief  Length for Ifx_GTM_CCM_HW_CONF_Bits.ATOM_OUT_RST */
#define IFX_GTM_CCM_HW_CONF_ATOM_OUT_RST_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CCM_HW_CONF_Bits.ATOM_OUT_RST */
#define IFX_GTM_CCM_HW_CONF_ATOM_OUT_RST_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_HW_CONF_Bits.ATOM_OUT_RST */
#define IFX_GTM_CCM_HW_CONF_ATOM_OUT_RST_OFF              (4)

/** \\brief  Length for Ifx_GTM_CCM_HW_CONF_Bits.ATOM_TRIG_CHAIN */
#define IFX_GTM_CCM_HW_CONF_ATOM_TRIG_CHAIN_LEN           (3)

/** \\brief  Mask for Ifx_GTM_CCM_HW_CONF_Bits.ATOM_TRIG_CHAIN */
#define IFX_GTM_CCM_HW_CONF_ATOM_TRIG_CHAIN_MSK           (0x7)

/** \\brief  Offset for Ifx_GTM_CCM_HW_CONF_Bits.ATOM_TRIG_CHAIN */
#define IFX_GTM_CCM_HW_CONF_ATOM_TRIG_CHAIN_OFF           (5)

/** \\brief  Length for Ifx_GTM_CCM_HW_CONF_Bits.ATOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM_HW_CONF_ATOM_TRIG_INTCHAIN_LEN        (4)

/** \\brief  Mask for Ifx_GTM_CCM_HW_CONF_Bits.ATOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM_HW_CONF_ATOM_TRIG_INTCHAIN_MSK        (0xf)

