Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH3 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH3_LEN      (1)

/** \\brief  Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH3 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH3_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH3 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH3_OFF      (19)

/** \\brief  Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH4 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH4_LEN      (1)

/** \\brief  Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH4 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH4_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH4 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH4_OFF      (20)

/** \\brief  Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH5 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH5_LEN      (1)

/** \\brief  Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH5 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH5_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH5 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH5_OFF      (21)

/** \\brief  Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH6 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH6_LEN      (1)

/** \\brief  Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH6 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH6_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH6 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH6_OFF      (22)

/** \\brief  Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH7 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH7_LEN      (1)

/** \\brief  Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH7 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH7_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH7 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH7_OFF      (23)

/** \\brief  Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH0 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH0_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH0 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH0_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH0 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH0_OFF            (0)

/** \\brief  Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH1 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH1_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH1 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH1_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH1 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH1_OFF            (1)

/** \\brief  Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH2 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH2_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH2 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH2_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH2 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH2_OFF            (2)

/** \\brief  Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH3 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH3_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH3 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH3_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH3 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH3_OFF            (3)

/** \\brief  Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH4 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH4_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH4 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH4_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH4 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH4_OFF            (4)

/** \\brief  Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH5 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH5_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH5 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH5_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH5 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH5_OFF            (5)

/** \\brief  Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH6 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH6_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH6 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH6_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH6 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH6_OFF            (6)

/** \\brief  Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH7 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH7_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH7 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH7_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH7 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH7_OFF            (7)

/** \\brief  Length for Ifx_GTM_CCM_TOM_OUT_Bits.TOM_OUT */
#define IFX_GTM_CCM_TOM_OUT_TOM_OUT_LEN                   (16)

/** \\brief  Mask for Ifx_GTM_CCM_TOM_OUT_Bits.TOM_OUT */
#define IFX_GTM_CCM_TOM_OUT_TOM_OUT_MSK                   (0xffff)

/** \\brief  Length for Ifx_GTM_CCM_TOM_OUT_Bits.TOM_OUT_N */
#define IFX_GTM_CCM_TOM_OUT_TOM_OUT_N_LEN                 (16)

/** \\brief  Mask for Ifx_GTM_CCM_TOM_OUT_Bits.TOM_OUT_N */
#define IFX_GTM_CCM_TOM_OUT_TOM_OUT_N_MSK                 (0xffff)

/** \\brief  Offset for Ifx_GTM_CCM_TOM_OUT_Bits.TOM_OUT_N */
#define IFX_GTM_CCM_TOM_OUT_TOM_OUT_N_OFF                 (16)

/** \\brief  Offset for Ifx_GTM_CCM_TOM_OUT_Bits.TOM_OUT */
#define IFX_GTM_CCM_TOM_OUT_TOM_OUT_OFF                   (0)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM4_CH0_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM5_DTM4_CH0_DTV_RELFALL_LEN            (10)

