Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.CIS3 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_CIS3_OFF              (25)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL0_0 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL0_0_LEN           (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL0_0 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL0_0_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL0_0 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL0_0_OFF           (2)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL0_1 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL0_1_LEN           (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL0_1 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL0_1_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL0_1 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL0_1_OFF           (10)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL0_2 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL0_2_LEN           (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL0_2 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL0_2_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL0_2 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL0_2_OFF           (18)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL0_3 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL0_3_LEN           (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL0_3 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL0_3_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL0_3 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL0_3_OFF           (26)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL1_0 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL1_0_LEN           (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL1_0 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL1_0_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL1_0 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL1_0_OFF           (3)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL1_1 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL1_1_LEN           (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL1_1 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL1_1_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL1_1 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL1_1_OFF           (11)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL1_2 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL1_2_LEN           (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL1_2 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL1_2_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL1_2 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL1_2_OFF           (19)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL1_3 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL1_3_LEN           (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL1_3 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL1_3_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM4_CH_CTRL3_Bits.TSEL1_3 */
#define IFX_GTM_CDTM5_DTM4_CH_CTRL3_TSEL1_3_OFF           (27)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL0_0_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL0_0_SR_SR_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL0_0_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL0_0_SR_SR_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL0_0_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL0_0_SR_SR_OFF          (0)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL0_1_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL0_1_SR_SR_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL0_1_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL0_1_SR_SR_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL0_1_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL0_1_SR_SR_OFF          (2)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL0_2_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL0_2_SR_SR_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL0_2_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL0_2_SR_SR_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL0_2_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL0_2_SR_SR_OFF          (4)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL0_3_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL0_3_SR_SR_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL0_3_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL0_3_SR_SR_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL0_3_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL0_3_SR_SR_OFF          (6)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL1_0_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL1_0_SR_SR_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL1_0_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL1_0_SR_SR_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL1_0_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL1_0_SR_SR_OFF          (1)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL1_1_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL1_1_SR_SR_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL1_1_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL1_1_SR_SR_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL1_1_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL1_1_SR_SR_OFF          (3)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL1_2_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL1_2_SR_SR_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL1_2_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL1_2_SR_SR_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM4_CH_SR_Bits.SL1_2_SR_SR */
#define IFX_GTM_CDTM5_DTM4_CH_SR_SL1_2_SR_SR_OFF          (5)

