Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_CDTM5_DTM5_CTRL_Bits.DTM_SEL */
#define IFX_GTM_CDTM5_DTM5_CTRL_DTM_SEL_LEN               (2)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM5_CTRL_Bits.DTM_SEL */
#define IFX_GTM_CDTM5_DTM5_CTRL_DTM_SEL_MSK               (0x3)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM5_CTRL_Bits.DTM_SEL */
#define IFX_GTM_CDTM5_DTM5_CTRL_DTM_SEL_OFF               (2)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM5_CTRL_Bits.SHUT_OFF_RST */
#define IFX_GTM_CDTM5_DTM5_CTRL_SHUT_OFF_RST_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM5_CTRL_Bits.SHUT_OFF_RST */
#define IFX_GTM_CDTM5_DTM5_CTRL_SHUT_OFF_RST_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM5_CTRL_Bits.SHUT_OFF_RST */
#define IFX_GTM_CDTM5_DTM5_CTRL_SHUT_OFF_RST_OFF          (16)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM5_CTRL_Bits.SR_UPD_EN */
#define IFX_GTM_CDTM5_DTM5_CTRL_SR_UPD_EN_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM5_CTRL_Bits.SR_UPD_EN */
#define IFX_GTM_CDTM5_DTM5_CTRL_SR_UPD_EN_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM5_CTRL_Bits.SR_UPD_EN */
#define IFX_GTM_CDTM5_DTM5_CTRL_SR_UPD_EN_OFF             (8)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM5_CTRL_Bits.UPD_MODE */
#define IFX_GTM_CDTM5_DTM5_CTRL_UPD_MODE_LEN              (3)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM5_CTRL_Bits.UPD_MODE */
#define IFX_GTM_CDTM5_DTM5_CTRL_UPD_MODE_MSK              (0x7)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM5_CTRL_Bits.UPD_MODE */
#define IFX_GTM_CDTM5_DTM5_CTRL_UPD_MODE_OFF              (4)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits.IN_POL */
#define IFX_GTM_CDTM5_DTM5_PS_CTRL_IN_POL_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits.IN_POL */
#define IFX_GTM_CDTM5_DTM5_PS_CTRL_IN_POL_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits.IN_POL */
#define IFX_GTM_CDTM5_DTM5_PS_CTRL_IN_POL_OFF             (17)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits.PSU_IN_SEL */
#define IFX_GTM_CDTM5_DTM5_PS_CTRL_PSU_IN_SEL_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits.PSU_IN_SEL */
#define IFX_GTM_CDTM5_DTM5_PS_CTRL_PSU_IN_SEL_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits.PSU_IN_SEL */
#define IFX_GTM_CDTM5_DTM5_PS_CTRL_PSU_IN_SEL_OFF         (16)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits.RELBLK */
#define IFX_GTM_CDTM5_DTM5_PS_CTRL_RELBLK_LEN             (10)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits.RELBLK */
#define IFX_GTM_CDTM5_DTM5_PS_CTRL_RELBLK_MSK             (0x3ff)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits.RELBLK */
#define IFX_GTM_CDTM5_DTM5_PS_CTRL_RELBLK_OFF             (0)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits.SHIFT_SEL */
#define IFX_GTM_CDTM5_DTM5_PS_CTRL_SHIFT_SEL_LEN          (2)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits.SHIFT_SEL */
#define IFX_GTM_CDTM5_DTM5_PS_CTRL_SHIFT_SEL_MSK          (0x3)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits.SHIFT_SEL */
#define IFX_GTM_CDTM5_DTM5_PS_CTRL_SHIFT_SEL_OFF          (20)

/** \\brief  Length for Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits.TIM_SEL */
#define IFX_GTM_CDTM5_DTM5_PS_CTRL_TIM_SEL_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits.TIM_SEL */
#define IFX_GTM_CDTM5_DTM5_PS_CTRL_TIM_SEL_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM5_DTM5_PS_CTRL_Bits.TIM_SEL */
#define IFX_GTM_CDTM5_DTM5_PS_CTRL_TIM_SEL_OFF            (18)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH0_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM6_DTM4_CH0_DTV_RELFALL_LEN            (10)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH0_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM6_DTM4_CH0_DTV_RELFALL_MSK            (0x3ff)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH0_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM6_DTM4_CH0_DTV_RELFALL_OFF            (16)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH0_DTV_Bits.RELRISE */
#define IFX_GTM_CDTM6_DTM4_CH0_DTV_RELRISE_LEN            (10)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH0_DTV_Bits.RELRISE */
#define IFX_GTM_CDTM6_DTM4_CH0_DTV_RELRISE_MSK            (0x3ff)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH0_DTV_Bits.RELRISE */
#define IFX_GTM_CDTM6_DTM4_CH0_DTV_RELRISE_OFF            (0)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH1_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM6_DTM4_CH1_DTV_RELFALL_LEN            (10)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH1_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM6_DTM4_CH1_DTV_RELFALL_MSK            (0x3ff)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH1_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM6_DTM4_CH1_DTV_RELFALL_OFF            (16)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH1_DTV_Bits.RELRISE */
#define IFX_GTM_CDTM6_DTM4_CH1_DTV_RELRISE_LEN            (10)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH1_DTV_Bits.RELRISE */
#define IFX_GTM_CDTM6_DTM4_CH1_DTV_RELRISE_MSK            (0x3ff)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH1_DTV_Bits.RELRISE */
#define IFX_GTM_CDTM6_DTM4_CH1_DTV_RELRISE_OFF            (0)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH2_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM6_DTM4_CH2_DTV_RELFALL_LEN            (10)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH2_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM6_DTM4_CH2_DTV_RELFALL_MSK            (0x3ff)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH2_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM6_DTM4_CH2_DTV_RELFALL_OFF            (16)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH2_DTV_Bits.RELRISE */
#define IFX_GTM_CDTM6_DTM4_CH2_DTV_RELRISE_LEN            (10)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH2_DTV_Bits.RELRISE */
#define IFX_GTM_CDTM6_DTM4_CH2_DTV_RELRISE_MSK            (0x3ff)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH2_DTV_Bits.RELRISE */
#define IFX_GTM_CDTM6_DTM4_CH2_DTV_RELRISE_OFF            (0)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH3_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM6_DTM4_CH3_DTV_RELFALL_LEN            (10)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH3_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM6_DTM4_CH3_DTV_RELFALL_MSK            (0x3ff)

