Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH_CTRL2_SR_Bits.SL1_1_SR */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL2_SR_SL1_1_SR_LEN       (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH_CTRL2_SR_Bits.SL1_1_SR */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL2_SR_SL1_1_SR_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH_CTRL2_SR_Bits.SL1_1_SR */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL2_SR_SL1_1_SR_OFF       (14)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH_CTRL2_SR_Bits.SL1_2_SR */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL2_SR_SL1_2_SR_LEN       (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH_CTRL2_SR_Bits.SL1_2_SR */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL2_SR_SL1_2_SR_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH_CTRL2_SR_Bits.SL1_2_SR */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL2_SR_SL1_2_SR_OFF       (22)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH_CTRL2_SR_Bits.SL1_3_SR */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL2_SR_SL1_3_SR_LEN       (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH_CTRL2_SR_Bits.SL1_3_SR */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL2_SR_SL1_3_SR_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH_CTRL2_SR_Bits.SL1_3_SR */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL2_SR_SL1_3_SR_OFF       (30)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CII0 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CII0_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CII0 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CII0_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CII0 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CII0_OFF              (0)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CII1 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CII1_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CII1 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CII1_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CII1 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CII1_OFF              (8)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CII2 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CII2_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CII2 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CII2_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CII2 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CII2_OFF              (16)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CII3 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CII3_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CII3 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CII3_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CII3 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CII3_OFF              (24)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CIS0 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CIS0_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CIS0 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CIS0_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CIS0 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CIS0_OFF              (1)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CIS1 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CIS1_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CIS1 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CIS1_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CIS1 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CIS1_OFF              (9)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CIS2 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CIS2_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CIS2 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CIS2_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CIS2 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CIS2_OFF              (17)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CIS3 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CIS3_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CIS3 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CIS3_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.CIS3 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_CIS3_OFF              (25)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.TSEL0_0 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_TSEL0_0_LEN           (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.TSEL0_0 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_TSEL0_0_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.TSEL0_0 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_TSEL0_0_OFF           (2)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.TSEL0_1 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_TSEL0_1_LEN           (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.TSEL0_1 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_TSEL0_1_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.TSEL0_1 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_TSEL0_1_OFF           (10)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.TSEL0_2 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_TSEL0_2_LEN           (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.TSEL0_2 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_TSEL0_2_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.TSEL0_2 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_TSEL0_2_OFF           (18)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.TSEL0_3 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_TSEL0_3_LEN           (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.TSEL0_3 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_TSEL0_3_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.TSEL0_3 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_TSEL0_3_OFF           (26)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.TSEL1_0 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_TSEL1_0_LEN           (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM4_CH_CTRL3_Bits.TSEL1_0 */
#define IFX_GTM_CDTM6_DTM4_CH_CTRL3_TSEL1_0_MSK           (0x1)

