Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_CDTM6_DTM5_CTRL_Bits.UPD_MODE */
#define IFX_GTM_CDTM6_DTM5_CTRL_UPD_MODE_MSK              (0x7)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM5_CTRL_Bits.UPD_MODE */
#define IFX_GTM_CDTM6_DTM5_CTRL_UPD_MODE_OFF              (4)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM5_PS_CTRL_Bits.IN_POL */
#define IFX_GTM_CDTM6_DTM5_PS_CTRL_IN_POL_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM5_PS_CTRL_Bits.IN_POL */
#define IFX_GTM_CDTM6_DTM5_PS_CTRL_IN_POL_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM5_PS_CTRL_Bits.IN_POL */
#define IFX_GTM_CDTM6_DTM5_PS_CTRL_IN_POL_OFF             (17)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM5_PS_CTRL_Bits.PSU_IN_SEL */
#define IFX_GTM_CDTM6_DTM5_PS_CTRL_PSU_IN_SEL_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM5_PS_CTRL_Bits.PSU_IN_SEL */
#define IFX_GTM_CDTM6_DTM5_PS_CTRL_PSU_IN_SEL_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM5_PS_CTRL_Bits.PSU_IN_SEL */
#define IFX_GTM_CDTM6_DTM5_PS_CTRL_PSU_IN_SEL_OFF         (16)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM5_PS_CTRL_Bits.RELBLK */
#define IFX_GTM_CDTM6_DTM5_PS_CTRL_RELBLK_LEN             (10)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM5_PS_CTRL_Bits.RELBLK */
#define IFX_GTM_CDTM6_DTM5_PS_CTRL_RELBLK_MSK             (0x3ff)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM5_PS_CTRL_Bits.RELBLK */
#define IFX_GTM_CDTM6_DTM5_PS_CTRL_RELBLK_OFF             (0)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM5_PS_CTRL_Bits.SHIFT_SEL */
#define IFX_GTM_CDTM6_DTM5_PS_CTRL_SHIFT_SEL_LEN          (2)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM5_PS_CTRL_Bits.SHIFT_SEL */
#define IFX_GTM_CDTM6_DTM5_PS_CTRL_SHIFT_SEL_MSK          (0x3)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM5_PS_CTRL_Bits.SHIFT_SEL */
#define IFX_GTM_CDTM6_DTM5_PS_CTRL_SHIFT_SEL_OFF          (20)

/** \\brief  Length for Ifx_GTM_CDTM6_DTM5_PS_CTRL_Bits.TIM_SEL */
#define IFX_GTM_CDTM6_DTM5_PS_CTRL_TIM_SEL_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CDTM6_DTM5_PS_CTRL_Bits.TIM_SEL */
#define IFX_GTM_CDTM6_DTM5_PS_CTRL_TIM_SEL_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM6_DTM5_PS_CTRL_Bits.TIM_SEL */
#define IFX_GTM_CDTM6_DTM5_PS_CTRL_TIM_SEL_OFF            (18)

/** \\brief  Length for Ifx_GTM_CDTM_DTM2_CTRL_Bits.CLK_SEL */
#define IFX_GTM_CDTM_DTM2_CTRL_CLK_SEL_LEN                (2)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM2_CTRL_Bits.CLK_SEL */
#define IFX_GTM_CDTM_DTM2_CTRL_CLK_SEL_MSK                (0x3)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM2_CTRL_Bits.CLK_SEL */
#define IFX_GTM_CDTM_DTM2_CTRL_CLK_SEL_OFF                (0)

/** \\brief  Length for Ifx_GTM_CDTM_DTM2_CTRL_Bits.DTM_SEL */
#define IFX_GTM_CDTM_DTM2_CTRL_DTM_SEL_LEN                (2)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM2_CTRL_Bits.DTM_SEL */
#define IFX_GTM_CDTM_DTM2_CTRL_DTM_SEL_MSK                (0x3)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM2_CTRL_Bits.DTM_SEL */
#define IFX_GTM_CDTM_DTM2_CTRL_DTM_SEL_OFF                (2)

/** \\brief  Length for Ifx_GTM_CDTM_DTM2_CTRL_Bits.SHUT_OFF_RST */
#define IFX_GTM_CDTM_DTM2_CTRL_SHUT_OFF_RST_LEN           (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM2_CTRL_Bits.SHUT_OFF_RST */
#define IFX_GTM_CDTM_DTM2_CTRL_SHUT_OFF_RST_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM2_CTRL_Bits.SHUT_OFF_RST */
#define IFX_GTM_CDTM_DTM2_CTRL_SHUT_OFF_RST_OFF           (16)

/** \\brief  Length for Ifx_GTM_CDTM_DTM2_CTRL_Bits.SR_UPD_EN */
#define IFX_GTM_CDTM_DTM2_CTRL_SR_UPD_EN_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM2_CTRL_Bits.SR_UPD_EN */
#define IFX_GTM_CDTM_DTM2_CTRL_SR_UPD_EN_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM2_CTRL_Bits.SR_UPD_EN */
#define IFX_GTM_CDTM_DTM2_CTRL_SR_UPD_EN_OFF              (8)

/** \\brief  Length for Ifx_GTM_CDTM_DTM2_CTRL_Bits.UPD_MODE */
#define IFX_GTM_CDTM_DTM2_CTRL_UPD_MODE_LEN               (3)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM2_CTRL_Bits.UPD_MODE */
#define IFX_GTM_CDTM_DTM2_CTRL_UPD_MODE_MSK               (0x7)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM2_CTRL_Bits.UPD_MODE */
#define IFX_GTM_CDTM_DTM2_CTRL_UPD_MODE_OFF               (4)

/** \\brief  Length for Ifx_GTM_CDTM_DTM3_CTRL_Bits.CLK_SEL */
#define IFX_GTM_CDTM_DTM3_CTRL_CLK_SEL_LEN                (2)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM3_CTRL_Bits.CLK_SEL */
#define IFX_GTM_CDTM_DTM3_CTRL_CLK_SEL_MSK                (0x3)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM3_CTRL_Bits.CLK_SEL */
#define IFX_GTM_CDTM_DTM3_CTRL_CLK_SEL_OFF                (0)

/** \\brief  Length for Ifx_GTM_CDTM_DTM3_CTRL_Bits.DTM_SEL */
#define IFX_GTM_CDTM_DTM3_CTRL_DTM_SEL_LEN                (2)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM3_CTRL_Bits.DTM_SEL */
#define IFX_GTM_CDTM_DTM3_CTRL_DTM_SEL_MSK                (0x3)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM3_CTRL_Bits.DTM_SEL */
#define IFX_GTM_CDTM_DTM3_CTRL_DTM_SEL_OFF                (2)

/** \\brief  Length for Ifx_GTM_CDTM_DTM3_CTRL_Bits.SHUT_OFF_RST */
#define IFX_GTM_CDTM_DTM3_CTRL_SHUT_OFF_RST_LEN           (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM3_CTRL_Bits.SHUT_OFF_RST */
#define IFX_GTM_CDTM_DTM3_CTRL_SHUT_OFF_RST_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM3_CTRL_Bits.SHUT_OFF_RST */
#define IFX_GTM_CDTM_DTM3_CTRL_SHUT_OFF_RST_OFF           (16)

/** \\brief  Length for Ifx_GTM_CDTM_DTM3_CTRL_Bits.SR_UPD_EN */
#define IFX_GTM_CDTM_DTM3_CTRL_SR_UPD_EN_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM3_CTRL_Bits.SR_UPD_EN */
#define IFX_GTM_CDTM_DTM3_CTRL_SR_UPD_EN_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM3_CTRL_Bits.SR_UPD_EN */
#define IFX_GTM_CDTM_DTM3_CTRL_SR_UPD_EN_OFF              (8)

/** \\brief  Length for Ifx_GTM_CDTM_DTM3_CTRL_Bits.UPD_MODE */
#define IFX_GTM_CDTM_DTM3_CTRL_UPD_MODE_LEN               (3)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM3_CTRL_Bits.UPD_MODE */
#define IFX_GTM_CDTM_DTM3_CTRL_UPD_MODE_MSK               (0x7)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM3_CTRL_Bits.UPD_MODE */
#define IFX_GTM_CDTM_DTM3_CTRL_UPD_MODE_OFF               (4)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_0_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_0_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_0_OFF             (1)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_1_LEN             (1)

