Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_1_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_1_OFF             (9)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_2_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_2_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_2_OFF             (17)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_3_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_3_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_3_OFF             (25)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_0_LEN               (2)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_0_MSK               (0x3)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_0_OFF               (4)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_1_LEN               (2)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_1_MSK               (0x3)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_1_OFF               (12)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_2_LEN               (2)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_2_MSK               (0x3)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_2_OFF               (20)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_3_LEN               (2)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_3_MSK               (0x3)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_3_OFF               (28)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_0_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_0_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_0_OFF             (0)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_1_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_1_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_1_OFF             (8)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_2_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_2_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_2_OFF             (16)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_3_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_3_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_3_OFF             (24)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SH_EN_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SH_EN_1_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SH_EN_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SH_EN_1_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SH_EN_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SH_EN_1_OFF             (10)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SH_EN_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SH_EN_2_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SH_EN_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SH_EN_2_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SH_EN_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SH_EN_2_OFF             (18)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SH_EN_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SH_EN_3_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SH_EN_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SH_EN_3_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SH_EN_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SH_EN_3_OFF             (26)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_0_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_0_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_0_OFF              (3)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_1_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_1_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_1_OFF              (11)

