Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_2_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_2_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_2_OFF              (19)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_3_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_3_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_3_OFF              (27)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.XDT_EN_0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_XDT_EN_0_1_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.XDT_EN_0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_XDT_EN_0_1_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.XDT_EN_0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_XDT_EN_0_1_OFF          (6)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.XDT_EN_2_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_XDT_EN_2_3_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.XDT_EN_2_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_XDT_EN_2_3_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.XDT_EN_2_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_XDT_EN_2_3_OFF          (22)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_0_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_0_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_0_OFF               (3)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_1_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_1_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_1_OFF               (11)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_2_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_2_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_2_OFF               (19)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_3_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_3_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_3_OFF               (27)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_0_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_0_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_0_OFF               (7)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_1_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_1_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_1_OFF               (15)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_2_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_2_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_2_OFF               (23)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_3_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_3_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_3_OFF               (31)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_0_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_0_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_0_OFF               (1)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_1_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_1_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_1_OFF               (9)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_2_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_2_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_2_OFF               (17)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_3_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_3_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_3_OFF               (25)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_0_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_0_MSK               (0x1)

