Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_0_OFF               (5)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_1_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_1_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_1_OFF               (13)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_2_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_2_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_2_OFF               (21)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_3_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_3_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_3_OFF               (29)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_0_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_0_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_0_OFF              (0)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_1_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_1_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_1_OFF              (8)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_2_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_2_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_2_OFF              (16)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_3_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_3_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_3_OFF              (24)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_0_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_0_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_0_OFF              (4)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_1_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_1_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_1_OFF              (12)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_2_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_2_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_2_OFF              (20)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_3_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_3_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_3_OFF              (28)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_0_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_0_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_0_OFF               (2)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_1_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_1_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_1_OFF               (10)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_2_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_2_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_2_OFF               (18)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_3_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_3_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_3_OFF               (26)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_0_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_0_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_0_OFF               (6)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_1_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_1_MSK               (0x1)

