Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_1_OFF               (14)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_2_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_2_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_2_OFF               (22)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_3_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_3_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_3_OFF               (30)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_0_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_0_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_0_SR_OFF         (3)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_1_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_1_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_1_SR_OFF         (11)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_2_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_2_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_2_SR_OFF         (19)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_3_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_3_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_3_SR_OFF         (27)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_0_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_0_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_0_SR_OFF         (7)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_1_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_1_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_1_SR_OFF         (15)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_2_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_2_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_2_SR_OFF         (23)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_3_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_3_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_3_SR_OFF         (31)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_0_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_0_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_0_SR_OFF         (1)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_1_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_1_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_1_SR_OFF         (9)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_2_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_2_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_2_SR_OFF         (17)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_3_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_3_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_3_SR_OFF         (25)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_0_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_0_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_0_SR_OFF         (5)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_1_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_1_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_1_SR_OFF         (13)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_2_SR_LEN         (1)

