Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_2_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_2_SR_OFF         (21)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_3_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_3_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_3_SR_OFF         (29)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_0_SR_LEN        (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_0_SR_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_0_SR_OFF        (0)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_1_SR_LEN        (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_1_SR_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_1_SR_OFF        (8)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_2_SR_LEN        (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_2_SR_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_2_SR_OFF        (16)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_3_SR_LEN        (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_3_SR_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_3_SR_OFF        (24)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_0_SR_LEN        (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_0_SR_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_0_SR_OFF        (4)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_1_SR_LEN        (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_1_SR_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_1_SR_OFF        (12)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_2_SR_LEN        (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_2_SR_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_2_SR_OFF        (20)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_3_SR_LEN        (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_3_SR_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_3_SR_OFF        (28)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_0_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_0_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_0_SR_OFF         (2)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_1_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_1_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_1_SR_OFF         (10)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_2_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_2_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_2_SR_OFF         (18)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_3_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_3_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_3_SR_OFF         (26)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_0_SR_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_0_SR_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_0_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_0_SR_OFF         (6)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_1_SR_LEN         (1)

