Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_2_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_2_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_2_OFF             (19)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_3_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_3_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_3_OFF             (27)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM_DTM_CH_DTV_RELFALL_LEN               (10)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM_DTM_CH_DTV_RELFALL_MSK               (0x3ff)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_DTV_Bits.RELFALL */
#define IFX_GTM_CDTM_DTM_CH_DTV_RELFALL_OFF               (16)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_DTV_Bits.RELRISE */
#define IFX_GTM_CDTM_DTM_CH_DTV_RELRISE_LEN               (10)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_DTV_Bits.RELRISE */
#define IFX_GTM_CDTM_DTM_CH_DTV_RELRISE_MSK               (0x3ff)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_DTV_Bits.RELRISE */
#define IFX_GTM_CDTM_DTM_CH_DTV_RELRISE_OFF               (0)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_0_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_0_SR_SR_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_0_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_0_SR_SR_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_0_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_0_SR_SR_OFF            (0)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_1_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_1_SR_SR_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_1_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_1_SR_SR_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_1_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_1_SR_SR_OFF            (2)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_2_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_2_SR_SR_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_2_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_2_SR_SR_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_2_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_2_SR_SR_OFF            (4)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_3_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_3_SR_SR_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_3_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_3_SR_SR_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL0_3_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL0_3_SR_SR_OFF            (6)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_0_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_0_SR_SR_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_0_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_0_SR_SR_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_0_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_0_SR_SR_OFF            (1)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_1_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_1_SR_SR_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_1_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_1_SR_SR_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_1_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_1_SR_SR_OFF            (3)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_2_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_2_SR_SR_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_2_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_2_SR_SR_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_2_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_2_SR_SR_OFF            (5)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_3_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_3_SR_SR_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_3_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_3_SR_SR_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CH_SR_Bits.SL1_3_SR_SR */
#define IFX_GTM_CDTM_DTM_CH_SR_SL1_3_SR_SR_OFF            (7)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CTRL_Bits.CLK_SEL */
#define IFX_GTM_CDTM_DTM_CTRL_CLK_SEL_LEN                 (2)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CTRL_Bits.CLK_SEL */
#define IFX_GTM_CDTM_DTM_CTRL_CLK_SEL_MSK                 (0x3)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CTRL_Bits.CLK_SEL */
#define IFX_GTM_CDTM_DTM_CTRL_CLK_SEL_OFF                 (0)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CTRL_Bits.DTM_SEL */
#define IFX_GTM_CDTM_DTM_CTRL_DTM_SEL_LEN                 (2)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CTRL_Bits.DTM_SEL */
#define IFX_GTM_CDTM_DTM_CTRL_DTM_SEL_MSK                 (0x3)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CTRL_Bits.DTM_SEL */
#define IFX_GTM_CDTM_DTM_CTRL_DTM_SEL_OFF                 (2)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CTRL_Bits.SHUT_OFF_RST */
#define IFX_GTM_CDTM_DTM_CTRL_SHUT_OFF_RST_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CTRL_Bits.SHUT_OFF_RST */
#define IFX_GTM_CDTM_DTM_CTRL_SHUT_OFF_RST_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CTRL_Bits.SHUT_OFF_RST */
#define IFX_GTM_CDTM_DTM_CTRL_SHUT_OFF_RST_OFF            (16)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_CTRL_Bits.SR_UPD_EN */
#define IFX_GTM_CDTM_DTM_CTRL_SR_UPD_EN_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CTRL_Bits.SR_UPD_EN */
#define IFX_GTM_CDTM_DTM_CTRL_SR_UPD_EN_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CTRL_Bits.SR_UPD_EN */
#define IFX_GTM_CDTM_DTM_CTRL_SR_UPD_EN_OFF               (8)

