Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_CDTM_DTM_CTRL_Bits.UPD_MODE */
#define IFX_GTM_CDTM_DTM_CTRL_UPD_MODE_LEN                (3)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_CTRL_Bits.UPD_MODE */
#define IFX_GTM_CDTM_DTM_CTRL_UPD_MODE_MSK                (0x7)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_CTRL_Bits.UPD_MODE */
#define IFX_GTM_CDTM_DTM_CTRL_UPD_MODE_OFF                (4)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.IN_POL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_IN_POL_LEN               (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.IN_POL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_IN_POL_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.IN_POL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_IN_POL_OFF               (17)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.PSU_IN_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_PSU_IN_SEL_LEN           (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.PSU_IN_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_PSU_IN_SEL_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.PSU_IN_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_PSU_IN_SEL_OFF           (16)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.RELBLK */
#define IFX_GTM_CDTM_DTM_PS_CTRL_RELBLK_LEN               (10)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.RELBLK */
#define IFX_GTM_CDTM_DTM_PS_CTRL_RELBLK_MSK               (0x3ff)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.RELBLK */
#define IFX_GTM_CDTM_DTM_PS_CTRL_RELBLK_OFF               (0)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.SHIFT_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_SHIFT_SEL_LEN            (2)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.SHIFT_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_SHIFT_SEL_MSK            (0x3)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.SHIFT_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_SHIFT_SEL_OFF            (20)

/** \\brief  Length for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.TIM_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_TIM_SEL_LEN              (1)

/** \\brief  Mask for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.TIM_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_TIM_SEL_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_CDTM_DTM_PS_CTRL_Bits.TIM_SEL */
#define IFX_GTM_CDTM_DTM_PS_CTRL_TIM_SEL_OFF              (18)

/** \\brief  Length for Ifx_GTM_CFG_Bits.SRC_IN_MUX */
#define IFX_GTM_CFG_SRC_IN_MUX_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_CFG_Bits.SRC_IN_MUX */
#define IFX_GTM_CFG_SRC_IN_MUX_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_CFG_Bits.SRC_IN_MUX */
#define IFX_GTM_CFG_SRC_IN_MUX_OFF                        (0)

/** \\brief  Length for Ifx_GTM_CLC_Bits.DISR */
#define IFX_GTM_CLC_DISR_LEN                              (1)

/** \\brief  Mask for Ifx_GTM_CLC_Bits.DISR */
#define IFX_GTM_CLC_DISR_MSK                              (0x1)

/** \\brief  Offset for Ifx_GTM_CLC_Bits.DISR */
#define IFX_GTM_CLC_DISR_OFF                              (0)

/** \\brief  Length for Ifx_GTM_CLC_Bits.DISS */
#define IFX_GTM_CLC_DISS_LEN                              (1)

/** \\brief  Mask for Ifx_GTM_CLC_Bits.DISS */
#define IFX_GTM_CLC_DISS_MSK                              (0x1)

/** \\brief  Offset for Ifx_GTM_CLC_Bits.DISS */
#define IFX_GTM_CLC_DISS_OFF                              (1)

/** \\brief  Length for Ifx_GTM_CLC_Bits.EDIS */
#define IFX_GTM_CLC_EDIS_LEN                              (1)

/** \\brief  Mask for Ifx_GTM_CLC_Bits.EDIS */
#define IFX_GTM_CLC_EDIS_MSK                              (0x1)

/** \\brief  Offset for Ifx_GTM_CLC_Bits.EDIS */
#define IFX_GTM_CLC_EDIS_OFF                              (3)

/** \\brief  Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS0_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS0_CLK_DIV_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS0_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS0_CLK_DIV_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS0_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS0_CLK_DIV_OFF              (0)

/** \\brief  Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS10_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS10_CLK_DIV_LEN             (2)

/** \\brief  Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS10_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS10_CLK_DIV_MSK             (0x3)

/** \\brief  Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS10_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS10_CLK_DIV_OFF             (20)

/** \\brief  Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS11_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS11_CLK_DIV_LEN             (2)

/** \\brief  Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS11_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS11_CLK_DIV_MSK             (0x3)

/** \\brief  Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS11_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS11_CLK_DIV_OFF             (22)

/** \\brief  Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS1_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS1_CLK_DIV_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS1_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS1_CLK_DIV_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS1_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS1_CLK_DIV_OFF              (2)

/** \\brief  Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS2_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS2_CLK_DIV_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS2_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS2_CLK_DIV_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS2_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS2_CLK_DIV_OFF              (4)

/** \\brief  Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS3_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS3_CLK_DIV_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS3_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS3_CLK_DIV_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS3_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS3_CLK_DIV_OFF              (6)

/** \\brief  Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS4_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS4_CLK_DIV_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS4_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS4_CLK_DIV_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS4_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS4_CLK_DIV_OFF              (8)

