Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS5_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS5_CLK_DIV_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS5_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS5_CLK_DIV_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS5_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS5_CLK_DIV_OFF              (10)

/** \\brief  Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS6_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS6_CLK_DIV_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS6_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS6_CLK_DIV_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS6_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS6_CLK_DIV_OFF              (12)

/** \\brief  Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS7_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS7_CLK_DIV_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS7_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS7_CLK_DIV_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS7_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS7_CLK_DIV_OFF              (14)

/** \\brief  Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS8_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS8_CLK_DIV_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS8_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS8_CLK_DIV_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS8_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS8_CLK_DIV_OFF              (16)

/** \\brief  Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS9_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS9_CLK_DIV_LEN              (2)

/** \\brief  Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS9_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS9_CLK_DIV_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS9_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS9_CLK_DIV_OFF              (18)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC0_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC0_EN_EIRQ_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC0_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC0_EN_EIRQ_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC0_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC0_EN_EIRQ_OFF             (0)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC10_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC10_EN_EIRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC10_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC10_EN_EIRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC10_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC10_EN_EIRQ_OFF            (10)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC11_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC11_EN_EIRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC11_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC11_EN_EIRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC11_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC11_EN_EIRQ_OFF            (11)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC1_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC1_EN_EIRQ_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC1_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC1_EN_EIRQ_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC1_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC1_EN_EIRQ_OFF             (1)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC2_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC2_EN_EIRQ_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC2_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC2_EN_EIRQ_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC2_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC2_EN_EIRQ_OFF             (2)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC3_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC3_EN_EIRQ_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC3_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC3_EN_EIRQ_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC3_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC3_EN_EIRQ_OFF             (3)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC4_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC4_EN_EIRQ_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC4_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC4_EN_EIRQ_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC4_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC4_EN_EIRQ_OFF             (4)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC5_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC5_EN_EIRQ_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC5_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC5_EN_EIRQ_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC5_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC5_EN_EIRQ_OFF             (5)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC6_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC6_EN_EIRQ_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC6_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC6_EN_EIRQ_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC6_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC6_EN_EIRQ_OFF             (6)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC7_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC7_EN_EIRQ_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC7_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC7_EN_EIRQ_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC7_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC7_EN_EIRQ_OFF             (7)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC8_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC8_EN_EIRQ_LEN             (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC8_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC8_EN_EIRQ_MSK             (0x1)

