Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_CMU_CLK_7_CTRL_Bits.CLK_CNT */
#define IFX_GTM_CMU_CLK_7_CTRL_CLK_CNT_MSK                (0xffffff)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_7_CTRL_Bits.CLK_CNT */
#define IFX_GTM_CMU_CLK_7_CTRL_CLK_CNT_OFF                (0)

/** \\brief  Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK0_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK0_EXT_DIVIDER_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK0_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK0_EXT_DIVIDER_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK0_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK0_EXT_DIVIDER_OFF         (0)

/** \\brief  Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK1_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK1_EXT_DIVIDER_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK1_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK1_EXT_DIVIDER_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK1_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK1_EXT_DIVIDER_OFF         (1)

/** \\brief  Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK2_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK2_EXT_DIVIDER_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK2_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK2_EXT_DIVIDER_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK2_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK2_EXT_DIVIDER_OFF         (2)

/** \\brief  Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK3_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK3_EXT_DIVIDER_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK3_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK3_EXT_DIVIDER_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK3_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK3_EXT_DIVIDER_OFF         (3)

/** \\brief  Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK4_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK4_EXT_DIVIDER_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK4_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK4_EXT_DIVIDER_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK4_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK4_EXT_DIVIDER_OFF         (4)

/** \\brief  Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK5_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK5_EXT_DIVIDER_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK5_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK5_EXT_DIVIDER_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK5_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK5_EXT_DIVIDER_OFF         (5)

/** \\brief  Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK6_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK6_EXT_DIVIDER_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK6_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK6_EXT_DIVIDER_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK6_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK6_EXT_DIVIDER_OFF         (6)

/** \\brief  Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK7_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK7_EXT_DIVIDER_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK7_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK7_EXT_DIVIDER_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK7_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK7_EXT_DIVIDER_OFF         (7)

/** \\brief  Length for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK8_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK8_EXT_DIVIDER_LEN         (1)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK8_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK8_EXT_DIVIDER_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_CTRL_Bits.CLK8_EXT_DIVIDER */
#define IFX_GTM_CMU_CLK_CTRL_CLK8_EXT_DIVIDER_OFF         (8)

/** \\brief  Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK0 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK0_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK0 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK0_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK0 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK0_OFF                    (0)

/** \\brief  Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK1 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK1_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK1 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK1_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK1 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK1_OFF                    (2)

/** \\brief  Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK2 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK2_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK2 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK2_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK2 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK2_OFF                    (4)

/** \\brief  Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK3 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK3_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK3 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK3_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK3 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK3_OFF                    (6)

/** \\brief  Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK4 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK4_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK4 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK4_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK4 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK4_OFF                    (8)

/** \\brief  Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK5 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK5_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK5 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK5_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK5 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK5_OFF                    (10)

/** \\brief  Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK6 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK6_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK6 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK6_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK6 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK6_OFF                    (12)

