Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK7 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK7_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK7 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK7_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK7 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK7_OFF                    (14)

/** \\brief  Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_ECLK0 */
#define IFX_GTM_CMU_CLK_EN_EN_ECLK0_LEN                   (2)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_ECLK0 */
#define IFX_GTM_CMU_CLK_EN_EN_ECLK0_MSK                   (0x3)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_ECLK0 */
#define IFX_GTM_CMU_CLK_EN_EN_ECLK0_OFF                   (16)

/** \\brief  Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_ECLK1 */
#define IFX_GTM_CMU_CLK_EN_EN_ECLK1_LEN                   (2)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_ECLK1 */
#define IFX_GTM_CMU_CLK_EN_EN_ECLK1_MSK                   (0x3)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_ECLK1 */
#define IFX_GTM_CMU_CLK_EN_EN_ECLK1_OFF                   (18)

/** \\brief  Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_ECLK2 */
#define IFX_GTM_CMU_CLK_EN_EN_ECLK2_LEN                   (2)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_ECLK2 */
#define IFX_GTM_CMU_CLK_EN_EN_ECLK2_MSK                   (0x3)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_ECLK2 */
#define IFX_GTM_CMU_CLK_EN_EN_ECLK2_OFF                   (20)

/** \\brief  Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_FXCLK */
#define IFX_GTM_CMU_CLK_EN_EN_FXCLK_LEN                   (2)

/** \\brief  Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_FXCLK */
#define IFX_GTM_CMU_CLK_EN_EN_FXCLK_MSK                   (0x3)

/** \\brief  Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_FXCLK */
#define IFX_GTM_CMU_CLK_EN_EN_FXCLK_OFF                   (22)

/** \\brief  Length for Ifx_GTM_CMU_ECLK_DEN_Bits.ECLK_DEN */
#define IFX_GTM_CMU_ECLK_DEN_ECLK_DEN_LEN                 (24)

/** \\brief  Mask for Ifx_GTM_CMU_ECLK_DEN_Bits.ECLK_DEN */
#define IFX_GTM_CMU_ECLK_DEN_ECLK_DEN_MSK                 (0xffffff)

/** \\brief  Offset for Ifx_GTM_CMU_ECLK_DEN_Bits.ECLK_DEN */
#define IFX_GTM_CMU_ECLK_DEN_ECLK_DEN_OFF                 (0)

/** \\brief  Length for Ifx_GTM_CMU_ECLK_NUM_Bits.ECLK_NUM */
#define IFX_GTM_CMU_ECLK_NUM_ECLK_NUM_LEN                 (24)

/** \\brief  Mask for Ifx_GTM_CMU_ECLK_NUM_Bits.ECLK_NUM */
#define IFX_GTM_CMU_ECLK_NUM_ECLK_NUM_MSK                 (0xffffff)

/** \\brief  Offset for Ifx_GTM_CMU_ECLK_NUM_Bits.ECLK_NUM */
#define IFX_GTM_CMU_ECLK_NUM_ECLK_NUM_OFF                 (0)

/** \\brief  Length for Ifx_GTM_CMU_FXCLK_CTRL_Bits.FXCLK_SEL */
#define IFX_GTM_CMU_FXCLK_CTRL_FXCLK_SEL_LEN              (4)

/** \\brief  Mask for Ifx_GTM_CMU_FXCLK_CTRL_Bits.FXCLK_SEL */
#define IFX_GTM_CMU_FXCLK_CTRL_FXCLK_SEL_MSK              (0xf)

/** \\brief  Offset for Ifx_GTM_CMU_FXCLK_CTRL_Bits.FXCLK_SEL */
#define IFX_GTM_CMU_FXCLK_CTRL_FXCLK_SEL_OFF              (0)

/** \\brief  Length for Ifx_GTM_CMU_GCLK_DEN_Bits.GCLK_DEN */
#define IFX_GTM_CMU_GCLK_DEN_GCLK_DEN_LEN                 (24)

/** \\brief  Mask for Ifx_GTM_CMU_GCLK_DEN_Bits.GCLK_DEN */
#define IFX_GTM_CMU_GCLK_DEN_GCLK_DEN_MSK                 (0xffffff)

/** \\brief  Offset for Ifx_GTM_CMU_GCLK_DEN_Bits.GCLK_DEN */
#define IFX_GTM_CMU_GCLK_DEN_GCLK_DEN_OFF                 (0)

/** \\brief  Length for Ifx_GTM_CMU_GCLK_NUM_Bits.GCLK_NUM */
#define IFX_GTM_CMU_GCLK_NUM_GCLK_NUM_LEN                 (24)

/** \\brief  Mask for Ifx_GTM_CMU_GCLK_NUM_Bits.GCLK_NUM */
#define IFX_GTM_CMU_GCLK_NUM_GCLK_NUM_MSK                 (0xffffff)

/** \\brief  Offset for Ifx_GTM_CMU_GCLK_NUM_Bits.GCLK_NUM */
#define IFX_GTM_CMU_GCLK_NUM_GCLK_NUM_OFF                 (0)

/** \\brief  Length for Ifx_GTM_CMU_GLB_CTRL_Bits.ARU_ADDR_RSTGLB */
#define IFX_GTM_CMU_GLB_CTRL_ARU_ADDR_RSTGLB_LEN          (1)

/** \\brief  Mask for Ifx_GTM_CMU_GLB_CTRL_Bits.ARU_ADDR_RSTGLB */
#define IFX_GTM_CMU_GLB_CTRL_ARU_ADDR_RSTGLB_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_CMU_GLB_CTRL_Bits.ARU_ADDR_RSTGLB */
#define IFX_GTM_CMU_GLB_CTRL_ARU_ADDR_RSTGLB_OFF          (0)

/** \\brief  Length for Ifx_GTM_CTRL_Bits.AEIM_CLUSTER */
#define IFX_GTM_CTRL_AEIM_CLUSTER_LEN                     (4)

/** \\brief  Mask for Ifx_GTM_CTRL_Bits.AEIM_CLUSTER */
#define IFX_GTM_CTRL_AEIM_CLUSTER_MSK                     (0xf)

/** \\brief  Offset for Ifx_GTM_CTRL_Bits.AEIM_CLUSTER */
#define IFX_GTM_CTRL_AEIM_CLUSTER_OFF                     (12)

/** \\brief  Length for Ifx_GTM_CTRL_Bits.RF_PROT */
#define IFX_GTM_CTRL_RF_PROT_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_CTRL_Bits.RF_PROT */
#define IFX_GTM_CTRL_RF_PROT_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_CTRL_Bits.RF_PROT */
#define IFX_GTM_CTRL_RF_PROT_OFF                          (0)

/** \\brief  Length for Ifx_GTM_CTRL_Bits.TO_MODE */
#define IFX_GTM_CTRL_TO_MODE_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_CTRL_Bits.TO_MODE */
#define IFX_GTM_CTRL_TO_MODE_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_CTRL_Bits.TO_MODE */
#define IFX_GTM_CTRL_TO_MODE_OFF                          (1)

/** \\brief  Length for Ifx_GTM_CTRL_Bits.TO_VAL */
#define IFX_GTM_CTRL_TO_VAL_LEN                           (5)

/** \\brief  Mask for Ifx_GTM_CTRL_Bits.TO_VAL */
#define IFX_GTM_CTRL_TO_VAL_MSK                           (0x1f)

/** \\brief  Offset for Ifx_GTM_CTRL_Bits.TO_VAL */
#define IFX_GTM_CTRL_TO_VAL_OFF                           (4)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_0_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_0_ACB_0_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_0_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_0_ACB_0_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_0_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_0_ACB_0_OFF                      (0)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_0_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_0_ACB_1_LEN                      (5)

