Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_DPLL_ACB_0_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_0_ACB_1_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_0_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_0_ACB_1_OFF                      (8)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_0_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_0_ACB_2_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_0_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_0_ACB_2_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_0_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_0_ACB_2_OFF                      (16)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_0_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_0_ACB_3_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_0_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_0_ACB_3_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_0_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_0_ACB_3_OFF                      (24)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_1_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_1_ACB_0_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_1_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_1_ACB_0_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_1_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_1_ACB_0_OFF                      (0)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_1_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_1_ACB_1_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_1_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_1_ACB_1_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_1_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_1_ACB_1_OFF                      (8)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_1_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_1_ACB_2_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_1_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_1_ACB_2_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_1_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_1_ACB_2_OFF                      (16)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_1_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_1_ACB_3_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_1_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_1_ACB_3_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_1_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_1_ACB_3_OFF                      (24)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_2_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_2_ACB_0_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_2_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_2_ACB_0_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_2_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_2_ACB_0_OFF                      (0)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_2_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_2_ACB_1_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_2_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_2_ACB_1_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_2_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_2_ACB_1_OFF                      (8)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_2_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_2_ACB_2_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_2_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_2_ACB_2_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_2_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_2_ACB_2_OFF                      (16)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_2_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_2_ACB_3_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_2_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_2_ACB_3_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_2_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_2_ACB_3_OFF                      (24)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_3_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_3_ACB_0_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_3_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_3_ACB_0_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_3_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_3_ACB_0_OFF                      (0)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_3_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_3_ACB_1_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_3_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_3_ACB_1_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_3_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_3_ACB_1_OFF                      (8)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_3_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_3_ACB_2_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_3_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_3_ACB_2_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_3_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_3_ACB_2_OFF                      (16)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_3_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_3_ACB_3_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_3_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_3_ACB_3_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_3_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_3_ACB_3_OFF                      (24)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_4_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_4_ACB_0_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_4_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_4_ACB_0_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_4_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_4_ACB_0_OFF                      (0)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_4_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_4_ACB_1_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_4_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_4_ACB_1_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_4_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_4_ACB_1_OFF                      (8)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_4_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_4_ACB_2_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_4_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_4_ACB_2_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_4_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_4_ACB_2_OFF                      (16)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_4_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_4_ACB_3_LEN                      (5)

