Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_DPLL_ACB_4_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_4_ACB_3_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_4_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_4_ACB_3_OFF                      (24)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_5_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_5_ACB_0_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_5_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_5_ACB_0_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_5_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_5_ACB_0_OFF                      (0)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_5_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_5_ACB_1_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_5_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_5_ACB_1_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_5_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_5_ACB_1_OFF                      (8)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_5_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_5_ACB_2_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_5_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_5_ACB_2_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_5_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_5_ACB_2_OFF                      (16)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_5_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_5_ACB_3_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_5_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_5_ACB_3_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_5_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_5_ACB_3_OFF                      (24)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_6_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_6_ACB_0_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_6_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_6_ACB_0_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_6_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_6_ACB_0_OFF                      (0)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_6_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_6_ACB_1_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_6_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_6_ACB_1_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_6_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_6_ACB_1_OFF                      (8)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_6_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_6_ACB_2_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_6_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_6_ACB_2_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_6_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_6_ACB_2_OFF                      (16)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_6_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_6_ACB_3_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_6_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_6_ACB_3_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_6_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_6_ACB_3_OFF                      (24)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_7_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_7_ACB_0_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_7_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_7_ACB_0_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_7_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_7_ACB_0_OFF                      (0)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_7_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_7_ACB_1_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_7_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_7_ACB_1_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_7_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_7_ACB_1_OFF                      (8)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_7_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_7_ACB_2_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_7_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_7_ACB_2_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_7_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_7_ACB_2_OFF                      (16)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_7_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_7_ACB_3_LEN                      (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_7_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_7_ACB_3_MSK                      (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_7_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_7_ACB_3_OFF                      (24)

/** \\brief  Length for Ifx_GTM_DPLL_ACT_STA_Bits.ACT_N */
#define IFX_GTM_DPLL_ACT_STA_ACT_N_LEN                    (32)

/** \\brief  Mask for Ifx_GTM_DPLL_ACT_STA_Bits.ACT_N */
#define IFX_GTM_DPLL_ACT_STA_ACT_N_MSK                    (0xffffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_ACT_STA_Bits.ACT_N */
#define IFX_GTM_DPLL_ACT_STA_ACT_N_OFF                    (0)

/** \\brief  Length for Ifx_GTM_DPLL_ADD_IN_CAL1_Bits.ADD_IN_CAL1 */
#define IFX_GTM_DPLL_ADD_IN_CAL1_ADD_IN_CAL1_LEN          (24)

/** \\brief  Mask for Ifx_GTM_DPLL_ADD_IN_CAL1_Bits.ADD_IN_CAL1 */
#define IFX_GTM_DPLL_ADD_IN_CAL1_ADD_IN_CAL1_MSK          (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_ADD_IN_CAL1_Bits.ADD_IN_CAL1 */
#define IFX_GTM_DPLL_ADD_IN_CAL1_ADD_IN_CAL1_OFF          (0)

/** \\brief  Length for Ifx_GTM_DPLL_ADD_IN_CAL2_Bits.ADD_IN_CAL2 */
#define IFX_GTM_DPLL_ADD_IN_CAL2_ADD_IN_CAL2_LEN          (24)

/** \\brief  Mask for Ifx_GTM_DPLL_ADD_IN_CAL2_Bits.ADD_IN_CAL2 */
#define IFX_GTM_DPLL_ADD_IN_CAL2_ADD_IN_CAL2_MSK          (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_ADD_IN_CAL2_Bits.ADD_IN_CAL2 */
#define IFX_GTM_DPLL_ADD_IN_CAL2_ADD_IN_CAL2_OFF          (0)

/** \\brief  Length for Ifx_GTM_DPLL_ADD_IN_LD1_Bits.ADD_IN_LD1 */
#define IFX_GTM_DPLL_ADD_IN_LD1_ADD_IN_LD1_LEN            (24)

/** \\brief  Mask for Ifx_GTM_DPLL_ADD_IN_LD1_Bits.ADD_IN_LD1 */
#define IFX_GTM_DPLL_ADD_IN_LD1_ADD_IN_LD1_MSK            (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_ADD_IN_LD1_Bits.ADD_IN_LD1 */
#define IFX_GTM_DPLL_ADD_IN_LD1_ADD_IN_LD1_OFF            (0)

/** \\brief  Length for Ifx_GTM_DPLL_ADD_IN_LD2_Bits.ADD_IN_LD2 */
#define IFX_GTM_DPLL_ADD_IN_LD2_ADD_IN_LD2_LEN            (24)

/** \\brief  Mask for Ifx_GTM_DPLL_ADD_IN_LD2_Bits.ADD_IN_LD2 */
#define IFX_GTM_DPLL_ADD_IN_LD2_ADD_IN_LD2_MSK            (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_ADD_IN_LD2_Bits.ADD_IN_LD2 */
#define IFX_GTM_DPLL_ADD_IN_LD2_ADD_IN_LD2_OFF            (0)

/** \\brief  Length for Ifx_GTM_DPLL_ADT_S_Bits.NOT_USED */
#define IFX_GTM_DPLL_ADT_S_NOT_USED_LEN                   (2)

