Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_DPLL_ADT_S_Bits.NOT_USED */
#define IFX_GTM_DPLL_ADT_S_NOT_USED_MSK                   (0x3)

/** \\brief  Offset for Ifx_GTM_DPLL_ADT_S_Bits.NOT_USED */
#define IFX_GTM_DPLL_ADT_S_NOT_USED_OFF                   (22)

/** \\brief  Length for Ifx_GTM_DPLL_ADT_S_Bits.NS */
#define IFX_GTM_DPLL_ADT_S_NS_LEN                         (6)

/** \\brief  Mask for Ifx_GTM_DPLL_ADT_S_Bits.NS */
#define IFX_GTM_DPLL_ADT_S_NS_MSK                         (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_ADT_S_Bits.NS */
#define IFX_GTM_DPLL_ADT_S_NS_OFF                         (16)

/** \\brief  Length for Ifx_GTM_DPLL_ADT_S_Bits.PD_S */
#define IFX_GTM_DPLL_ADT_S_PD_S_LEN                       (16)

/** \\brief  Mask for Ifx_GTM_DPLL_ADT_S_Bits.PD_S */
#define IFX_GTM_DPLL_ADT_S_PD_S_MSK                       (0xffff)

/** \\brief  Offset for Ifx_GTM_DPLL_ADT_S_Bits.PD_S */
#define IFX_GTM_DPLL_ADT_S_PD_S_OFF                       (0)

/** \\brief  Length for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2A */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2A_LEN                   (8)

/** \\brief  Mask for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2A */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2A_MSK                   (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2A */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2A_OFF                   (0)

/** \\brief  Length for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2B */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2B_LEN                   (8)

/** \\brief  Mask for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2B */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2B_MSK                   (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2B */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2B_OFF                   (8)

/** \\brief  Length for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2C */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2C_LEN                   (8)

/** \\brief  Mask for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2C */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2C_MSK                   (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2C */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2C_OFF                   (16)

/** \\brief  Length for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2D */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2D_LEN                   (8)

/** \\brief  Mask for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2D */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2D_MSK                   (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2D */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2D_OFF                   (24)

/** \\brief  Length for Ifx_GTM_DPLL_APS_1C3_Bits.APS_1C3 */
#define IFX_GTM_DPLL_APS_1C3_APS_1C3_LEN                  (6)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_1C3_Bits.APS_1C3 */
#define IFX_GTM_DPLL_APS_1C3_APS_1C3_MSK                  (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_1C3_Bits.APS_1C3 */
#define IFX_GTM_DPLL_APS_1C3_APS_1C3_OFF                  (2)

/** \\brief  Length for Ifx_GTM_DPLL_APS_1C3_EXT_Bits.APS_1C3 */
#define IFX_GTM_DPLL_APS_1C3_EXT_APS_1C3_LEN              (7)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_1C3_EXT_Bits.APS_1C3 */
#define IFX_GTM_DPLL_APS_1C3_EXT_APS_1C3_MSK              (0x7f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_1C3_EXT_Bits.APS_1C3 */
#define IFX_GTM_DPLL_APS_1C3_EXT_APS_1C3_OFF              (2)

/** \\brief  Length for Ifx_GTM_DPLL_APS_Bits.APS_1C2 */
#define IFX_GTM_DPLL_APS_APS_1C2_LEN                      (6)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_Bits.APS_1C2 */
#define IFX_GTM_DPLL_APS_APS_1C2_MSK                      (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_Bits.APS_1C2 */
#define IFX_GTM_DPLL_APS_APS_1C2_OFF                      (14)

/** \\brief  Length for Ifx_GTM_DPLL_APS_Bits.APS */
#define IFX_GTM_DPLL_APS_APS_LEN                          (6)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_Bits.APS */
#define IFX_GTM_DPLL_APS_APS_MSK                          (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_Bits.APS */
#define IFX_GTM_DPLL_APS_APS_OFF                          (2)

/** \\brief  Length for Ifx_GTM_DPLL_APS_EXT_Bits.APS_1C2 */
#define IFX_GTM_DPLL_APS_EXT_APS_1C2_LEN                  (7)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_EXT_Bits.APS_1C2 */
#define IFX_GTM_DPLL_APS_EXT_APS_1C2_MSK                  (0x7f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_EXT_Bits.APS_1C2 */
#define IFX_GTM_DPLL_APS_EXT_APS_1C2_OFF                  (14)

/** \\brief  Length for Ifx_GTM_DPLL_APS_EXT_Bits.APS */
#define IFX_GTM_DPLL_APS_EXT_APS_LEN                      (7)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_EXT_Bits.APS */
#define IFX_GTM_DPLL_APS_EXT_APS_MSK                      (0x7f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_EXT_Bits.APS */
#define IFX_GTM_DPLL_APS_EXT_APS_OFF                      (2)

/** \\brief  Length for Ifx_GTM_DPLL_APS_EXT_Bits.WAPS_1C2 */
#define IFX_GTM_DPLL_APS_EXT_WAPS_1C2_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_EXT_Bits.WAPS_1C2 */
#define IFX_GTM_DPLL_APS_EXT_WAPS_1C2_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_EXT_Bits.WAPS_1C2 */
#define IFX_GTM_DPLL_APS_EXT_WAPS_1C2_OFF                 (13)

/** \\brief  Length for Ifx_GTM_DPLL_APS_EXT_Bits.WAPS */
#define IFX_GTM_DPLL_APS_EXT_WAPS_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_EXT_Bits.WAPS */
#define IFX_GTM_DPLL_APS_EXT_WAPS_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_EXT_Bits.WAPS */
#define IFX_GTM_DPLL_APS_EXT_WAPS_OFF                     (1)

/** \\brief  Length for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_EXT */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_EXT_LEN             (6)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_EXT */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_EXT_MSK             (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_EXT */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_EXT_OFF             (0)

/** \\brief  Length for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_OLD */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_OLD_LEN             (6)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_OLD */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_OLD_MSK             (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_OLD */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_OLD_OFF             (14)

/** \\brief  Length for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_STATUS */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_STATUS_LEN          (1)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_STATUS */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_STATUS_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_STATUS */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_STATUS_OFF          (6)

/** \\brief  Length for Ifx_GTM_DPLL_APS_SYNC_EXT_Bits.APS_1C2_EXT */
#define IFX_GTM_DPLL_APS_SYNC_EXT_APS_1C2_EXT_LEN         (7)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_SYNC_EXT_Bits.APS_1C2_EXT */
#define IFX_GTM_DPLL_APS_SYNC_EXT_APS_1C2_EXT_MSK         (0x7f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_SYNC_EXT_Bits.APS_1C2_EXT */
#define IFX_GTM_DPLL_APS_SYNC_EXT_APS_1C2_EXT_OFF         (0)

