Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_DPLL_CNT_NUM_1_Bits.CNT_NUM_1 */
#define IFX_GTM_DPLL_CNT_NUM_1_CNT_NUM_1_OFF              (0)

/** \\brief  Length for Ifx_GTM_DPLL_CNT_NUM_2_Bits.CNT_NUM_2 */
#define IFX_GTM_DPLL_CNT_NUM_2_CNT_NUM_2_LEN              (24)

/** \\brief  Mask for Ifx_GTM_DPLL_CNT_NUM_2_Bits.CNT_NUM_2 */
#define IFX_GTM_DPLL_CNT_NUM_2_CNT_NUM_2_MSK              (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_CNT_NUM_2_Bits.CNT_NUM_2 */
#define IFX_GTM_DPLL_CNT_NUM_2_CNT_NUM_2_OFF              (0)

/** \\brief  Length for Ifx_GTM_DPLL_CSN_MAX_Bits.CSN_MAX */
#define IFX_GTM_DPLL_CSN_MAX_CSN_MAX_LEN                  (24)

/** \\brief  Mask for Ifx_GTM_DPLL_CSN_MAX_Bits.CSN_MAX */
#define IFX_GTM_DPLL_CSN_MAX_CSN_MAX_MSK                  (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_CSN_MAX_Bits.CSN_MAX */
#define IFX_GTM_DPLL_CSN_MAX_CSN_MAX_OFF                  (0)

/** \\brief  Length for Ifx_GTM_DPLL_CSN_MIN_Bits.CSN_MIN */
#define IFX_GTM_DPLL_CSN_MIN_CSN_MIN_LEN                  (24)

/** \\brief  Mask for Ifx_GTM_DPLL_CSN_MIN_Bits.CSN_MIN */
#define IFX_GTM_DPLL_CSN_MIN_CSN_MIN_MSK                  (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_CSN_MIN_Bits.CSN_MIN */
#define IFX_GTM_DPLL_CSN_MIN_CSN_MIN_OFF                  (0)

/** \\brief  Length for Ifx_GTM_DPLL_CTN_MAX_Bits.CTN_MAX */
#define IFX_GTM_DPLL_CTN_MAX_CTN_MAX_LEN                  (24)

/** \\brief  Mask for Ifx_GTM_DPLL_CTN_MAX_Bits.CTN_MAX */
#define IFX_GTM_DPLL_CTN_MAX_CTN_MAX_MSK                  (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_CTN_MAX_Bits.CTN_MAX */
#define IFX_GTM_DPLL_CTN_MAX_CTN_MAX_OFF                  (0)

/** \\brief  Length for Ifx_GTM_DPLL_CTN_MIN_Bits.CTN_MIN */
#define IFX_GTM_DPLL_CTN_MIN_CTN_MIN_LEN                  (24)

/** \\brief  Mask for Ifx_GTM_DPLL_CTN_MIN_Bits.CTN_MIN */
#define IFX_GTM_DPLL_CTN_MIN_CTN_MIN_MSK                  (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_CTN_MIN_Bits.CTN_MIN */
#define IFX_GTM_DPLL_CTN_MIN_CTN_MIN_OFF                  (0)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_AMS_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_AMS_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_AMS_OFF                       (25)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_AMT_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_AMT_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_AMT_OFF                       (26)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_IDS_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_IDS_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_IDS_OFF                       (27)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_IDT_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_IDT_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_IDT_OFF                       (28)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_IFP_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_IFP_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_IFP_OFF                       (10)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_MLT_LEN                       (10)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_MLT_MSK                       (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_MLT_OFF                       (0)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_RMO_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_RMO_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_RMO_OFF                       (31)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SEN_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SEN_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SEN_OFF                       (29)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_AMS_LEN          (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_AMS_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_AMS_OFF          (25)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IDS_LEN          (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IDS_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IDS_OFF          (27)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IFP_LEN          (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IFP_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_IFP_OFF          (10)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_RMO_LEN          (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_RMO_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_STATE_RMO_OFF          (31)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_AMT_LEN        (1)

