Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_AMT_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_AMT_OFF        (26)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IDT_LEN        (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IDT_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IDT_OFF        (28)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IFP_LEN        (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IFP_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_IFP_OFF        (10)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_MLT_LEN        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_MLT_MSK        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_MLT_OFF        (0)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_RMO_LEN        (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_RMO_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_RMO_OFF        (31)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_0_SNU_LEN                       (5)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_0_SNU_MSK                       (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_0_SNU_OFF                       (11)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_TEN_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_TEN_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_TEN_OFF                       (30)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.TNU */
#define IFX_GTM_DPLL_CTRL_0_TNU_LEN                       (9)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.TNU */
#define IFX_GTM_DPLL_CTRL_0_TNU_MSK                       (0x1ff)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.TNU */
#define IFX_GTM_DPLL_CTRL_0_TNU_OFF                       (16)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.ACBU */
#define IFX_GTM_DPLL_CTRL_11_ACBU_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.ACBU */
#define IFX_GTM_DPLL_CTRL_11_ACBU_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.ACBU */
#define IFX_GTM_DPLL_CTRL_11_ACBU_OFF                     (15)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.ADS */
#define IFX_GTM_DPLL_CTRL_11_ADS_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.ADS */
#define IFX_GTM_DPLL_CTRL_11_ADS_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.ADS */
#define IFX_GTM_DPLL_CTRL_11_ADS_OFF                      (7)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.ADT */
#define IFX_GTM_DPLL_CTRL_11_ADT_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.ADT */
#define IFX_GTM_DPLL_CTRL_11_ADT_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.ADT */
#define IFX_GTM_DPLL_CTRL_11_ADT_OFF                      (6)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.ERZ1 */
#define IFX_GTM_DPLL_CTRL_11_ERZ1_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.ERZ1 */
#define IFX_GTM_DPLL_CTRL_11_ERZ1_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.ERZ1 */
#define IFX_GTM_DPLL_CTRL_11_ERZ1_OFF                     (1)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.ERZ2 */
#define IFX_GTM_DPLL_CTRL_11_ERZ2_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.ERZ2 */
#define IFX_GTM_DPLL_CTRL_11_ERZ2_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.ERZ2 */
#define IFX_GTM_DPLL_CTRL_11_ERZ2_OFF                     (9)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.FSYL1 */
#define IFX_GTM_DPLL_CTRL_11_FSYL1_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.FSYL1 */
#define IFX_GTM_DPLL_CTRL_11_FSYL1_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.FSYL1 */
#define IFX_GTM_DPLL_CTRL_11_FSYL1_OFF                    (3)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.FSYL2 */
#define IFX_GTM_DPLL_CTRL_11_FSYL2_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.FSYL2 */
#define IFX_GTM_DPLL_CTRL_11_FSYL2_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.FSYL2 */
#define IFX_GTM_DPLL_CTRL_11_FSYL2_OFF                    (11)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.INCF1 */
#define IFX_GTM_DPLL_CTRL_11_INCF1_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.INCF1 */
#define IFX_GTM_DPLL_CTRL_11_INCF1_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.INCF1 */
#define IFX_GTM_DPLL_CTRL_11_INCF1_OFF                    (4)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.INCF2 */
#define IFX_GTM_DPLL_CTRL_11_INCF2_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.INCF2 */
#define IFX_GTM_DPLL_CTRL_11_INCF2_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.INCF2 */
#define IFX_GTM_DPLL_CTRL_11_INCF2_OFF                    (12)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF1_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_PCMF1_INCCNT_B_LEN           (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF1_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_PCMF1_INCCNT_B_MSK           (0x1)

