Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF1_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_PCMF1_INCCNT_B_OFF           (5)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF1 */
#define IFX_GTM_DPLL_CTRL_11_PCMF1_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF1 */
#define IFX_GTM_DPLL_CTRL_11_PCMF1_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF1 */
#define IFX_GTM_DPLL_CTRL_11_PCMF1_OFF                    (2)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF2_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_PCMF2_INCCNT_B_LEN           (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF2_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_PCMF2_INCCNT_B_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF2_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_PCMF2_INCCNT_B_OFF           (13)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF2 */
#define IFX_GTM_DPLL_CTRL_11_PCMF2_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF2 */
#define IFX_GTM_DPLL_CTRL_11_PCMF2_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF2 */
#define IFX_GTM_DPLL_CTRL_11_PCMF2_OFF                    (10)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.SIP1 */
#define IFX_GTM_DPLL_CTRL_11_SIP1_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.SIP1 */
#define IFX_GTM_DPLL_CTRL_11_SIP1_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.SIP1 */
#define IFX_GTM_DPLL_CTRL_11_SIP1_OFF                     (0)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.SIP2 */
#define IFX_GTM_DPLL_CTRL_11_SIP2_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.SIP2 */
#define IFX_GTM_DPLL_CTRL_11_SIP2_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.SIP2 */
#define IFX_GTM_DPLL_CTRL_11_SIP2_OFF                     (8)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.STATE_EXT */
#define IFX_GTM_DPLL_CTRL_11_STATE_EXT_LEN                (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.STATE_EXT */
#define IFX_GTM_DPLL_CTRL_11_STATE_EXT_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.STATE_EXT */
#define IFX_GTM_DPLL_CTRL_11_STATE_EXT_OFF                (14)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.WACBU */
#define IFX_GTM_DPLL_CTRL_11_WACBU_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WACBU */
#define IFX_GTM_DPLL_CTRL_11_WACBU_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WACBU */
#define IFX_GTM_DPLL_CTRL_11_WACBU_OFF                    (31)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.WADS */
#define IFX_GTM_DPLL_CTRL_11_WADS_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WADS */
#define IFX_GTM_DPLL_CTRL_11_WADS_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WADS */
#define IFX_GTM_DPLL_CTRL_11_WADS_OFF                     (23)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.WADT */
#define IFX_GTM_DPLL_CTRL_11_WADT_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WADT */
#define IFX_GTM_DPLL_CTRL_11_WADT_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WADT */
#define IFX_GTM_DPLL_CTRL_11_WADT_OFF                     (22)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.WERZ1 */
#define IFX_GTM_DPLL_CTRL_11_WERZ1_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WERZ1 */
#define IFX_GTM_DPLL_CTRL_11_WERZ1_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WERZ1 */
#define IFX_GTM_DPLL_CTRL_11_WERZ1_OFF                    (17)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.WERZ2 */
#define IFX_GTM_DPLL_CTRL_11_WERZ2_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WERZ2 */
#define IFX_GTM_DPLL_CTRL_11_WERZ2_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WERZ2 */
#define IFX_GTM_DPLL_CTRL_11_WERZ2_OFF                    (25)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.WFSYL1 */
#define IFX_GTM_DPLL_CTRL_11_WFSYL1_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WFSYL1 */
#define IFX_GTM_DPLL_CTRL_11_WFSYL1_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WFSYL1 */
#define IFX_GTM_DPLL_CTRL_11_WFSYL1_OFF                   (19)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.WFSYL2 */
#define IFX_GTM_DPLL_CTRL_11_WFSYL2_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WFSYL2 */
#define IFX_GTM_DPLL_CTRL_11_WFSYL2_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WFSYL2 */
#define IFX_GTM_DPLL_CTRL_11_WFSYL2_OFF                   (27)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.WINCF1 */
#define IFX_GTM_DPLL_CTRL_11_WINCF1_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WINCF1 */
#define IFX_GTM_DPLL_CTRL_11_WINCF1_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WINCF1 */
#define IFX_GTM_DPLL_CTRL_11_WINCF1_OFF                   (20)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.WINCF2 */
#define IFX_GTM_DPLL_CTRL_11_WINCF2_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WINCF2 */
#define IFX_GTM_DPLL_CTRL_11_WINCF2_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WINCF2 */
#define IFX_GTM_DPLL_CTRL_11_WINCF2_OFF                   (28)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF1_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_WPCMF1_INCCNT_B_LEN          (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF1_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_WPCMF1_INCCNT_B_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF1_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_WPCMF1_INCCNT_B_OFF          (21)

