Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF1 */
#define IFX_GTM_DPLL_CTRL_11_WPCMF1_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF1 */
#define IFX_GTM_DPLL_CTRL_11_WPCMF1_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF1 */
#define IFX_GTM_DPLL_CTRL_11_WPCMF1_OFF                   (18)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF2_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_WPCMF2_INCCNT_B_LEN          (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF2_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_WPCMF2_INCCNT_B_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF2_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_WPCMF2_INCCNT_B_OFF          (29)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF2 */
#define IFX_GTM_DPLL_CTRL_11_WPCMF2_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF2 */
#define IFX_GTM_DPLL_CTRL_11_WPCMF2_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WPCMF2 */
#define IFX_GTM_DPLL_CTRL_11_WPCMF2_OFF                   (26)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.WSIP1 */
#define IFX_GTM_DPLL_CTRL_11_WSIP1_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WSIP1 */
#define IFX_GTM_DPLL_CTRL_11_WSIP1_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WSIP1 */
#define IFX_GTM_DPLL_CTRL_11_WSIP1_OFF                    (16)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.WSIP2 */
#define IFX_GTM_DPLL_CTRL_11_WSIP2_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WSIP2 */
#define IFX_GTM_DPLL_CTRL_11_WSIP2_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WSIP2 */
#define IFX_GTM_DPLL_CTRL_11_WSIP2_OFF                    (24)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_11_Bits.WSTATE_EXT */
#define IFX_GTM_DPLL_CTRL_11_WSTATE_EXT_LEN               (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WSTATE_EXT */
#define IFX_GTM_DPLL_CTRL_11_WSTATE_EXT_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WSTATE_EXT */
#define IFX_GTM_DPLL_CTRL_11_WSTATE_EXT_OFF               (30)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_COA_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_COA_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_COA_OFF                       (3)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.DEN */
#define IFX_GTM_DPLL_CTRL_1_DEN_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.DEN */
#define IFX_GTM_DPLL_CTRL_1_DEN_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.DEN */
#define IFX_GTM_DPLL_CTRL_1_DEN_OFF                       (1)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_DLM1_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_DLM1_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_DLM1_OFF                      (6)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.DLM2 */
#define IFX_GTM_DPLL_CTRL_1_DLM2_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.DLM2 */
#define IFX_GTM_DPLL_CTRL_1_DLM2_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.DLM2 */
#define IFX_GTM_DPLL_CTRL_1_DLM2_OFF                      (9)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_DMO_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_DMO_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_DMO_OFF                       (0)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.IDDS */
#define IFX_GTM_DPLL_CTRL_1_IDDS_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.IDDS */
#define IFX_GTM_DPLL_CTRL_1_IDDS_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.IDDS */
#define IFX_GTM_DPLL_CTRL_1_IDDS_OFF                      (2)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.LCD */
#define IFX_GTM_DPLL_CTRL_1_LCD_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.LCD */
#define IFX_GTM_DPLL_CTRL_1_LCD_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.LCD */
#define IFX_GTM_DPLL_CTRL_1_LCD_OFF                       (22)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_PCM1_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_PCM1_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_PCM1_OFF                      (7)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.PCM2 */
#define IFX_GTM_DPLL_CTRL_1_PCM2_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.PCM2 */
#define IFX_GTM_DPLL_CTRL_1_PCM2_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.PCM2 */
#define IFX_GTM_DPLL_CTRL_1_PCM2_OFF                      (10)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.PIT */
#define IFX_GTM_DPLL_CTRL_1_PIT_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.PIT */
#define IFX_GTM_DPLL_CTRL_1_PIT_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.PIT */
#define IFX_GTM_DPLL_CTRL_1_PIT_OFF                       (4)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SGE1_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SGE1_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SGE1_OFF                      (5)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SGE2_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SGE2_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SGE2_OFF                      (8)

