Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_COA_LEN          (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_COA_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_COA_OFF          (3)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DLM1_LEN         (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DLM1_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DLM1_OFF         (6)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DLM2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DLM2_LEN         (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DLM2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DLM2_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DLM2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DLM2_OFF         (9)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DMO_LEN          (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DMO_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_DMO_OFF          (0)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_PCM1_LEN         (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_PCM1_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_PCM1_OFF         (7)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.PCM2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_PCM2_LEN         (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.PCM2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_PCM2_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.PCM2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_PCM2_OFF         (10)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_SGE1_LEN         (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_SGE1_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_SGE1_OFF         (5)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_SGE2_LEN         (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_SGE2_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_STATE_SGE2_OFF         (8)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_COA_LEN        (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_COA_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_COA_OFF        (3)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_DLM1_LEN       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_DLM1_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_DLM1_OFF       (6)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_DMO_LEN        (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_DMO_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_DMO_OFF        (0)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_PCM1_LEN       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_PCM1_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_PCM1_OFF       (7)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.PIT */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_PIT_LEN        (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.PIT */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_PIT_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.PIT */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_PIT_OFF        (4)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SGE1_LEN       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SGE1_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_SGE1_OFF       (5)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.SMC */
#define IFX_GTM_DPLL_CTRL_1_SMC_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SMC */
#define IFX_GTM_DPLL_CTRL_1_SMC_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SMC */
#define IFX_GTM_DPLL_CTRL_1_SMC_OFF                       (27)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.SSL */
#define IFX_GTM_DPLL_CTRL_1_SSL_LEN                       (2)

