Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SSL */
#define IFX_GTM_DPLL_CTRL_1_SSL_MSK                       (0x3)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SSL */
#define IFX_GTM_DPLL_CTRL_1_SSL_OFF                       (28)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.SWR */
#define IFX_GTM_DPLL_CTRL_1_SWR_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SWR */
#define IFX_GTM_DPLL_CTRL_1_SWR_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SWR */
#define IFX_GTM_DPLL_CTRL_1_SWR_OFF                       (23)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_1_SYN_NS_LEN                    (5)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_1_SYN_NS_MSK                    (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_1_SYN_NS_OFF                    (11)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NT */
#define IFX_GTM_DPLL_CTRL_1_SYN_NT_LEN                    (6)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NT */
#define IFX_GTM_DPLL_CTRL_1_SYN_NT_MSK                    (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NT */
#define IFX_GTM_DPLL_CTRL_1_SYN_NT_OFF                    (16)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.SYSF */
#define IFX_GTM_DPLL_CTRL_1_SYSF_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SYSF */
#define IFX_GTM_DPLL_CTRL_1_SYSF_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SYSF */
#define IFX_GTM_DPLL_CTRL_1_SYSF_OFF                      (24)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.TS0_HRS */
#define IFX_GTM_DPLL_CTRL_1_TS0_HRS_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.TS0_HRS */
#define IFX_GTM_DPLL_CTRL_1_TS0_HRS_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.TS0_HRS */
#define IFX_GTM_DPLL_CTRL_1_TS0_HRS_OFF                   (25)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.TS0_HRT */
#define IFX_GTM_DPLL_CTRL_1_TS0_HRT_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.TS0_HRT */
#define IFX_GTM_DPLL_CTRL_1_TS0_HRT_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.TS0_HRT */
#define IFX_GTM_DPLL_CTRL_1_TS0_HRT_OFF                   (26)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_1_Bits.TSL */
#define IFX_GTM_DPLL_CTRL_1_TSL_LEN                       (2)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_1_Bits.TSL */
#define IFX_GTM_DPLL_CTRL_1_TSL_MSK                       (0x3)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_1_Bits.TSL */
#define IFX_GTM_DPLL_CTRL_1_TSL_OFF                       (30)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_2_Bits.AEN0 */
#define IFX_GTM_DPLL_CTRL_2_AEN0_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_2_Bits.AEN0 */
#define IFX_GTM_DPLL_CTRL_2_AEN0_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_2_Bits.AEN0 */
#define IFX_GTM_DPLL_CTRL_2_AEN0_OFF                      (8)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_2_Bits.AEN1 */
#define IFX_GTM_DPLL_CTRL_2_AEN1_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_2_Bits.AEN1 */
#define IFX_GTM_DPLL_CTRL_2_AEN1_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_2_Bits.AEN1 */
#define IFX_GTM_DPLL_CTRL_2_AEN1_OFF                      (9)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_2_Bits.AEN2 */
#define IFX_GTM_DPLL_CTRL_2_AEN2_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_2_Bits.AEN2 */
#define IFX_GTM_DPLL_CTRL_2_AEN2_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_2_Bits.AEN2 */
#define IFX_GTM_DPLL_CTRL_2_AEN2_OFF                      (10)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_2_Bits.AEN3 */
#define IFX_GTM_DPLL_CTRL_2_AEN3_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_2_Bits.AEN3 */
#define IFX_GTM_DPLL_CTRL_2_AEN3_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_2_Bits.AEN3 */
#define IFX_GTM_DPLL_CTRL_2_AEN3_OFF                      (11)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_2_Bits.AEN4 */
#define IFX_GTM_DPLL_CTRL_2_AEN4_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_2_Bits.AEN4 */
#define IFX_GTM_DPLL_CTRL_2_AEN4_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_2_Bits.AEN4 */
#define IFX_GTM_DPLL_CTRL_2_AEN4_OFF                      (12)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_2_Bits.AEN5 */
#define IFX_GTM_DPLL_CTRL_2_AEN5_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_2_Bits.AEN5 */
#define IFX_GTM_DPLL_CTRL_2_AEN5_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_2_Bits.AEN5 */
#define IFX_GTM_DPLL_CTRL_2_AEN5_OFF                      (13)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_2_Bits.AEN6 */
#define IFX_GTM_DPLL_CTRL_2_AEN6_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_2_Bits.AEN6 */
#define IFX_GTM_DPLL_CTRL_2_AEN6_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_2_Bits.AEN6 */
#define IFX_GTM_DPLL_CTRL_2_AEN6_OFF                      (14)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_2_Bits.AEN7 */
#define IFX_GTM_DPLL_CTRL_2_AEN7_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_2_Bits.AEN7 */
#define IFX_GTM_DPLL_CTRL_2_AEN7_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_2_Bits.AEN7 */
#define IFX_GTM_DPLL_CTRL_2_AEN7_OFF                      (15)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_2_Bits.WAD0 */
#define IFX_GTM_DPLL_CTRL_2_WAD0_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_2_Bits.WAD0 */
#define IFX_GTM_DPLL_CTRL_2_WAD0_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_2_Bits.WAD0 */
#define IFX_GTM_DPLL_CTRL_2_WAD0_OFF                      (16)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_2_Bits.WAD1 */
#define IFX_GTM_DPLL_CTRL_2_WAD1_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_2_Bits.WAD1 */
#define IFX_GTM_DPLL_CTRL_2_WAD1_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_2_Bits.WAD1 */
#define IFX_GTM_DPLL_CTRL_2_WAD1_OFF                      (17)

