Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_DPLL_CTRL_4_Bits.WAD21 */
#define IFX_GTM_DPLL_CTRL_4_WAD21_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_4_Bits.WAD21 */
#define IFX_GTM_DPLL_CTRL_4_WAD21_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_4_Bits.WAD21 */
#define IFX_GTM_DPLL_CTRL_4_WAD21_OFF                     (21)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_4_Bits.WAD22 */
#define IFX_GTM_DPLL_CTRL_4_WAD22_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_4_Bits.WAD22 */
#define IFX_GTM_DPLL_CTRL_4_WAD22_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_4_Bits.WAD22 */
#define IFX_GTM_DPLL_CTRL_4_WAD22_OFF                     (22)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_4_Bits.WAD23 */
#define IFX_GTM_DPLL_CTRL_4_WAD23_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_4_Bits.WAD23 */
#define IFX_GTM_DPLL_CTRL_4_WAD23_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_4_Bits.WAD23 */
#define IFX_GTM_DPLL_CTRL_4_WAD23_OFF                     (23)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_5_Bits.AEN24 */
#define IFX_GTM_DPLL_CTRL_5_AEN24_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_5_Bits.AEN24 */
#define IFX_GTM_DPLL_CTRL_5_AEN24_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_5_Bits.AEN24 */
#define IFX_GTM_DPLL_CTRL_5_AEN24_OFF                     (8)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_5_Bits.AEN25 */
#define IFX_GTM_DPLL_CTRL_5_AEN25_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_5_Bits.AEN25 */
#define IFX_GTM_DPLL_CTRL_5_AEN25_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_5_Bits.AEN25 */
#define IFX_GTM_DPLL_CTRL_5_AEN25_OFF                     (9)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_5_Bits.AEN26 */
#define IFX_GTM_DPLL_CTRL_5_AEN26_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_5_Bits.AEN26 */
#define IFX_GTM_DPLL_CTRL_5_AEN26_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_5_Bits.AEN26 */
#define IFX_GTM_DPLL_CTRL_5_AEN26_OFF                     (10)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_5_Bits.AEN27 */
#define IFX_GTM_DPLL_CTRL_5_AEN27_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_5_Bits.AEN27 */
#define IFX_GTM_DPLL_CTRL_5_AEN27_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_5_Bits.AEN27 */
#define IFX_GTM_DPLL_CTRL_5_AEN27_OFF                     (11)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_5_Bits.AEN28 */
#define IFX_GTM_DPLL_CTRL_5_AEN28_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_5_Bits.AEN28 */
#define IFX_GTM_DPLL_CTRL_5_AEN28_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_5_Bits.AEN28 */
#define IFX_GTM_DPLL_CTRL_5_AEN28_OFF                     (12)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_5_Bits.AEN29 */
#define IFX_GTM_DPLL_CTRL_5_AEN29_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_5_Bits.AEN29 */
#define IFX_GTM_DPLL_CTRL_5_AEN29_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_5_Bits.AEN29 */
#define IFX_GTM_DPLL_CTRL_5_AEN29_OFF                     (13)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_5_Bits.AEN30 */
#define IFX_GTM_DPLL_CTRL_5_AEN30_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_5_Bits.AEN30 */
#define IFX_GTM_DPLL_CTRL_5_AEN30_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_5_Bits.AEN30 */
#define IFX_GTM_DPLL_CTRL_5_AEN30_OFF                     (14)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_5_Bits.AEN31 */
#define IFX_GTM_DPLL_CTRL_5_AEN31_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_5_Bits.AEN31 */
#define IFX_GTM_DPLL_CTRL_5_AEN31_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_5_Bits.AEN31 */
#define IFX_GTM_DPLL_CTRL_5_AEN31_OFF                     (15)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_5_Bits.WAD24 */
#define IFX_GTM_DPLL_CTRL_5_WAD24_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_5_Bits.WAD24 */
#define IFX_GTM_DPLL_CTRL_5_WAD24_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_5_Bits.WAD24 */
#define IFX_GTM_DPLL_CTRL_5_WAD24_OFF                     (16)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_5_Bits.WAD25 */
#define IFX_GTM_DPLL_CTRL_5_WAD25_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_5_Bits.WAD25 */
#define IFX_GTM_DPLL_CTRL_5_WAD25_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_5_Bits.WAD25 */
#define IFX_GTM_DPLL_CTRL_5_WAD25_OFF                     (17)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_5_Bits.WAD26 */
#define IFX_GTM_DPLL_CTRL_5_WAD26_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_5_Bits.WAD26 */
#define IFX_GTM_DPLL_CTRL_5_WAD26_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_5_Bits.WAD26 */
#define IFX_GTM_DPLL_CTRL_5_WAD26_OFF                     (18)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_5_Bits.WAD27 */
#define IFX_GTM_DPLL_CTRL_5_WAD27_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_5_Bits.WAD27 */
#define IFX_GTM_DPLL_CTRL_5_WAD27_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_5_Bits.WAD27 */
#define IFX_GTM_DPLL_CTRL_5_WAD27_OFF                     (19)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_5_Bits.WAD28 */
#define IFX_GTM_DPLL_CTRL_5_WAD28_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_5_Bits.WAD28 */
#define IFX_GTM_DPLL_CTRL_5_WAD28_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_5_Bits.WAD28 */
#define IFX_GTM_DPLL_CTRL_5_WAD28_OFF                     (20)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_5_Bits.WAD29 */
#define IFX_GTM_DPLL_CTRL_5_WAD29_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_5_Bits.WAD29 */
#define IFX_GTM_DPLL_CTRL_5_WAD29_MSK                     (0x1)

