Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_5_Bits.WAD29 */
#define IFX_GTM_DPLL_CTRL_5_WAD29_OFF                     (21)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_5_Bits.WAD30 */
#define IFX_GTM_DPLL_CTRL_5_WAD30_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_5_Bits.WAD30 */
#define IFX_GTM_DPLL_CTRL_5_WAD30_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_5_Bits.WAD30 */
#define IFX_GTM_DPLL_CTRL_5_WAD30_OFF                     (22)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_5_Bits.WAD31 */
#define IFX_GTM_DPLL_CTRL_5_WAD31_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_5_Bits.WAD31 */
#define IFX_GTM_DPLL_CTRL_5_WAD31_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_5_Bits.WAD31 */
#define IFX_GTM_DPLL_CTRL_5_WAD31_OFF                     (23)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_EXT_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_EXT_SNU_LEN                     (6)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_EXT_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_EXT_SNU_MSK                     (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_EXT_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_EXT_SNU_OFF                     (0)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_EXT_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_EXT_SYN_NS_LEN                  (6)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_EXT_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_EXT_SYN_NS_MSK                  (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_EXT_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_EXT_SYN_NS_OFF                  (16)

/** \\brief  Length for Ifx_GTM_DPLL_DLA_Bits.DLA */
#define IFX_GTM_DPLL_DLA_DLA_LEN                          (24)

/** \\brief  Mask for Ifx_GTM_DPLL_DLA_Bits.DLA */
#define IFX_GTM_DPLL_DLA_DLA_MSK                          (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_DLA_Bits.DLA */
#define IFX_GTM_DPLL_DLA_DLA_OFF                          (0)

/** \\brief  Length for Ifx_GTM_DPLL_DT_S_ACT_Bits.DT_S_ACT */
#define IFX_GTM_DPLL_DT_S_ACT_DT_S_ACT_LEN                (24)

/** \\brief  Mask for Ifx_GTM_DPLL_DT_S_ACT_Bits.DT_S_ACT */
#define IFX_GTM_DPLL_DT_S_ACT_DT_S_ACT_MSK                (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_DT_S_ACT_Bits.DT_S_ACT */
#define IFX_GTM_DPLL_DT_S_ACT_DT_S_ACT_OFF                (0)

/** \\brief  Length for Ifx_GTM_DPLL_DT_S_Bits.DT_S */
#define IFX_GTM_DPLL_DT_S_DT_S_LEN                        (24)

/** \\brief  Mask for Ifx_GTM_DPLL_DT_S_Bits.DT_S */
#define IFX_GTM_DPLL_DT_S_DT_S_MSK                        (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_DT_S_Bits.DT_S */
#define IFX_GTM_DPLL_DT_S_DT_S_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_DT_S_START_Bits.DPLL_DT_S_START */
#define IFX_GTM_DPLL_DT_S_START_DPLL_DT_S_START_LEN       (24)

/** \\brief  Mask for Ifx_GTM_DPLL_DT_S_START_Bits.DPLL_DT_S_START */
#define IFX_GTM_DPLL_DT_S_START_DPLL_DT_S_START_MSK       (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_DT_S_START_Bits.DPLL_DT_S_START */
#define IFX_GTM_DPLL_DT_S_START_DPLL_DT_S_START_OFF       (0)

/** \\brief  Length for Ifx_GTM_DPLL_DT_T_ACT_Bits.DT_T_ACT */
#define IFX_GTM_DPLL_DT_T_ACT_DT_T_ACT_LEN                (24)

/** \\brief  Mask for Ifx_GTM_DPLL_DT_T_ACT_Bits.DT_T_ACT */
#define IFX_GTM_DPLL_DT_T_ACT_DT_T_ACT_MSK                (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_DT_T_ACT_Bits.DT_T_ACT */
#define IFX_GTM_DPLL_DT_T_ACT_DT_T_ACT_OFF                (0)

/** \\brief  Length for Ifx_GTM_DPLL_DT_T_START_Bits.DPLL_DT_T_START */
#define IFX_GTM_DPLL_DT_T_START_DPLL_DT_T_START_LEN       (24)

/** \\brief  Mask for Ifx_GTM_DPLL_DT_T_START_Bits.DPLL_DT_T_START */
#define IFX_GTM_DPLL_DT_T_START_DPLL_DT_T_START_MSK       (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_DT_T_START_Bits.DPLL_DT_T_START */
#define IFX_GTM_DPLL_DT_T_START_DPLL_DT_T_START_OFF       (0)

/** \\brief  Length for Ifx_GTM_DPLL_DTA_Bits.DTA */
#define IFX_GTM_DPLL_DTA_DTA_LEN                          (24)

/** \\brief  Mask for Ifx_GTM_DPLL_DTA_Bits.DTA */
#define IFX_GTM_DPLL_DTA_DTA_MSK                          (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_DTA_Bits.DTA */
#define IFX_GTM_DPLL_DTA_DTA_OFF                          (0)

/** \\brief  Length for Ifx_GTM_DPLL_EDT_S_Bits.EDT_S */
#define IFX_GTM_DPLL_EDT_S_EDT_S_LEN                      (24)

/** \\brief  Mask for Ifx_GTM_DPLL_EDT_S_Bits.EDT_S */
#define IFX_GTM_DPLL_EDT_S_EDT_S_MSK                      (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_EDT_S_Bits.EDT_S */
#define IFX_GTM_DPLL_EDT_S_EDT_S_OFF                      (0)

/** \\brief  Length for Ifx_GTM_DPLL_EDT_T_Bits.EDT_T */
#define IFX_GTM_DPLL_EDT_T_EDT_T_LEN                      (24)

/** \\brief  Mask for Ifx_GTM_DPLL_EDT_T_Bits.EDT_T */
#define IFX_GTM_DPLL_EDT_T_EDT_T_MSK                      (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_EDT_T_Bits.EDT_T */
#define IFX_GTM_DPLL_EDT_T_EDT_T_OFF                      (0)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDSI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDSI_EIRQ_EN_LEN             (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDSI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDSI_EIRQ_EN_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDSI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDSI_EIRQ_EN_OFF             (24)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDTI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDTI_EIRQ_EN_LEN             (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDTI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDTI_EIRQ_EN_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDTI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDTI_EIRQ_EN_OFF             (23)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.DCGI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_DCGI_EIRQ_EN_LEN             (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.DCGI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_DCGI_EIRQ_EN_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.DCGI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_DCGI_EIRQ_EN_OFF             (27)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.EI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_EI_EIRQ_EN_LEN               (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.EI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_EI_EIRQ_EN_MSK               (0x1)

