Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE2I_EIRQ_EN_LEN             (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE2I_EIRQ_EN_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE2I_EIRQ_EN_OFF             (20)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE3I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE3I_EIRQ_EN_LEN             (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE3I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE3I_EIRQ_EN_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE3I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE3I_EIRQ_EN_OFF             (21)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE4I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE4I_EIRQ_EN_LEN             (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE4I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE4I_EIRQ_EN_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE4I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE4I_EIRQ_EN_OFF             (22)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TINI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TINI_EIRQ_EN_LEN             (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TINI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TINI_EIRQ_EN_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TINI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TINI_EIRQ_EN_OFF             (2)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TISI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TISI_EIRQ_EN_LEN             (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TISI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TISI_EIRQ_EN_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TISI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TISI_EIRQ_EN_OFF             (5)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TORI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TORI_EIRQ_EN_LEN             (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TORI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TORI_EIRQ_EN_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TORI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TORI_EIRQ_EN_OFF             (25)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.W1I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_W1I_EIRQ_EN_LEN              (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.W1I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_W1I_EIRQ_EN_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.W1I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_W1I_EIRQ_EN_OFF              (12)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.W2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_W2I_EIRQ_EN_LEN              (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.W2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_W2I_EIRQ_EN_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.W2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_W2I_EIRQ_EN_OFF              (11)

/** \\brief  Length for Ifx_GTM_DPLL_FTV_S_Bits.STATE_FT */
#define IFX_GTM_DPLL_FTV_S_STATE_FT_LEN                   (24)

/** \\brief  Mask for Ifx_GTM_DPLL_FTV_S_Bits.STATE_FT */
#define IFX_GTM_DPLL_FTV_S_STATE_FT_MSK                   (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_FTV_S_Bits.STATE_FT */
#define IFX_GTM_DPLL_FTV_S_STATE_FT_OFF                   (0)

/** \\brief  Length for Ifx_GTM_DPLL_FTV_T_Bits.TRIGGER_FT */
#define IFX_GTM_DPLL_FTV_T_TRIGGER_FT_LEN                 (24)

/** \\brief  Mask for Ifx_GTM_DPLL_FTV_T_Bits.TRIGGER_FT */
#define IFX_GTM_DPLL_FTV_T_TRIGGER_FT_MSK                 (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_FTV_T_Bits.TRIGGER_FT */
#define IFX_GTM_DPLL_FTV_T_TRIGGER_FT_OFF                 (0)

/** \\brief  Length for Ifx_GTM_DPLL_ID_PMTR_Bits.ID_PMTR_X */
#define IFX_GTM_DPLL_ID_PMTR_ID_PMTR_X_LEN                (9)

/** \\brief  Mask for Ifx_GTM_DPLL_ID_PMTR_Bits.ID_PMTR_X */
#define IFX_GTM_DPLL_ID_PMTR_ID_PMTR_X_MSK                (0x1ff)

/** \\brief  Offset for Ifx_GTM_DPLL_ID_PMTR_Bits.ID_PMTR_X */
#define IFX_GTM_DPLL_ID_PMTR_ID_PMTR_X_OFF                (0)

/** \\brief  Length for Ifx_GTM_DPLL_INC_CNT1_Bits.INC_CNT1 */
#define IFX_GTM_DPLL_INC_CNT1_INC_CNT1_LEN                (24)

/** \\brief  Mask for Ifx_GTM_DPLL_INC_CNT1_Bits.INC_CNT1 */
#define IFX_GTM_DPLL_INC_CNT1_INC_CNT1_MSK                (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_INC_CNT1_Bits.INC_CNT1 */
#define IFX_GTM_DPLL_INC_CNT1_INC_CNT1_OFF                (0)

/** \\brief  Length for Ifx_GTM_DPLL_INC_CNT1_MASK_Bits.INC_CNT1_NOTIFY */
#define IFX_GTM_DPLL_INC_CNT1_MASK_INC_CNT1_NOTIFY_LEN    (24)

/** \\brief  Mask for Ifx_GTM_DPLL_INC_CNT1_MASK_Bits.INC_CNT1_NOTIFY */
#define IFX_GTM_DPLL_INC_CNT1_MASK_INC_CNT1_NOTIFY_MSK    (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_INC_CNT1_MASK_Bits.INC_CNT1_NOTIFY */
#define IFX_GTM_DPLL_INC_CNT1_MASK_INC_CNT1_NOTIFY_OFF    (0)

/** \\brief  Length for Ifx_GTM_DPLL_INC_CNT2_Bits.INC_CNT2 */
#define IFX_GTM_DPLL_INC_CNT2_INC_CNT2_LEN                (24)

/** \\brief  Mask for Ifx_GTM_DPLL_INC_CNT2_Bits.INC_CNT2 */
#define IFX_GTM_DPLL_INC_CNT2_INC_CNT2_MSK                (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_INC_CNT2_Bits.INC_CNT2 */
#define IFX_GTM_DPLL_INC_CNT2_INC_CNT2_OFF                (0)

/** \\brief  Length for Ifx_GTM_DPLL_INC_CNT2_MASK_Bits.INC_CNT2_NOTIFY */
#define IFX_GTM_DPLL_INC_CNT2_MASK_INC_CNT2_NOTIFY_LEN    (24)

/** \\brief  Mask for Ifx_GTM_DPLL_INC_CNT2_MASK_Bits.INC_CNT2_NOTIFY */
#define IFX_GTM_DPLL_INC_CNT2_MASK_INC_CNT2_NOTIFY_MSK    (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_INC_CNT2_MASK_Bits.INC_CNT2_NOTIFY */
#define IFX_GTM_DPLL_INC_CNT2_MASK_INC_CNT2_NOTIFY_OFF    (0)

/** \\brief  Length for Ifx_GTM_DPLL_INCF1_OFFSET_Bits.DPLL_INCF1_OFFSET */
#define IFX_GTM_DPLL_INCF1_OFFSET_DPLL_INCF1_OFFSET_LEN   (24)

/** \\brief  Mask for Ifx_GTM_DPLL_INCF1_OFFSET_Bits.DPLL_INCF1_OFFSET */
#define IFX_GTM_DPLL_INCF1_OFFSET_DPLL_INCF1_OFFSET_MSK   (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_INCF1_OFFSET_Bits.DPLL_INCF1_OFFSET */
#define IFX_GTM_DPLL_INCF1_OFFSET_DPLL_INCF1_OFFSET_OFF   (0)

/** \\brief  Length for Ifx_GTM_DPLL_INCF2_OFFSET_Bits.DPLL_INCF2_OFFSET */
#define IFX_GTM_DPLL_INCF2_OFFSET_DPLL_INCF2_OFFSET_LEN   (24)

/** \\brief  Mask for Ifx_GTM_DPLL_INCF2_OFFSET_Bits.DPLL_INCF2_OFFSET */
#define IFX_GTM_DPLL_INCF2_OFFSET_DPLL_INCF2_OFFSET_MSK   (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_INCF2_OFFSET_Bits.DPLL_INCF2_OFFSET */
#define IFX_GTM_DPLL_INCF2_OFFSET_DPLL_INCF2_OFFSET_OFF   (0)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_EN_Bits.CDSI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_CDSI_IRQ_EN_LEN               (1)

