Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TASI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TASI_IRQ_EN_OFF               (9)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TAXI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TAXI_IRQ_EN_LEN               (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TAXI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TAXI_IRQ_EN_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TAXI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TAXI_IRQ_EN_OFF               (3)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TE0I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE0I_IRQ_EN_LEN               (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TE0I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE0I_IRQ_EN_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TE0I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE0I_IRQ_EN_OFF               (18)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TE1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE1I_IRQ_EN_LEN               (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TE1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE1I_IRQ_EN_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TE1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE1I_IRQ_EN_OFF               (19)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TE2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE2I_IRQ_EN_LEN               (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TE2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE2I_IRQ_EN_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TE2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE2I_IRQ_EN_OFF               (20)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TE3I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE3I_IRQ_EN_LEN               (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TE3I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE3I_IRQ_EN_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TE3I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE3I_IRQ_EN_OFF               (21)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TE4I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE4I_IRQ_EN_LEN               (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TE4I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE4I_IRQ_EN_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TE4I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE4I_IRQ_EN_OFF               (22)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TINI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TINI_IRQ_EN_LEN               (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TINI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TINI_IRQ_EN_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TINI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TINI_IRQ_EN_OFF               (2)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TISI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TISI_IRQ_EN_LEN               (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TISI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TISI_IRQ_EN_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TISI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TISI_IRQ_EN_OFF               (5)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TORI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TORI_IRQ_EN_LEN               (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TORI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TORI_IRQ_EN_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TORI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TORI_IRQ_EN_OFF               (25)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_EN_Bits.W1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_W1I_IRQ_EN_LEN                (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.W1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_W1I_IRQ_EN_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.W1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_W1I_IRQ_EN_OFF                (12)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_EN_Bits.W2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_W2I_IRQ_EN_LEN                (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.W2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_W2I_IRQ_EN_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.W2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_W2I_IRQ_EN_OFF                (11)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_CDSI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_CDSI_LEN             (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_CDSI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_CDSI_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_CDSI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_CDSI_OFF             (24)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_CDTI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_CDTI_LEN             (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_CDTI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_CDTI_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_CDTI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_CDTI_OFF             (23)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_DCGI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_DCGI_LEN             (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_DCGI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_DCGI_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_DCGI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_DCGI_OFF             (27)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_EI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_EI_LEN               (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_EI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_EI_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_EI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_EI_OFF               (15)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_GL1I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_GL1I_LEN             (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_GL1I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_GL1I_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_GL1I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_GL1I_OFF             (13)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_GL2I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_GL2I_LEN             (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_GL2I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_GL2I_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_GL2I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_GL2I_OFF             (16)

