Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_DPLL_MPVAL1_Bits.MPVAL1 */
#define IFX_GTM_DPLL_MPVAL1_MPVAL1_MSK                    (0xffff)

/** \\brief  Offset for Ifx_GTM_DPLL_MPVAL1_Bits.MPVAL1 */
#define IFX_GTM_DPLL_MPVAL1_MPVAL1_OFF                    (0)

/** \\brief  Length for Ifx_GTM_DPLL_MPVAL1_Bits.SIX1 */
#define IFX_GTM_DPLL_MPVAL1_SIX1_LEN                      (8)

/** \\brief  Mask for Ifx_GTM_DPLL_MPVAL1_Bits.SIX1 */
#define IFX_GTM_DPLL_MPVAL1_SIX1_MSK                      (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_MPVAL1_Bits.SIX1 */
#define IFX_GTM_DPLL_MPVAL1_SIX1_OFF                      (16)

/** \\brief  Length for Ifx_GTM_DPLL_MPVAL2_Bits.MPVAL2 */
#define IFX_GTM_DPLL_MPVAL2_MPVAL2_LEN                    (16)

/** \\brief  Mask for Ifx_GTM_DPLL_MPVAL2_Bits.MPVAL2 */
#define IFX_GTM_DPLL_MPVAL2_MPVAL2_MSK                    (0xffff)

/** \\brief  Offset for Ifx_GTM_DPLL_MPVAL2_Bits.MPVAL2 */
#define IFX_GTM_DPLL_MPVAL2_MPVAL2_OFF                    (0)

/** \\brief  Length for Ifx_GTM_DPLL_MPVAL2_Bits.SIX2 */
#define IFX_GTM_DPLL_MPVAL2_SIX2_LEN                      (8)

/** \\brief  Mask for Ifx_GTM_DPLL_MPVAL2_Bits.SIX2 */
#define IFX_GTM_DPLL_MPVAL2_SIX2_MSK                      (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_MPVAL2_Bits.SIX2 */
#define IFX_GTM_DPLL_MPVAL2_SIX2_OFF                      (16)

/** \\brief  Length for Ifx_GTM_DPLL_NA_Bits.DB */
#define IFX_GTM_DPLL_NA_DB_LEN                            (10)

/** \\brief  Mask for Ifx_GTM_DPLL_NA_Bits.DB */
#define IFX_GTM_DPLL_NA_DB_MSK                            (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_NA_Bits.DB */
#define IFX_GTM_DPLL_NA_DB_OFF                            (0)

/** \\brief  Length for Ifx_GTM_DPLL_NA_Bits.DW */
#define IFX_GTM_DPLL_NA_DW_LEN                            (10)

/** \\brief  Mask for Ifx_GTM_DPLL_NA_Bits.DW */
#define IFX_GTM_DPLL_NA_DW_MSK                            (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_NA_Bits.DW */
#define IFX_GTM_DPLL_NA_DW_OFF                            (10)

/** \\brief  Length for Ifx_GTM_DPLL_NA_Bits.NOT_USED */
#define IFX_GTM_DPLL_NA_NOT_USED_LEN                      (4)

/** \\brief  Mask for Ifx_GTM_DPLL_NA_Bits.NOT_USED */
#define IFX_GTM_DPLL_NA_NOT_USED_MSK                      (0xf)

/** \\brief  Offset for Ifx_GTM_DPLL_NA_Bits.NOT_USED */
#define IFX_GTM_DPLL_NA_NOT_USED_OFF                      (20)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_S_Bits.NMB_S */
#define IFX_GTM_DPLL_NMB_S_NMB_S_LEN                      (20)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_S_Bits.NMB_S */
#define IFX_GTM_DPLL_NMB_S_NMB_S_MSK                      (0xfffff)

/** \\brief  Offset for Ifx_GTM_DPLL_NMB_S_Bits.NMB_S */
#define IFX_GTM_DPLL_NMB_S_NMB_S_OFF                      (0)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_S_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_S_NOT_USED_LEN                   (4)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_S_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_S_NOT_USED_MSK                   (0xf)

/** \\brief  Offset for Ifx_GTM_DPLL_NMB_S_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_S_NOT_USED_OFF                   (20)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_S_TAR_Bits.NMB_S_TAR */
#define IFX_GTM_DPLL_NMB_S_TAR_NMB_S_TAR_LEN              (20)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_S_TAR_Bits.NMB_S_TAR */
#define IFX_GTM_DPLL_NMB_S_TAR_NMB_S_TAR_MSK              (0xfffff)

/** \\brief  Offset for Ifx_GTM_DPLL_NMB_S_TAR_Bits.NMB_S_TAR */
#define IFX_GTM_DPLL_NMB_S_TAR_NMB_S_TAR_OFF              (0)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_S_TAR_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_S_TAR_NOT_USED_LEN               (4)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_S_TAR_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_S_TAR_NOT_USED_MSK               (0xf)

/** \\brief  Offset for Ifx_GTM_DPLL_NMB_S_TAR_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_S_TAR_NOT_USED_OFF               (20)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_S_TAR_OLD_Bits.NMB_S_TAR_OLD */
#define IFX_GTM_DPLL_NMB_S_TAR_OLD_NMB_S_TAR_OLD_LEN      (20)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_S_TAR_OLD_Bits.NMB_S_TAR_OLD */
#define IFX_GTM_DPLL_NMB_S_TAR_OLD_NMB_S_TAR_OLD_MSK      (0xfffff)

/** \\brief  Offset for Ifx_GTM_DPLL_NMB_S_TAR_OLD_Bits.NMB_S_TAR_OLD */
#define IFX_GTM_DPLL_NMB_S_TAR_OLD_NMB_S_TAR_OLD_OFF      (0)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_S_TAR_OLD_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_S_TAR_OLD_NOT_USED_LEN           (4)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_S_TAR_OLD_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_S_TAR_OLD_NOT_USED_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_DPLL_NMB_S_TAR_OLD_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_S_TAR_OLD_NOT_USED_OFF           (20)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_T_Bits.NMB_T */
#define IFX_GTM_DPLL_NMB_T_NMB_T_LEN                      (16)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_T_Bits.NMB_T */
#define IFX_GTM_DPLL_NMB_T_NMB_T_MSK                      (0xffff)

/** \\brief  Offset for Ifx_GTM_DPLL_NMB_T_Bits.NMB_T */
#define IFX_GTM_DPLL_NMB_T_NMB_T_OFF                      (0)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_T_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_T_NOT_USED_LEN                   (8)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_T_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_T_NOT_USED_MSK                   (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_NMB_T_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_T_NOT_USED_OFF                   (16)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_T_TAR_Bits.NMB_T_TAR */
#define IFX_GTM_DPLL_NMB_T_TAR_NMB_T_TAR_LEN              (16)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_T_TAR_Bits.NMB_T_TAR */
#define IFX_GTM_DPLL_NMB_T_TAR_NMB_T_TAR_MSK              (0xffff)

/** \\brief  Offset for Ifx_GTM_DPLL_NMB_T_TAR_Bits.NMB_T_TAR */
#define IFX_GTM_DPLL_NMB_T_TAR_NMB_T_TAR_OFF              (0)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_T_TAR_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_T_TAR_NOT_USED_LEN               (8)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_T_TAR_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_T_TAR_NOT_USED_MSK               (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_NMB_T_TAR_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_T_TAR_NOT_USED_OFF               (16)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits.NMB_T_TAR_OLD */
#define IFX_GTM_DPLL_NMB_T_TAR_OLD_NMB_T_TAR_OLD_LEN      (16)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits.NMB_T_TAR_OLD */
#define IFX_GTM_DPLL_NMB_T_TAR_OLD_NMB_T_TAR_OLD_MSK      (0xffff)

/** \\brief  Offset for Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits.NMB_T_TAR_OLD */
#define IFX_GTM_DPLL_NMB_T_TAR_OLD_NMB_T_TAR_OLD_OFF      (0)

/** \\brief  Length for Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_T_TAR_OLD_NOT_USED_LEN           (8)

/** \\brief  Mask for Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_T_TAR_OLD_NOT_USED_MSK           (0xff)

