Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits.NOT_USED */
#define IFX_GTM_DPLL_NMB_T_TAR_OLD_NOT_USED_OFF           (16)

/** \\brief  Length for Ifx_GTM_DPLL_NTI_CNT_Bits.NTI_CNT */
#define IFX_GTM_DPLL_NTI_CNT_NTI_CNT_LEN                  (10)

/** \\brief  Mask for Ifx_GTM_DPLL_NTI_CNT_Bits.NTI_CNT */
#define IFX_GTM_DPLL_NTI_CNT_NTI_CNT_MSK                  (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_NTI_CNT_Bits.NTI_CNT */
#define IFX_GTM_DPLL_NTI_CNT_NTI_CNT_OFF                  (0)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_EXT1_Bits.SYN_S */
#define IFX_GTM_DPLL_NUSC_EXT1_SYN_S_LEN                  (7)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_EXT1_Bits.SYN_S */
#define IFX_GTM_DPLL_NUSC_EXT1_SYN_S_MSK                  (0x7f)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_EXT1_Bits.SYN_S */
#define IFX_GTM_DPLL_NUSC_EXT1_SYN_S_OFF                  (0)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_EXT1_Bits.SYN_S_OLD */
#define IFX_GTM_DPLL_NUSC_EXT1_SYN_S_OLD_LEN              (7)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_EXT1_Bits.SYN_S_OLD */
#define IFX_GTM_DPLL_NUSC_EXT1_SYN_S_OLD_MSK              (0x7f)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_EXT1_Bits.SYN_S_OLD */
#define IFX_GTM_DPLL_NUSC_EXT1_SYN_S_OLD_OFF              (16)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_EXT1_Bits.WSYN */
#define IFX_GTM_DPLL_NUSC_EXT1_WSYN_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_EXT1_Bits.WSYN */
#define IFX_GTM_DPLL_NUSC_EXT1_WSYN_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_EXT1_Bits.WSYN */
#define IFX_GTM_DPLL_NUSC_EXT1_WSYN_OFF                   (30)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_EXT2_Bits.FSS */
#define IFX_GTM_DPLL_NUSC_EXT2_FSS_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_EXT2_Bits.FSS */
#define IFX_GTM_DPLL_NUSC_EXT2_FSS_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_EXT2_Bits.FSS */
#define IFX_GTM_DPLL_NUSC_EXT2_FSS_OFF                    (15)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_EXT2_Bits.NUSE */
#define IFX_GTM_DPLL_NUSC_EXT2_NUSE_LEN                   (7)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_EXT2_Bits.NUSE */
#define IFX_GTM_DPLL_NUSC_EXT2_NUSE_MSK                   (0x7f)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_EXT2_Bits.NUSE */
#define IFX_GTM_DPLL_NUSC_EXT2_NUSE_OFF                   (0)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_EXT2_Bits.VSN */
#define IFX_GTM_DPLL_NUSC_EXT2_VSN_LEN                    (7)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_EXT2_Bits.VSN */
#define IFX_GTM_DPLL_NUSC_EXT2_VSN_MSK                    (0x7f)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_EXT2_Bits.VSN */
#define IFX_GTM_DPLL_NUSC_EXT2_VSN_OFF                    (16)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_EXT2_Bits.WNUS */
#define IFX_GTM_DPLL_NUSC_EXT2_WNUS_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_EXT2_Bits.WNUS */
#define IFX_GTM_DPLL_NUSC_EXT2_WNUS_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_EXT2_Bits.WNUS */
#define IFX_GTM_DPLL_NUSC_EXT2_WNUS_OFF                   (29)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_EXT2_Bits.WVSN */
#define IFX_GTM_DPLL_NUSC_EXT2_WVSN_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_EXT2_Bits.WVSN */
#define IFX_GTM_DPLL_NUSC_EXT2_WVSN_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_EXT2_Bits.WVSN */
#define IFX_GTM_DPLL_NUSC_EXT2_WVSN_OFF                   (31)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_Bits.FSS */
#define IFX_GTM_DPLL_NUSC_FSS_LEN                         (1)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.FSS */
#define IFX_GTM_DPLL_NUSC_FSS_MSK                         (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.FSS */
#define IFX_GTM_DPLL_NUSC_FSS_OFF                         (6)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_Bits.NUSE */
#define IFX_GTM_DPLL_NUSC_NUSE_LEN                        (6)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.NUSE */
#define IFX_GTM_DPLL_NUSC_NUSE_MSK                        (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.NUSE */
#define IFX_GTM_DPLL_NUSC_NUSE_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_Bits.SYN_S */
#define IFX_GTM_DPLL_NUSC_SYN_S_LEN                       (6)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.SYN_S */
#define IFX_GTM_DPLL_NUSC_SYN_S_MSK                       (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.SYN_S */
#define IFX_GTM_DPLL_NUSC_SYN_S_OFF                       (7)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_Bits.SYN_S_OLD */
#define IFX_GTM_DPLL_NUSC_SYN_S_OLD_LEN                   (6)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.SYN_S_OLD */
#define IFX_GTM_DPLL_NUSC_SYN_S_OLD_MSK                   (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.SYN_S_OLD */
#define IFX_GTM_DPLL_NUSC_SYN_S_OLD_OFF                   (13)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_Bits.VSN */
#define IFX_GTM_DPLL_NUSC_VSN_LEN                         (6)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.VSN */
#define IFX_GTM_DPLL_NUSC_VSN_MSK                         (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.VSN */
#define IFX_GTM_DPLL_NUSC_VSN_OFF                         (19)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_Bits.WNUS */
#define IFX_GTM_DPLL_NUSC_WNUS_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.WNUS */
#define IFX_GTM_DPLL_NUSC_WNUS_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.WNUS */
#define IFX_GTM_DPLL_NUSC_WNUS_OFF                        (29)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_Bits.WSYN */
#define IFX_GTM_DPLL_NUSC_WSYN_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.WSYN */
#define IFX_GTM_DPLL_NUSC_WSYN_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.WSYN */
#define IFX_GTM_DPLL_NUSC_WSYN_OFF                        (30)

/** \\brief  Length for Ifx_GTM_DPLL_NUSC_Bits.WVSN */
#define IFX_GTM_DPLL_NUSC_WVSN_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_DPLL_NUSC_Bits.WVSN */
#define IFX_GTM_DPLL_NUSC_WVSN_MSK                        (0x1)

