Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_DPLL_NUSC_Bits.WVSN */
#define IFX_GTM_DPLL_NUSC_WVSN_OFF                        (31)

/** \\brief  Length for Ifx_GTM_DPLL_NUTC_Bits.FST */
#define IFX_GTM_DPLL_NUTC_FST_LEN                         (1)

/** \\brief  Mask for Ifx_GTM_DPLL_NUTC_Bits.FST */
#define IFX_GTM_DPLL_NUTC_FST_MSK                         (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_NUTC_Bits.FST */
#define IFX_GTM_DPLL_NUTC_FST_OFF                         (10)

/** \\brief  Length for Ifx_GTM_DPLL_NUTC_Bits.NUTE */
#define IFX_GTM_DPLL_NUTC_NUTE_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_NUTC_Bits.NUTE */
#define IFX_GTM_DPLL_NUTC_NUTE_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_NUTC_Bits.NUTE */
#define IFX_GTM_DPLL_NUTC_NUTE_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_NUTC_Bits.SYN_T */
#define IFX_GTM_DPLL_NUTC_SYN_T_LEN                       (3)

/** \\brief  Mask for Ifx_GTM_DPLL_NUTC_Bits.SYN_T */
#define IFX_GTM_DPLL_NUTC_SYN_T_MSK                       (0x7)

/** \\brief  Offset for Ifx_GTM_DPLL_NUTC_Bits.SYN_T */
#define IFX_GTM_DPLL_NUTC_SYN_T_OFF                       (13)

/** \\brief  Length for Ifx_GTM_DPLL_NUTC_Bits.SYN_T_OLD */
#define IFX_GTM_DPLL_NUTC_SYN_T_OLD_LEN                   (3)

/** \\brief  Mask for Ifx_GTM_DPLL_NUTC_Bits.SYN_T_OLD */
#define IFX_GTM_DPLL_NUTC_SYN_T_OLD_MSK                   (0x7)

/** \\brief  Offset for Ifx_GTM_DPLL_NUTC_Bits.SYN_T_OLD */
#define IFX_GTM_DPLL_NUTC_SYN_T_OLD_OFF                   (16)

/** \\brief  Length for Ifx_GTM_DPLL_NUTC_Bits.VTN */
#define IFX_GTM_DPLL_NUTC_VTN_LEN                         (6)

/** \\brief  Mask for Ifx_GTM_DPLL_NUTC_Bits.VTN */
#define IFX_GTM_DPLL_NUTC_VTN_MSK                         (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_NUTC_Bits.VTN */
#define IFX_GTM_DPLL_NUTC_VTN_OFF                         (19)

/** \\brief  Length for Ifx_GTM_DPLL_NUTC_Bits.WNUT */
#define IFX_GTM_DPLL_NUTC_WNUT_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_DPLL_NUTC_Bits.WNUT */
#define IFX_GTM_DPLL_NUTC_WNUT_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_NUTC_Bits.WNUT */
#define IFX_GTM_DPLL_NUTC_WNUT_OFF                        (29)

/** \\brief  Length for Ifx_GTM_DPLL_NUTC_Bits.WSYN */
#define IFX_GTM_DPLL_NUTC_WSYN_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_DPLL_NUTC_Bits.WSYN */
#define IFX_GTM_DPLL_NUTC_WSYN_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_NUTC_Bits.WSYN */
#define IFX_GTM_DPLL_NUTC_WSYN_OFF                        (30)

/** \\brief  Length for Ifx_GTM_DPLL_NUTC_Bits.WVTN */
#define IFX_GTM_DPLL_NUTC_WVTN_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_DPLL_NUTC_Bits.WVTN */
#define IFX_GTM_DPLL_NUTC_WVTN_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_NUTC_Bits.WVTN */
#define IFX_GTM_DPLL_NUTC_WVTN_OFF                        (31)

/** \\brief  Length for Ifx_GTM_DPLL_OSW_Bits.OSS */
#define IFX_GTM_DPLL_OSW_OSS_LEN                          (2)

/** \\brief  Mask for Ifx_GTM_DPLL_OSW_Bits.OSS */
#define IFX_GTM_DPLL_OSW_OSS_MSK                          (0x3)

/** \\brief  Offset for Ifx_GTM_DPLL_OSW_Bits.OSS */
#define IFX_GTM_DPLL_OSW_OSS_OFF                          (8)

/** \\brief  Length for Ifx_GTM_DPLL_OSW_Bits.SWON_S */
#define IFX_GTM_DPLL_OSW_SWON_S_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_OSW_Bits.SWON_S */
#define IFX_GTM_DPLL_OSW_SWON_S_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_OSW_Bits.SWON_S */
#define IFX_GTM_DPLL_OSW_SWON_S_OFF                       (0)

/** \\brief  Length for Ifx_GTM_DPLL_OSW_Bits.SWON_T */
#define IFX_GTM_DPLL_OSW_SWON_T_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_OSW_Bits.SWON_T */
#define IFX_GTM_DPLL_OSW_SWON_T_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_OSW_Bits.SWON_T */
#define IFX_GTM_DPLL_OSW_SWON_T_OFF                       (1)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_0_Bits.DB */
#define IFX_GTM_DPLL_PDT_0_DB_LEN                         (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_0_Bits.DB */
#define IFX_GTM_DPLL_PDT_0_DB_MSK                         (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_0_Bits.DB */
#define IFX_GTM_DPLL_PDT_0_DB_OFF                         (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_0_Bits.DW */
#define IFX_GTM_DPLL_PDT_0_DW_LEN                         (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_0_Bits.DW */
#define IFX_GTM_DPLL_PDT_0_DW_MSK                         (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_0_Bits.DW */
#define IFX_GTM_DPLL_PDT_0_DW_OFF                         (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_10_Bits.DB */
#define IFX_GTM_DPLL_PDT_10_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_10_Bits.DB */
#define IFX_GTM_DPLL_PDT_10_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_10_Bits.DB */
#define IFX_GTM_DPLL_PDT_10_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_10_Bits.DW */
#define IFX_GTM_DPLL_PDT_10_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_10_Bits.DW */
#define IFX_GTM_DPLL_PDT_10_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_10_Bits.DW */
#define IFX_GTM_DPLL_PDT_10_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_11_Bits.DB */
#define IFX_GTM_DPLL_PDT_11_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_11_Bits.DB */
#define IFX_GTM_DPLL_PDT_11_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_11_Bits.DB */
#define IFX_GTM_DPLL_PDT_11_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_11_Bits.DW */
#define IFX_GTM_DPLL_PDT_11_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_11_Bits.DW */
#define IFX_GTM_DPLL_PDT_11_DW_MSK                        (0x3ff)

