Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_DPLL_PDT_11_Bits.DW */
#define IFX_GTM_DPLL_PDT_11_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_12_Bits.DB */
#define IFX_GTM_DPLL_PDT_12_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_12_Bits.DB */
#define IFX_GTM_DPLL_PDT_12_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_12_Bits.DB */
#define IFX_GTM_DPLL_PDT_12_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_12_Bits.DW */
#define IFX_GTM_DPLL_PDT_12_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_12_Bits.DW */
#define IFX_GTM_DPLL_PDT_12_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_12_Bits.DW */
#define IFX_GTM_DPLL_PDT_12_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_13_Bits.DB */
#define IFX_GTM_DPLL_PDT_13_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_13_Bits.DB */
#define IFX_GTM_DPLL_PDT_13_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_13_Bits.DB */
#define IFX_GTM_DPLL_PDT_13_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_13_Bits.DW */
#define IFX_GTM_DPLL_PDT_13_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_13_Bits.DW */
#define IFX_GTM_DPLL_PDT_13_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_13_Bits.DW */
#define IFX_GTM_DPLL_PDT_13_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_14_Bits.DB */
#define IFX_GTM_DPLL_PDT_14_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_14_Bits.DB */
#define IFX_GTM_DPLL_PDT_14_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_14_Bits.DB */
#define IFX_GTM_DPLL_PDT_14_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_14_Bits.DW */
#define IFX_GTM_DPLL_PDT_14_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_14_Bits.DW */
#define IFX_GTM_DPLL_PDT_14_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_14_Bits.DW */
#define IFX_GTM_DPLL_PDT_14_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_15_Bits.DB */
#define IFX_GTM_DPLL_PDT_15_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_15_Bits.DB */
#define IFX_GTM_DPLL_PDT_15_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_15_Bits.DB */
#define IFX_GTM_DPLL_PDT_15_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_15_Bits.DW */
#define IFX_GTM_DPLL_PDT_15_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_15_Bits.DW */
#define IFX_GTM_DPLL_PDT_15_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_15_Bits.DW */
#define IFX_GTM_DPLL_PDT_15_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_16_Bits.DB */
#define IFX_GTM_DPLL_PDT_16_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_16_Bits.DB */
#define IFX_GTM_DPLL_PDT_16_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_16_Bits.DB */
#define IFX_GTM_DPLL_PDT_16_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_16_Bits.DW */
#define IFX_GTM_DPLL_PDT_16_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_16_Bits.DW */
#define IFX_GTM_DPLL_PDT_16_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_16_Bits.DW */
#define IFX_GTM_DPLL_PDT_16_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_17_Bits.DB */
#define IFX_GTM_DPLL_PDT_17_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_17_Bits.DB */
#define IFX_GTM_DPLL_PDT_17_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_17_Bits.DB */
#define IFX_GTM_DPLL_PDT_17_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_17_Bits.DW */
#define IFX_GTM_DPLL_PDT_17_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_17_Bits.DW */
#define IFX_GTM_DPLL_PDT_17_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_17_Bits.DW */
#define IFX_GTM_DPLL_PDT_17_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_18_Bits.DB */
#define IFX_GTM_DPLL_PDT_18_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_18_Bits.DB */
#define IFX_GTM_DPLL_PDT_18_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_18_Bits.DB */
#define IFX_GTM_DPLL_PDT_18_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_18_Bits.DW */
#define IFX_GTM_DPLL_PDT_18_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_18_Bits.DW */
#define IFX_GTM_DPLL_PDT_18_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_18_Bits.DW */
#define IFX_GTM_DPLL_PDT_18_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_19_Bits.DB */
#define IFX_GTM_DPLL_PDT_19_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_19_Bits.DB */
#define IFX_GTM_DPLL_PDT_19_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_19_Bits.DB */
#define IFX_GTM_DPLL_PDT_19_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_19_Bits.DW */
#define IFX_GTM_DPLL_PDT_19_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_19_Bits.DW */
#define IFX_GTM_DPLL_PDT_19_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_19_Bits.DW */
#define IFX_GTM_DPLL_PDT_19_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_1_Bits.DB */
#define IFX_GTM_DPLL_PDT_1_DB_LEN                         (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_1_Bits.DB */
#define IFX_GTM_DPLL_PDT_1_DB_MSK                         (0x3fff)

