Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_DPLL_PDT_1_Bits.DB */
#define IFX_GTM_DPLL_PDT_1_DB_OFF                         (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_1_Bits.DW */
#define IFX_GTM_DPLL_PDT_1_DW_LEN                         (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_1_Bits.DW */
#define IFX_GTM_DPLL_PDT_1_DW_MSK                         (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_1_Bits.DW */
#define IFX_GTM_DPLL_PDT_1_DW_OFF                         (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_20_Bits.DB */
#define IFX_GTM_DPLL_PDT_20_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_20_Bits.DB */
#define IFX_GTM_DPLL_PDT_20_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_20_Bits.DB */
#define IFX_GTM_DPLL_PDT_20_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_20_Bits.DW */
#define IFX_GTM_DPLL_PDT_20_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_20_Bits.DW */
#define IFX_GTM_DPLL_PDT_20_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_20_Bits.DW */
#define IFX_GTM_DPLL_PDT_20_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_21_Bits.DB */
#define IFX_GTM_DPLL_PDT_21_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_21_Bits.DB */
#define IFX_GTM_DPLL_PDT_21_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_21_Bits.DB */
#define IFX_GTM_DPLL_PDT_21_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_21_Bits.DW */
#define IFX_GTM_DPLL_PDT_21_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_21_Bits.DW */
#define IFX_GTM_DPLL_PDT_21_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_21_Bits.DW */
#define IFX_GTM_DPLL_PDT_21_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_22_Bits.DB */
#define IFX_GTM_DPLL_PDT_22_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_22_Bits.DB */
#define IFX_GTM_DPLL_PDT_22_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_22_Bits.DB */
#define IFX_GTM_DPLL_PDT_22_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_22_Bits.DW */
#define IFX_GTM_DPLL_PDT_22_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_22_Bits.DW */
#define IFX_GTM_DPLL_PDT_22_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_22_Bits.DW */
#define IFX_GTM_DPLL_PDT_22_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_23_Bits.DB */
#define IFX_GTM_DPLL_PDT_23_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_23_Bits.DB */
#define IFX_GTM_DPLL_PDT_23_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_23_Bits.DB */
#define IFX_GTM_DPLL_PDT_23_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_23_Bits.DW */
#define IFX_GTM_DPLL_PDT_23_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_23_Bits.DW */
#define IFX_GTM_DPLL_PDT_23_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_23_Bits.DW */
#define IFX_GTM_DPLL_PDT_23_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_24_Bits.DB */
#define IFX_GTM_DPLL_PDT_24_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_24_Bits.DB */
#define IFX_GTM_DPLL_PDT_24_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_24_Bits.DB */
#define IFX_GTM_DPLL_PDT_24_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_24_Bits.DW */
#define IFX_GTM_DPLL_PDT_24_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_24_Bits.DW */
#define IFX_GTM_DPLL_PDT_24_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_24_Bits.DW */
#define IFX_GTM_DPLL_PDT_24_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_25_Bits.DB */
#define IFX_GTM_DPLL_PDT_25_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_25_Bits.DB */
#define IFX_GTM_DPLL_PDT_25_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_25_Bits.DB */
#define IFX_GTM_DPLL_PDT_25_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_25_Bits.DW */
#define IFX_GTM_DPLL_PDT_25_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_25_Bits.DW */
#define IFX_GTM_DPLL_PDT_25_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_25_Bits.DW */
#define IFX_GTM_DPLL_PDT_25_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_26_Bits.DB */
#define IFX_GTM_DPLL_PDT_26_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_26_Bits.DB */
#define IFX_GTM_DPLL_PDT_26_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_26_Bits.DB */
#define IFX_GTM_DPLL_PDT_26_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_26_Bits.DW */
#define IFX_GTM_DPLL_PDT_26_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_26_Bits.DW */
#define IFX_GTM_DPLL_PDT_26_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_26_Bits.DW */
#define IFX_GTM_DPLL_PDT_26_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_27_Bits.DB */
#define IFX_GTM_DPLL_PDT_27_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_27_Bits.DB */
#define IFX_GTM_DPLL_PDT_27_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_27_Bits.DB */
#define IFX_GTM_DPLL_PDT_27_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_27_Bits.DW */
#define IFX_GTM_DPLL_PDT_27_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_27_Bits.DW */
#define IFX_GTM_DPLL_PDT_27_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_27_Bits.DW */
#define IFX_GTM_DPLL_PDT_27_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_28_Bits.DB */
#define IFX_GTM_DPLL_PDT_28_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_28_Bits.DB */
#define IFX_GTM_DPLL_PDT_28_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_28_Bits.DB */
#define IFX_GTM_DPLL_PDT_28_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_28_Bits.DW */
#define IFX_GTM_DPLL_PDT_28_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_28_Bits.DW */
#define IFX_GTM_DPLL_PDT_28_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_28_Bits.DW */
#define IFX_GTM_DPLL_PDT_28_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_29_Bits.DB */
#define IFX_GTM_DPLL_PDT_29_DB_LEN                        (14)

