Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_DPLL_PDT_29_Bits.DB */
#define IFX_GTM_DPLL_PDT_29_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_29_Bits.DB */
#define IFX_GTM_DPLL_PDT_29_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_29_Bits.DW */
#define IFX_GTM_DPLL_PDT_29_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_29_Bits.DW */
#define IFX_GTM_DPLL_PDT_29_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_29_Bits.DW */
#define IFX_GTM_DPLL_PDT_29_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_2_Bits.DB */
#define IFX_GTM_DPLL_PDT_2_DB_LEN                         (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_2_Bits.DB */
#define IFX_GTM_DPLL_PDT_2_DB_MSK                         (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_2_Bits.DB */
#define IFX_GTM_DPLL_PDT_2_DB_OFF                         (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_2_Bits.DW */
#define IFX_GTM_DPLL_PDT_2_DW_LEN                         (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_2_Bits.DW */
#define IFX_GTM_DPLL_PDT_2_DW_MSK                         (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_2_Bits.DW */
#define IFX_GTM_DPLL_PDT_2_DW_OFF                         (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_30_Bits.DB */
#define IFX_GTM_DPLL_PDT_30_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_30_Bits.DB */
#define IFX_GTM_DPLL_PDT_30_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_30_Bits.DB */
#define IFX_GTM_DPLL_PDT_30_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_30_Bits.DW */
#define IFX_GTM_DPLL_PDT_30_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_30_Bits.DW */
#define IFX_GTM_DPLL_PDT_30_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_30_Bits.DW */
#define IFX_GTM_DPLL_PDT_30_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_31_Bits.DB */
#define IFX_GTM_DPLL_PDT_31_DB_LEN                        (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_31_Bits.DB */
#define IFX_GTM_DPLL_PDT_31_DB_MSK                        (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_31_Bits.DB */
#define IFX_GTM_DPLL_PDT_31_DB_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_31_Bits.DW */
#define IFX_GTM_DPLL_PDT_31_DW_LEN                        (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_31_Bits.DW */
#define IFX_GTM_DPLL_PDT_31_DW_MSK                        (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_31_Bits.DW */
#define IFX_GTM_DPLL_PDT_31_DW_OFF                        (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_3_Bits.DB */
#define IFX_GTM_DPLL_PDT_3_DB_LEN                         (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_3_Bits.DB */
#define IFX_GTM_DPLL_PDT_3_DB_MSK                         (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_3_Bits.DB */
#define IFX_GTM_DPLL_PDT_3_DB_OFF                         (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_3_Bits.DW */
#define IFX_GTM_DPLL_PDT_3_DW_LEN                         (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_3_Bits.DW */
#define IFX_GTM_DPLL_PDT_3_DW_MSK                         (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_3_Bits.DW */
#define IFX_GTM_DPLL_PDT_3_DW_OFF                         (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_4_Bits.DB */
#define IFX_GTM_DPLL_PDT_4_DB_LEN                         (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_4_Bits.DB */
#define IFX_GTM_DPLL_PDT_4_DB_MSK                         (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_4_Bits.DB */
#define IFX_GTM_DPLL_PDT_4_DB_OFF                         (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_4_Bits.DW */
#define IFX_GTM_DPLL_PDT_4_DW_LEN                         (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_4_Bits.DW */
#define IFX_GTM_DPLL_PDT_4_DW_MSK                         (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_4_Bits.DW */
#define IFX_GTM_DPLL_PDT_4_DW_OFF                         (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_5_Bits.DB */
#define IFX_GTM_DPLL_PDT_5_DB_LEN                         (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_5_Bits.DB */
#define IFX_GTM_DPLL_PDT_5_DB_MSK                         (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_5_Bits.DB */
#define IFX_GTM_DPLL_PDT_5_DB_OFF                         (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_5_Bits.DW */
#define IFX_GTM_DPLL_PDT_5_DW_LEN                         (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_5_Bits.DW */
#define IFX_GTM_DPLL_PDT_5_DW_MSK                         (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_5_Bits.DW */
#define IFX_GTM_DPLL_PDT_5_DW_OFF                         (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_6_Bits.DB */
#define IFX_GTM_DPLL_PDT_6_DB_LEN                         (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_6_Bits.DB */
#define IFX_GTM_DPLL_PDT_6_DB_MSK                         (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_6_Bits.DB */
#define IFX_GTM_DPLL_PDT_6_DB_OFF                         (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_6_Bits.DW */
#define IFX_GTM_DPLL_PDT_6_DW_LEN                         (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_6_Bits.DW */
#define IFX_GTM_DPLL_PDT_6_DW_MSK                         (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_6_Bits.DW */
#define IFX_GTM_DPLL_PDT_6_DW_OFF                         (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_7_Bits.DB */
#define IFX_GTM_DPLL_PDT_7_DB_LEN                         (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_7_Bits.DB */
#define IFX_GTM_DPLL_PDT_7_DB_MSK                         (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_7_Bits.DB */
#define IFX_GTM_DPLL_PDT_7_DB_OFF                         (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_7_Bits.DW */
#define IFX_GTM_DPLL_PDT_7_DW_LEN                         (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_7_Bits.DW */
#define IFX_GTM_DPLL_PDT_7_DW_MSK                         (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_7_Bits.DW */
#define IFX_GTM_DPLL_PDT_7_DW_OFF                         (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_8_Bits.DB */
#define IFX_GTM_DPLL_PDT_8_DB_LEN                         (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_8_Bits.DB */
#define IFX_GTM_DPLL_PDT_8_DB_MSK                         (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_8_Bits.DB */
#define IFX_GTM_DPLL_PDT_8_DB_OFF                         (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_8_Bits.DW */
#define IFX_GTM_DPLL_PDT_8_DW_LEN                         (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_8_Bits.DW */
#define IFX_GTM_DPLL_PDT_8_DW_MSK                         (0x3ff)

