Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_DPLL_PDT_8_Bits.DW */
#define IFX_GTM_DPLL_PDT_8_DW_OFF                         (14)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_9_Bits.DB */
#define IFX_GTM_DPLL_PDT_9_DB_LEN                         (14)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_9_Bits.DB */
#define IFX_GTM_DPLL_PDT_9_DB_MSK                         (0x3fff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_9_Bits.DB */
#define IFX_GTM_DPLL_PDT_9_DB_OFF                         (0)

/** \\brief  Length for Ifx_GTM_DPLL_PDT_9_Bits.DW */
#define IFX_GTM_DPLL_PDT_9_DW_LEN                         (10)

/** \\brief  Mask for Ifx_GTM_DPLL_PDT_9_Bits.DW */
#define IFX_GTM_DPLL_PDT_9_DW_MSK                         (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_PDT_9_Bits.DW */
#define IFX_GTM_DPLL_PDT_9_DW_OFF                         (14)

/** \\brief  Length for Ifx_GTM_DPLL_PSA_Bits.PSA */
#define IFX_GTM_DPLL_PSA_PSA_LEN                          (24)

/** \\brief  Mask for Ifx_GTM_DPLL_PSA_Bits.PSA */
#define IFX_GTM_DPLL_PSA_PSA_MSK                          (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_PSA_Bits.PSA */
#define IFX_GTM_DPLL_PSA_PSA_OFF                          (0)

/** \\brief  Length for Ifx_GTM_DPLL_PSAC_Bits.PSAC */
#define IFX_GTM_DPLL_PSAC_PSAC_LEN                        (24)

/** \\brief  Mask for Ifx_GTM_DPLL_PSAC_Bits.PSAC */
#define IFX_GTM_DPLL_PSAC_PSAC_MSK                        (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_PSAC_Bits.PSAC */
#define IFX_GTM_DPLL_PSAC_PSAC_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PSSC_Bits.PSSC */
#define IFX_GTM_DPLL_PSSC_PSSC_LEN                        (24)

/** \\brief  Mask for Ifx_GTM_DPLL_PSSC_Bits.PSSC */
#define IFX_GTM_DPLL_PSSC_PSSC_MSK                        (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_PSSC_Bits.PSSC */
#define IFX_GTM_DPLL_PSSC_PSSC_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PSSM_OLD_Bits.PSSM_OLD */
#define IFX_GTM_DPLL_PSSM_OLD_PSSM_OLD_LEN                (24)

/** \\brief  Mask for Ifx_GTM_DPLL_PSSM_OLD_Bits.PSSM_OLD */
#define IFX_GTM_DPLL_PSSM_OLD_PSSM_OLD_MSK                (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_PSSM_OLD_Bits.PSSM_OLD */
#define IFX_GTM_DPLL_PSSM_OLD_PSSM_OLD_OFF                (0)

/** \\brief  Length for Ifx_GTM_DPLL_PSSM_Bits.PSSM */
#define IFX_GTM_DPLL_PSSM_PSSM_LEN                        (24)

/** \\brief  Mask for Ifx_GTM_DPLL_PSSM_Bits.PSSM */
#define IFX_GTM_DPLL_PSSM_PSSM_MSK                        (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_PSSM_Bits.PSSM */
#define IFX_GTM_DPLL_PSSM_PSSM_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PSTC_Bits.PSTC */
#define IFX_GTM_DPLL_PSTC_PSTC_LEN                        (24)

/** \\brief  Mask for Ifx_GTM_DPLL_PSTC_Bits.PSTC */
#define IFX_GTM_DPLL_PSTC_PSTC_MSK                        (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_PSTC_Bits.PSTC */
#define IFX_GTM_DPLL_PSTC_PSTC_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PSTM_OLD_Bits.PSTM_OLD */
#define IFX_GTM_DPLL_PSTM_OLD_PSTM_OLD_LEN                (24)

/** \\brief  Mask for Ifx_GTM_DPLL_PSTM_OLD_Bits.PSTM_OLD */
#define IFX_GTM_DPLL_PSTM_OLD_PSTM_OLD_MSK                (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_PSTM_OLD_Bits.PSTM_OLD */
#define IFX_GTM_DPLL_PSTM_OLD_PSTM_OLD_OFF                (0)

/** \\brief  Length for Ifx_GTM_DPLL_PSTM_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_PSTM_LEN                        (24)

/** \\brief  Mask for Ifx_GTM_DPLL_PSTM_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_PSTM_MSK                        (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_PSTM_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_PSTM_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_PVT_Bits.PVT */
#define IFX_GTM_DPLL_PVT_PVT_LEN                          (24)

/** \\brief  Mask for Ifx_GTM_DPLL_PVT_Bits.PVT */
#define IFX_GTM_DPLL_PVT_PVT_MSK                          (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_PVT_Bits.PVT */
#define IFX_GTM_DPLL_PVT_PVT_OFF                          (0)

/** \\brief  Length for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1A */
#define IFX_GTM_DPLL_RAM_INI_INIT_1A_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1A */
#define IFX_GTM_DPLL_RAM_INI_INIT_1A_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1A */
#define IFX_GTM_DPLL_RAM_INI_INIT_1A_OFF                  (0)

/** \\brief  Length for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1BC */
#define IFX_GTM_DPLL_RAM_INI_INIT_1BC_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1BC */
#define IFX_GTM_DPLL_RAM_INI_INIT_1BC_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1BC */
#define IFX_GTM_DPLL_RAM_INI_INIT_1BC_OFF                 (1)

/** \\brief  Length for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_2 */
#define IFX_GTM_DPLL_RAM_INI_INIT_2_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_2 */
#define IFX_GTM_DPLL_RAM_INI_INIT_2_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_2 */
#define IFX_GTM_DPLL_RAM_INI_INIT_2_OFF                   (2)

/** \\brief  Length for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_RAM */
#define IFX_GTM_DPLL_RAM_INI_INIT_RAM_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_RAM */
#define IFX_GTM_DPLL_RAM_INI_INIT_RAM_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_RAM */
#define IFX_GTM_DPLL_RAM_INI_INIT_RAM_OFF                 (4)

/** \\brief  Length for Ifx_GTM_DPLL_RCDT_SX_NOM_Bits.RCDT_SX_NOM */
#define IFX_GTM_DPLL_RCDT_SX_NOM_RCDT_SX_NOM_LEN          (24)

/** \\brief  Mask for Ifx_GTM_DPLL_RCDT_SX_NOM_Bits.RCDT_SX_NOM */
#define IFX_GTM_DPLL_RCDT_SX_NOM_RCDT_SX_NOM_MSK          (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_RCDT_SX_NOM_Bits.RCDT_SX_NOM */
#define IFX_GTM_DPLL_RCDT_SX_NOM_RCDT_SX_NOM_OFF          (0)

/** \\brief  Length for Ifx_GTM_DPLL_RCDT_SX_Bits.RCDT_SX */
#define IFX_GTM_DPLL_RCDT_SX_RCDT_SX_LEN                  (24)

