Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_DPLL_RCDT_SX_Bits.RCDT_SX */
#define IFX_GTM_DPLL_RCDT_SX_RCDT_SX_MSK                  (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_RCDT_SX_Bits.RCDT_SX */
#define IFX_GTM_DPLL_RCDT_SX_RCDT_SX_OFF                  (0)

/** \\brief  Length for Ifx_GTM_DPLL_RCDT_TX_NOM_Bits.RCDT_TX_NOM */
#define IFX_GTM_DPLL_RCDT_TX_NOM_RCDT_TX_NOM_LEN          (24)

/** \\brief  Mask for Ifx_GTM_DPLL_RCDT_TX_NOM_Bits.RCDT_TX_NOM */
#define IFX_GTM_DPLL_RCDT_TX_NOM_RCDT_TX_NOM_MSK          (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_RCDT_TX_NOM_Bits.RCDT_TX_NOM */
#define IFX_GTM_DPLL_RCDT_TX_NOM_RCDT_TX_NOM_OFF          (0)

/** \\brief  Length for Ifx_GTM_DPLL_RCDT_TX_Bits.RCDT_TX */
#define IFX_GTM_DPLL_RCDT_TX_RCDT_TX_LEN                  (24)

/** \\brief  Mask for Ifx_GTM_DPLL_RCDT_TX_Bits.RCDT_TX */
#define IFX_GTM_DPLL_RCDT_TX_RCDT_TX_MSK                  (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_RCDT_TX_Bits.RCDT_TX */
#define IFX_GTM_DPLL_RCDT_TX_RCDT_TX_OFF                  (0)

/** \\brief  Length for Ifx_GTM_DPLL_RDT_S_ACT_Bits.RDT_S_ACT */
#define IFX_GTM_DPLL_RDT_S_ACT_RDT_S_ACT_LEN              (24)

/** \\brief  Mask for Ifx_GTM_DPLL_RDT_S_ACT_Bits.RDT_S_ACT */
#define IFX_GTM_DPLL_RDT_S_ACT_RDT_S_ACT_MSK              (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_RDT_S_ACT_Bits.RDT_S_ACT */
#define IFX_GTM_DPLL_RDT_S_ACT_RDT_S_ACT_OFF              (0)

/** \\brief  Length for Ifx_GTM_DPLL_RDT_S_Bits.RDT_S */
#define IFX_GTM_DPLL_RDT_S_RDT_S_LEN                      (24)

/** \\brief  Mask for Ifx_GTM_DPLL_RDT_S_Bits.RDT_S */
#define IFX_GTM_DPLL_RDT_S_RDT_S_MSK                      (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_RDT_S_Bits.RDT_S */
#define IFX_GTM_DPLL_RDT_S_RDT_S_OFF                      (0)

/** \\brief  Length for Ifx_GTM_DPLL_RDT_T_ACT_Bits.RDT_T_ACT */
#define IFX_GTM_DPLL_RDT_T_ACT_RDT_T_ACT_LEN              (24)

/** \\brief  Mask for Ifx_GTM_DPLL_RDT_T_ACT_Bits.RDT_T_ACT */
#define IFX_GTM_DPLL_RDT_T_ACT_RDT_T_ACT_MSK              (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_RDT_T_ACT_Bits.RDT_T_ACT */
#define IFX_GTM_DPLL_RDT_T_ACT_RDT_T_ACT_OFF              (0)

/** \\brief  Length for Ifx_GTM_DPLL_SIDEL_Bits.SIDEL */
#define IFX_GTM_DPLL_SIDEL_SIDEL_LEN                      (24)

/** \\brief  Mask for Ifx_GTM_DPLL_SIDEL_Bits.SIDEL */
#define IFX_GTM_DPLL_SIDEL_SIDEL_MSK                      (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_SIDEL_Bits.SIDEL */
#define IFX_GTM_DPLL_SIDEL_SIDEL_OFF                      (0)

/** \\brief  Length for Ifx_GTM_DPLL_SLR_Bits.NOT_USED */
#define IFX_GTM_DPLL_SLR_NOT_USED_LEN                     (16)

/** \\brief  Mask for Ifx_GTM_DPLL_SLR_Bits.NOT_USED */
#define IFX_GTM_DPLL_SLR_NOT_USED_MSK                     (0xffff)

/** \\brief  Offset for Ifx_GTM_DPLL_SLR_Bits.NOT_USED */
#define IFX_GTM_DPLL_SLR_NOT_USED_OFF                     (8)

/** \\brief  Length for Ifx_GTM_DPLL_SLR_Bits.SLR */
#define IFX_GTM_DPLL_SLR_SLR_LEN                          (8)

/** \\brief  Mask for Ifx_GTM_DPLL_SLR_Bits.SLR */
#define IFX_GTM_DPLL_SLR_SLR_MSK                          (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_SLR_Bits.SLR */
#define IFX_GTM_DPLL_SLR_SLR_OFF                          (0)

/** \\brief  Length for Ifx_GTM_DPLL_STA_Bits.CNT_S */
#define IFX_GTM_DPLL_STA_CNT_S_LEN                        (3)

/** \\brief  Mask for Ifx_GTM_DPLL_STA_Bits.CNT_S */
#define IFX_GTM_DPLL_STA_CNT_S_MSK                        (0x7)

/** \\brief  Offset for Ifx_GTM_DPLL_STA_Bits.CNT_S */
#define IFX_GTM_DPLL_STA_CNT_S_OFF                        (21)

/** \\brief  Length for Ifx_GTM_DPLL_STA_Bits.CNT_T */
#define IFX_GTM_DPLL_STA_CNT_T_LEN                        (3)

/** \\brief  Mask for Ifx_GTM_DPLL_STA_Bits.CNT_T */
#define IFX_GTM_DPLL_STA_CNT_T_MSK                        (0x7)

/** \\brief  Offset for Ifx_GTM_DPLL_STA_Bits.CNT_T */
#define IFX_GTM_DPLL_STA_CNT_T_OFF                        (9)

/** \\brief  Length for Ifx_GTM_DPLL_STA_FLAG_Bits.INC_CNT1_FLAG */
#define IFX_GTM_DPLL_STA_FLAG_INC_CNT1_FLAG_LEN           (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STA_FLAG_Bits.INC_CNT1_FLAG */
#define IFX_GTM_DPLL_STA_FLAG_INC_CNT1_FLAG_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STA_FLAG_Bits.INC_CNT1_FLAG */
#define IFX_GTM_DPLL_STA_FLAG_INC_CNT1_FLAG_OFF           (9)

/** \\brief  Length for Ifx_GTM_DPLL_STA_FLAG_Bits.INC_CNT2_FLAG */
#define IFX_GTM_DPLL_STA_FLAG_INC_CNT2_FLAG_LEN           (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STA_FLAG_Bits.INC_CNT2_FLAG */
#define IFX_GTM_DPLL_STA_FLAG_INC_CNT2_FLAG_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STA_FLAG_Bits.INC_CNT2_FLAG */
#define IFX_GTM_DPLL_STA_FLAG_INC_CNT2_FLAG_OFF           (10)

/** \\brief  Length for Ifx_GTM_DPLL_STA_FLAG_Bits.STA_FLAG_S */
#define IFX_GTM_DPLL_STA_FLAG_STA_FLAG_S_LEN              (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STA_FLAG_Bits.STA_FLAG_S */
#define IFX_GTM_DPLL_STA_FLAG_STA_FLAG_S_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STA_FLAG_Bits.STA_FLAG_S */
#define IFX_GTM_DPLL_STA_FLAG_STA_FLAG_S_OFF              (8)

/** \\brief  Length for Ifx_GTM_DPLL_STA_FLAG_Bits.STA_FLAG_T */
#define IFX_GTM_DPLL_STA_FLAG_STA_FLAG_T_LEN              (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STA_FLAG_Bits.STA_FLAG_T */
#define IFX_GTM_DPLL_STA_FLAG_STA_FLAG_T_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STA_FLAG_Bits.STA_FLAG_T */
#define IFX_GTM_DPLL_STA_FLAG_STA_FLAG_T_OFF              (0)

/** \\brief  Length for Ifx_GTM_DPLL_STA_MASK_Bits.STA_NOTIFY_S */
#define IFX_GTM_DPLL_STA_MASK_STA_NOTIFY_S_LEN            (8)

/** \\brief  Mask for Ifx_GTM_DPLL_STA_MASK_Bits.STA_NOTIFY_S */
#define IFX_GTM_DPLL_STA_MASK_STA_NOTIFY_S_MSK            (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_STA_MASK_Bits.STA_NOTIFY_S */
#define IFX_GTM_DPLL_STA_MASK_STA_NOTIFY_S_OFF            (8)

/** \\brief  Length for Ifx_GTM_DPLL_STA_MASK_Bits.STA_NOTIFY_T */
#define IFX_GTM_DPLL_STA_MASK_STA_NOTIFY_T_LEN            (8)

/** \\brief  Mask for Ifx_GTM_DPLL_STA_MASK_Bits.STA_NOTIFY_T */
#define IFX_GTM_DPLL_STA_MASK_STA_NOTIFY_T_MSK            (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_STA_MASK_Bits.STA_NOTIFY_T */
#define IFX_GTM_DPLL_STA_MASK_STA_NOTIFY_T_OFF            (0)

/** \\brief  Length for Ifx_GTM_DPLL_STA_Bits.STA_S */
#define IFX_GTM_DPLL_STA_STA_S_LEN                        (8)

/** \\brief  Mask for Ifx_GTM_DPLL_STA_Bits.STA_S */
#define IFX_GTM_DPLL_STA_STA_S_MSK                        (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_STA_Bits.STA_S */
#define IFX_GTM_DPLL_STA_STA_S_OFF                        (12)

/** \\brief  Length for Ifx_GTM_DPLL_STA_Bits.STA_T */
#define IFX_GTM_DPLL_STA_STA_T_LEN                        (8)

/** \\brief  Mask for Ifx_GTM_DPLL_STA_Bits.STA_T */
#define IFX_GTM_DPLL_STA_STA_T_MSK                        (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_STA_Bits.STA_T */
#define IFX_GTM_DPLL_STA_STA_T_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.BWD1 */
#define IFX_GTM_DPLL_STATUS_BWD1_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.BWD1 */
#define IFX_GTM_DPLL_STATUS_BWD1_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.BWD1 */
#define IFX_GTM_DPLL_STATUS_BWD1_OFF                      (23)

