Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.LOW_RES */
#define IFX_GTM_DPLL_STATUS_LOW_RES_OFF                   (15)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.MS */
#define IFX_GTM_DPLL_STATUS_MS_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.MS */
#define IFX_GTM_DPLL_STATUS_MS_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.MS */
#define IFX_GTM_DPLL_STATUS_MS_OFF                        (9)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.MT */
#define IFX_GTM_DPLL_STATUS_MT_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.MT */
#define IFX_GTM_DPLL_STATUS_MT_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.MT */
#define IFX_GTM_DPLL_STATUS_MT_OFF                        (11)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.PSE */
#define IFX_GTM_DPLL_STATUS_PSE_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.PSE */
#define IFX_GTM_DPLL_STATUS_PSE_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.PSE */
#define IFX_GTM_DPLL_STATUS_PSE_OFF                       (7)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.RAM2_ERR */
#define IFX_GTM_DPLL_STATUS_RAM2_ERR_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.RAM2_ERR */
#define IFX_GTM_DPLL_STATUS_RAM2_ERR_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.RAM2_ERR */
#define IFX_GTM_DPLL_STATUS_RAM2_ERR_OFF                  (12)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.RCS */
#define IFX_GTM_DPLL_STATUS_RCS_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.RCS */
#define IFX_GTM_DPLL_STATUS_RCS_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.RCS */
#define IFX_GTM_DPLL_STATUS_RCS_OFF                       (5)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.RCT */
#define IFX_GTM_DPLL_STATUS_RCT_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.RCT */
#define IFX_GTM_DPLL_STATUS_RCT_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.RCT */
#define IFX_GTM_DPLL_STATUS_RCT_OFF                       (6)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.SOR */
#define IFX_GTM_DPLL_STATUS_SOR_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.SOR */
#define IFX_GTM_DPLL_STATUS_SOR_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.SOR */
#define IFX_GTM_DPLL_STATUS_SOR_OFF                       (8)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.SYS */
#define IFX_GTM_DPLL_STATUS_SYS_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.SYS */
#define IFX_GTM_DPLL_STATUS_SYS_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.SYS */
#define IFX_GTM_DPLL_STATUS_SYS_OFF                       (26)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.SYT */
#define IFX_GTM_DPLL_STATUS_SYT_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.SYT */
#define IFX_GTM_DPLL_STATUS_SYT_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.SYT */
#define IFX_GTM_DPLL_STATUS_SYT_OFF                       (27)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.TOR */
#define IFX_GTM_DPLL_STATUS_TOR_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.TOR */
#define IFX_GTM_DPLL_STATUS_TOR_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.TOR */
#define IFX_GTM_DPLL_STATUS_TOR_OFF                       (10)

/** \\brief  Length for Ifx_GTM_DPLL_TBU_TS0_S_Bits.TBU_TS0_S */
#define IFX_GTM_DPLL_TBU_TS0_S_TBU_TS0_S_LEN              (24)

/** \\brief  Mask for Ifx_GTM_DPLL_TBU_TS0_S_Bits.TBU_TS0_S */
#define IFX_GTM_DPLL_TBU_TS0_S_TBU_TS0_S_MSK              (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_TBU_TS0_S_Bits.TBU_TS0_S */
#define IFX_GTM_DPLL_TBU_TS0_S_TBU_TS0_S_OFF              (0)

/** \\brief  Length for Ifx_GTM_DPLL_TBU_TS0_T_Bits.TBU_TS0_T */
#define IFX_GTM_DPLL_TBU_TS0_T_TBU_TS0_T_LEN              (24)

/** \\brief  Mask for Ifx_GTM_DPLL_TBU_TS0_T_Bits.TBU_TS0_T */
#define IFX_GTM_DPLL_TBU_TS0_T_TBU_TS0_T_MSK              (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_TBU_TS0_T_Bits.TBU_TS0_T */
#define IFX_GTM_DPLL_TBU_TS0_T_TBU_TS0_T_OFF              (0)

/** \\brief  Length for Ifx_GTM_DPLL_THMA_Bits.NOT_USED */
#define IFX_GTM_DPLL_THMA_NOT_USED_LEN                    (8)

/** \\brief  Mask for Ifx_GTM_DPLL_THMA_Bits.NOT_USED */
#define IFX_GTM_DPLL_THMA_NOT_USED_MSK                    (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_THMA_Bits.NOT_USED */
#define IFX_GTM_DPLL_THMA_NOT_USED_OFF                    (16)

/** \\brief  Length for Ifx_GTM_DPLL_THMA_Bits.THMA */
#define IFX_GTM_DPLL_THMA_THMA_LEN                        (16)

/** \\brief  Mask for Ifx_GTM_DPLL_THMA_Bits.THMA */
#define IFX_GTM_DPLL_THMA_THMA_MSK                        (0xffff)

/** \\brief  Offset for Ifx_GTM_DPLL_THMA_Bits.THMA */
#define IFX_GTM_DPLL_THMA_THMA_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_THMI_Bits.NOT_USED */
#define IFX_GTM_DPLL_THMI_NOT_USED_LEN                    (8)

/** \\brief  Mask for Ifx_GTM_DPLL_THMI_Bits.NOT_USED */
#define IFX_GTM_DPLL_THMI_NOT_USED_MSK                    (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_THMI_Bits.NOT_USED */
#define IFX_GTM_DPLL_THMI_NOT_USED_OFF                    (16)

/** \\brief  Length for Ifx_GTM_DPLL_THMI_Bits.THMI */
#define IFX_GTM_DPLL_THMI_THMI_LEN                        (16)

/** \\brief  Mask for Ifx_GTM_DPLL_THMI_Bits.THMI */
#define IFX_GTM_DPLL_THMI_THMI_MSK                        (0xffff)

/** \\brief  Offset for Ifx_GTM_DPLL_THMI_Bits.THMI */
#define IFX_GTM_DPLL_THMI_THMI_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_THVAL2_Bits.THVAL */
#define IFX_GTM_DPLL_THVAL2_THVAL_LEN                     (24)

