Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_DPLL_THVAL2_Bits.THVAL */
#define IFX_GTM_DPLL_THVAL2_THVAL_MSK                     (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_THVAL2_Bits.THVAL */
#define IFX_GTM_DPLL_THVAL2_THVAL_OFF                     (0)

/** \\brief  Length for Ifx_GTM_DPLL_THVAL_Bits.THVAL */
#define IFX_GTM_DPLL_THVAL_THVAL_LEN                      (24)

/** \\brief  Mask for Ifx_GTM_DPLL_THVAL_Bits.THVAL */
#define IFX_GTM_DPLL_THVAL_THVAL_MSK                      (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_THVAL_Bits.THVAL */
#define IFX_GTM_DPLL_THVAL_THVAL_OFF                      (0)

/** \\brief  Length for Ifx_GTM_DPLL_TIDEL_Bits.TIDEL */
#define IFX_GTM_DPLL_TIDEL_TIDEL_LEN                      (24)

/** \\brief  Mask for Ifx_GTM_DPLL_TIDEL_Bits.TIDEL */
#define IFX_GTM_DPLL_TIDEL_TIDEL_MSK                      (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_TIDEL_Bits.TIDEL */
#define IFX_GTM_DPLL_TIDEL_TIDEL_OFF                      (0)

/** \\brief  Length for Ifx_GTM_DPLL_TLR_Bits.NOT_USED */
#define IFX_GTM_DPLL_TLR_NOT_USED_LEN                     (16)

/** \\brief  Mask for Ifx_GTM_DPLL_TLR_Bits.NOT_USED */
#define IFX_GTM_DPLL_TLR_NOT_USED_MSK                     (0xffff)

/** \\brief  Offset for Ifx_GTM_DPLL_TLR_Bits.NOT_USED */
#define IFX_GTM_DPLL_TLR_NOT_USED_OFF                     (8)

/** \\brief  Length for Ifx_GTM_DPLL_TLR_Bits.TLR */
#define IFX_GTM_DPLL_TLR_TLR_LEN                          (8)

/** \\brief  Mask for Ifx_GTM_DPLL_TLR_Bits.TLR */
#define IFX_GTM_DPLL_TLR_TLR_MSK                          (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_TLR_Bits.TLR */
#define IFX_GTM_DPLL_TLR_TLR_OFF                          (0)

/** \\brief  Length for Ifx_GTM_DPLL_TOV_Bits.NOT_USED */
#define IFX_GTM_DPLL_TOV_NOT_USED_LEN                     (8)

/** \\brief  Mask for Ifx_GTM_DPLL_TOV_Bits.NOT_USED */
#define IFX_GTM_DPLL_TOV_NOT_USED_MSK                     (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_TOV_Bits.NOT_USED */
#define IFX_GTM_DPLL_TOV_NOT_USED_OFF                     (16)

/** \\brief  Length for Ifx_GTM_DPLL_TOV_S_Bits.DB */
#define IFX_GTM_DPLL_TOV_S_DB_LEN                         (10)

/** \\brief  Mask for Ifx_GTM_DPLL_TOV_S_Bits.DB */
#define IFX_GTM_DPLL_TOV_S_DB_MSK                         (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_TOV_S_Bits.DB */
#define IFX_GTM_DPLL_TOV_S_DB_OFF                         (0)

/** \\brief  Length for Ifx_GTM_DPLL_TOV_S_Bits.DW */
#define IFX_GTM_DPLL_TOV_S_DW_LEN                         (6)

/** \\brief  Mask for Ifx_GTM_DPLL_TOV_S_Bits.DW */
#define IFX_GTM_DPLL_TOV_S_DW_MSK                         (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_TOV_S_Bits.DW */
#define IFX_GTM_DPLL_TOV_S_DW_OFF                         (10)

/** \\brief  Length for Ifx_GTM_DPLL_TOV_S_Bits.NOT_USED */
#define IFX_GTM_DPLL_TOV_S_NOT_USED_LEN                   (8)

/** \\brief  Mask for Ifx_GTM_DPLL_TOV_S_Bits.NOT_USED */
#define IFX_GTM_DPLL_TOV_S_NOT_USED_MSK                   (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_TOV_S_Bits.NOT_USED */
#define IFX_GTM_DPLL_TOV_S_NOT_USED_OFF                   (16)

/** \\brief  Length for Ifx_GTM_DPLL_TOV_Bits.TOV_DB */
#define IFX_GTM_DPLL_TOV_TOV_DB_LEN                       (10)

/** \\brief  Mask for Ifx_GTM_DPLL_TOV_Bits.TOV_DB */
#define IFX_GTM_DPLL_TOV_TOV_DB_MSK                       (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_TOV_Bits.TOV_DB */
#define IFX_GTM_DPLL_TOV_TOV_DB_OFF                       (0)

/** \\brief  Length for Ifx_GTM_DPLL_TOV_Bits.TOV_DW */
#define IFX_GTM_DPLL_TOV_TOV_DW_LEN                       (6)

/** \\brief  Mask for Ifx_GTM_DPLL_TOV_Bits.TOV_DW */
#define IFX_GTM_DPLL_TOV_TOV_DW_MSK                       (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_TOV_Bits.TOV_DW */
#define IFX_GTM_DPLL_TOV_TOV_DW_OFF                       (10)

/** \\brief  Length for Ifx_GTM_DPLL_TS_S_OLD_Bits.STATE_TS_OLD */
#define IFX_GTM_DPLL_TS_S_OLD_STATE_TS_OLD_LEN            (24)

/** \\brief  Mask for Ifx_GTM_DPLL_TS_S_OLD_Bits.STATE_TS_OLD */
#define IFX_GTM_DPLL_TS_S_OLD_STATE_TS_OLD_MSK            (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_TS_S_OLD_Bits.STATE_TS_OLD */
#define IFX_GTM_DPLL_TS_S_OLD_STATE_TS_OLD_OFF            (0)

/** \\brief  Length for Ifx_GTM_DPLL_TS_S_Bits.STATE_TS */
#define IFX_GTM_DPLL_TS_S_STATE_TS_LEN                    (24)

/** \\brief  Mask for Ifx_GTM_DPLL_TS_S_Bits.STATE_TS */
#define IFX_GTM_DPLL_TS_S_STATE_TS_MSK                    (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_TS_S_Bits.STATE_TS */
#define IFX_GTM_DPLL_TS_S_STATE_TS_OFF                    (0)

/** \\brief  Length for Ifx_GTM_DPLL_TS_T_OLD_Bits.TRIGGER_TS_OLD */
#define IFX_GTM_DPLL_TS_T_OLD_TRIGGER_TS_OLD_LEN          (24)

/** \\brief  Mask for Ifx_GTM_DPLL_TS_T_OLD_Bits.TRIGGER_TS_OLD */
#define IFX_GTM_DPLL_TS_T_OLD_TRIGGER_TS_OLD_MSK          (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_TS_T_OLD_Bits.TRIGGER_TS_OLD */
#define IFX_GTM_DPLL_TS_T_OLD_TRIGGER_TS_OLD_OFF          (0)

/** \\brief  Length for Ifx_GTM_DPLL_TS_T_Bits.TRIGGER_TS */
#define IFX_GTM_DPLL_TS_T_TRIGGER_TS_LEN                  (24)

/** \\brief  Mask for Ifx_GTM_DPLL_TS_T_Bits.TRIGGER_TS */
#define IFX_GTM_DPLL_TS_T_TRIGGER_TS_MSK                  (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_TS_T_Bits.TRIGGER_TS */
#define IFX_GTM_DPLL_TS_T_TRIGGER_TS_OFF                  (0)

/** \\brief  Length for Ifx_GTM_DPLL_TSAC_Bits.TSAC */
#define IFX_GTM_DPLL_TSAC_TSAC_LEN                        (24)

/** \\brief  Mask for Ifx_GTM_DPLL_TSAC_Bits.TSAC */
#define IFX_GTM_DPLL_TSAC_TSAC_MSK                        (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_TSAC_Bits.TSAC */
#define IFX_GTM_DPLL_TSAC_TSAC_OFF                        (0)

/** \\brief  Length for Ifx_GTM_DPLL_TSF_S_Bits.TSF_S */
#define IFX_GTM_DPLL_TSF_S_TSF_S_LEN                      (24)

/** \\brief  Mask for Ifx_GTM_DPLL_TSF_S_Bits.TSF_S */
#define IFX_GTM_DPLL_TSF_S_TSF_S_MSK                      (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_TSF_S_Bits.TSF_S */
#define IFX_GTM_DPLL_TSF_S_TSF_S_OFF                      (0)

/** \\brief  Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL0 */
#define IFX_GTM_DTMAUXINSEL_ASEL0_LEN                     (2)

/** \\brief  Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL0 */
#define IFX_GTM_DTMAUXINSEL_ASEL0_MSK                     (0x3)

/** \\brief  Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL0 */
#define IFX_GTM_DTMAUXINSEL_ASEL0_OFF                     (0)

/** \\brief  Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL1 */
#define IFX_GTM_DTMAUXINSEL_ASEL1_LEN                     (2)

