Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL1 */
#define IFX_GTM_DTMAUXINSEL_ASEL1_MSK                     (0x3)

/** \\brief  Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL1 */
#define IFX_GTM_DTMAUXINSEL_ASEL1_OFF                     (2)

/** \\brief  Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL2 */
#define IFX_GTM_DTMAUXINSEL_ASEL2_LEN                     (2)

/** \\brief  Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL2 */
#define IFX_GTM_DTMAUXINSEL_ASEL2_MSK                     (0x3)

/** \\brief  Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL2 */
#define IFX_GTM_DTMAUXINSEL_ASEL2_OFF                     (4)

/** \\brief  Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL3 */
#define IFX_GTM_DTMAUXINSEL_ASEL3_LEN                     (2)

/** \\brief  Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL3 */
#define IFX_GTM_DTMAUXINSEL_ASEL3_MSK                     (0x3)

/** \\brief  Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL3 */
#define IFX_GTM_DTMAUXINSEL_ASEL3_OFF                     (6)

/** \\brief  Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL4 */
#define IFX_GTM_DTMAUXINSEL_ASEL4_LEN                     (2)

/** \\brief  Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL4 */
#define IFX_GTM_DTMAUXINSEL_ASEL4_MSK                     (0x3)

/** \\brief  Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL4 */
#define IFX_GTM_DTMAUXINSEL_ASEL4_OFF                     (8)

/** \\brief  Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL5 */
#define IFX_GTM_DTMAUXINSEL_ASEL5_LEN                     (2)

/** \\brief  Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL5 */
#define IFX_GTM_DTMAUXINSEL_ASEL5_MSK                     (0x3)

/** \\brief  Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL5 */
#define IFX_GTM_DTMAUXINSEL_ASEL5_OFF                     (10)

/** \\brief  Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL6 */
#define IFX_GTM_DTMAUXINSEL_ASEL6_LEN                     (2)

/** \\brief  Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL6 */
#define IFX_GTM_DTMAUXINSEL_ASEL6_MSK                     (0x3)

/** \\brief  Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL6 */
#define IFX_GTM_DTMAUXINSEL_ASEL6_OFF                     (12)

/** \\brief  Length for Ifx_GTM_DTMAUXINSEL_Bits.TSEL0 */
#define IFX_GTM_DTMAUXINSEL_TSEL0_LEN                     (2)

/** \\brief  Mask for Ifx_GTM_DTMAUXINSEL_Bits.TSEL0 */
#define IFX_GTM_DTMAUXINSEL_TSEL0_MSK                     (0x3)

/** \\brief  Offset for Ifx_GTM_DTMAUXINSEL_Bits.TSEL0 */
#define IFX_GTM_DTMAUXINSEL_TSEL0_OFF                     (16)

/** \\brief  Length for Ifx_GTM_DTMAUXINSEL_Bits.TSEL1 */
#define IFX_GTM_DTMAUXINSEL_TSEL1_LEN                     (2)

/** \\brief  Mask for Ifx_GTM_DTMAUXINSEL_Bits.TSEL1 */
#define IFX_GTM_DTMAUXINSEL_TSEL1_MSK                     (0x3)

/** \\brief  Offset for Ifx_GTM_DTMAUXINSEL_Bits.TSEL1 */
#define IFX_GTM_DTMAUXINSEL_TSEL1_OFF                     (18)

/** \\brief  Length for Ifx_GTM_DTMAUXINSEL_Bits.TSEL2 */
#define IFX_GTM_DTMAUXINSEL_TSEL2_LEN                     (2)

/** \\brief  Mask for Ifx_GTM_DTMAUXINSEL_Bits.TSEL2 */
#define IFX_GTM_DTMAUXINSEL_TSEL2_MSK                     (0x3)

/** \\brief  Offset for Ifx_GTM_DTMAUXINSEL_Bits.TSEL2 */
#define IFX_GTM_DTMAUXINSEL_TSEL2_OFF                     (20)

/** \\brief  Length for Ifx_GTM_DTMAUXINSEL_Bits.TSEL3 */
#define IFX_GTM_DTMAUXINSEL_TSEL3_LEN                     (2)

/** \\brief  Mask for Ifx_GTM_DTMAUXINSEL_Bits.TSEL3 */
#define IFX_GTM_DTMAUXINSEL_TSEL3_MSK                     (0x3)

/** \\brief  Offset for Ifx_GTM_DTMAUXINSEL_Bits.TSEL3 */
#define IFX_GTM_DTMAUXINSEL_TSEL3_OFF                     (22)

/** \\brief  Length for Ifx_GTM_DTMAUXINSEL_Bits.TSEL4 */
#define IFX_GTM_DTMAUXINSEL_TSEL4_LEN                     (2)

/** \\brief  Mask for Ifx_GTM_DTMAUXINSEL_Bits.TSEL4 */
#define IFX_GTM_DTMAUXINSEL_TSEL4_MSK                     (0x3)

/** \\brief  Offset for Ifx_GTM_DTMAUXINSEL_Bits.TSEL4 */
#define IFX_GTM_DTMAUXINSEL_TSEL4_OFF                     (24)

/** \\brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_LEN           (1)

/** \\brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_OFF           (2)

/** \\brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_LEN            (1)

/** \\brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_OFF            (0)

/** \\brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_LEN          (1)

/** \\brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_OFF          (1)

/** \\brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_LEN            (1)

/** \\brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_OFF            (3)

/** \\brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEIM_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_IM_ADDR_EIRQ_EN_LEN          (1)

/** \\brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEIM_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_IM_ADDR_EIRQ_EN_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEIM_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_IM_ADDR_EIRQ_EN_OFF          (5)

/** \\brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEIM_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_USP_ADDR_EIRQ_EN_LEN         (1)

/** \\brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEIM_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_USP_ADDR_EIRQ_EN_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEIM_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_USP_ADDR_EIRQ_EN_OFF         (4)

/** \\brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEIM_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_USP_BE_EIRQ_EN_LEN           (1)

/** \\brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEIM_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_USP_BE_EIRQ_EN_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEIM_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_USP_BE_EIRQ_EN_OFF           (6)

/** \\brief  Length for Ifx_GTM_EIRQ_EN_Bits.CLK_EN_ERR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_CLK_EN_ERR_EIRQ_EN_LEN            (1)

/** \\brief  Mask for Ifx_GTM_EIRQ_EN_Bits.CLK_EN_ERR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_CLK_EN_ERR_EIRQ_EN_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_EIRQ_EN_Bits.CLK_EN_ERR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_CLK_EN_ERR_EIRQ_EN_OFF            (7)

/** \\brief  Length for Ifx_GTM_EIRQ_EN_Bits.CLK_PER_ERR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_CLK_PER_ERR_EIRQ_EN_LEN           (1)

/** \\brief  Mask for Ifx_GTM_EIRQ_EN_Bits.CLK_PER_ERR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_CLK_PER_ERR_EIRQ_EN_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_EIRQ_EN_Bits.CLK_PER_ERR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_CLK_PER_ERR_EIRQ_EN_OFF           (8)

/** \\brief  Length for Ifx_GTM_EXT_CAP_EN_Bits.TIM_I_EXT_CAP_EN */
#define IFX_GTM_EXT_CAP_EN_TIM_I_EXT_CAP_EN_LEN           (8)

/** \\brief  Mask for Ifx_GTM_EXT_CAP_EN_Bits.TIM_I_EXT_CAP_EN */
#define IFX_GTM_EXT_CAP_EN_TIM_I_EXT_CAP_EN_MSK           (0xff)

