Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_EXT_CAP_EN_Bits.TIM_I_EXT_CAP_EN */
#define IFX_GTM_EXT_CAP_EN_TIM_I_EXT_CAP_EN_OFF           (0)

/** \\brief  Length for Ifx_GTM_EXT_CAP_EN_Bits.TIM_IP1_EXT_CAP_EN */
#define IFX_GTM_EXT_CAP_EN_TIM_IP1_EXT_CAP_EN_LEN         (8)

/** \\brief  Mask for Ifx_GTM_EXT_CAP_EN_Bits.TIM_IP1_EXT_CAP_EN */
#define IFX_GTM_EXT_CAP_EN_TIM_IP1_EXT_CAP_EN_MSK         (0xff)

/** \\brief  Offset for Ifx_GTM_EXT_CAP_EN_Bits.TIM_IP1_EXT_CAP_EN */
#define IFX_GTM_EXT_CAP_EN_TIM_IP1_EXT_CAP_EN_OFF         (8)

/** \\brief  Length for Ifx_GTM_F2A_CTRL_Bits.STR4_CONF */
#define IFX_GTM_F2A_CTRL_STR4_CONF_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_F2A_CTRL_Bits.STR4_CONF */
#define IFX_GTM_F2A_CTRL_STR4_CONF_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_CTRL_Bits.STR4_CONF */
#define IFX_GTM_F2A_CTRL_STR4_CONF_OFF                    (0)

/** \\brief  Length for Ifx_GTM_F2A_CTRL_Bits.STR5_CONF */
#define IFX_GTM_F2A_CTRL_STR5_CONF_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_F2A_CTRL_Bits.STR5_CONF */
#define IFX_GTM_F2A_CTRL_STR5_CONF_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_CTRL_Bits.STR5_CONF */
#define IFX_GTM_F2A_CTRL_STR5_CONF_OFF                    (2)

/** \\brief  Length for Ifx_GTM_F2A_CTRL_Bits.STR6_CONF */
#define IFX_GTM_F2A_CTRL_STR6_CONF_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_F2A_CTRL_Bits.STR6_CONF */
#define IFX_GTM_F2A_CTRL_STR6_CONF_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_CTRL_Bits.STR6_CONF */
#define IFX_GTM_F2A_CTRL_STR6_CONF_OFF                    (4)

/** \\brief  Length for Ifx_GTM_F2A_CTRL_Bits.STR7_CONF */
#define IFX_GTM_F2A_CTRL_STR7_CONF_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_F2A_CTRL_Bits.STR7_CONF */
#define IFX_GTM_F2A_CTRL_STR7_CONF_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_CTRL_Bits.STR7_CONF */
#define IFX_GTM_F2A_CTRL_STR7_CONF_OFF                    (6)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR0_EN */
#define IFX_GTM_F2A_ENABLE_STR0_EN_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR0_EN */
#define IFX_GTM_F2A_ENABLE_STR0_EN_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR0_EN */
#define IFX_GTM_F2A_ENABLE_STR0_EN_OFF                    (0)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_F2A_ENABLE_STR1_EN_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_F2A_ENABLE_STR1_EN_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_F2A_ENABLE_STR1_EN_OFF                    (2)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_F2A_ENABLE_STR2_EN_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_F2A_ENABLE_STR2_EN_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_F2A_ENABLE_STR2_EN_OFF                    (4)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_F2A_ENABLE_STR3_EN_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_F2A_ENABLE_STR3_EN_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_F2A_ENABLE_STR3_EN_OFF                    (6)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_F2A_ENABLE_STR4_EN_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_F2A_ENABLE_STR4_EN_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_F2A_ENABLE_STR4_EN_OFF                    (8)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_F2A_ENABLE_STR5_EN_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_F2A_ENABLE_STR5_EN_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_F2A_ENABLE_STR5_EN_OFF                    (10)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_F2A_ENABLE_STR6_EN_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_F2A_ENABLE_STR6_EN_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_F2A_ENABLE_STR6_EN_OFF                    (12)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_F2A_ENABLE_STR7_EN_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_F2A_ENABLE_STR7_EN_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_F2A_ENABLE_STR7_EN_OFF                    (14)

/** \\brief  Length for Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO_Bits.ADDR */
#define IFX_GTM_F2A_RD_CH_ARU_RD_FIFO_ADDR_LEN            (9)

/** \\brief  Mask for Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO_Bits.ADDR */
#define IFX_GTM_F2A_RD_CH_ARU_RD_FIFO_ADDR_MSK            (0x1ff)

/** \\brief  Offset for Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO_Bits.ADDR */
#define IFX_GTM_F2A_RD_CH_ARU_RD_FIFO_ADDR_OFF            (0)

/** \\brief  Length for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.DIR */
#define IFX_GTM_F2A_STR_CH_STR_CFG_DIR_LEN                (1)

/** \\brief  Mask for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.DIR */
#define IFX_GTM_F2A_STR_CH_STR_CFG_DIR_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.DIR */
#define IFX_GTM_F2A_STR_CH_STR_CFG_DIR_OFF                (18)

/** \\brief  Length for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.TMODE */
#define IFX_GTM_F2A_STR_CH_STR_CFG_TMODE_LEN              (2)

/** \\brief  Mask for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.TMODE */
#define IFX_GTM_F2A_STR_CH_STR_CFG_TMODE_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.TMODE */
#define IFX_GTM_F2A_STR_CH_STR_CFG_TMODE_OFF              (16)

/** \\brief  Length for Ifx_GTM_FIFO_CH_CTRL_Bits.FLUSH */
#define IFX_GTM_FIFO_CH_CTRL_FLUSH_LEN                    (1)

