Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_FIFO_CH_CTRL_Bits.FLUSH */
#define IFX_GTM_FIFO_CH_CTRL_FLUSH_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_CTRL_Bits.FLUSH */
#define IFX_GTM_FIFO_CH_CTRL_FLUSH_OFF                    (2)

/** \\brief  Length for Ifx_GTM_FIFO_CH_CTRL_Bits.RAP */
#define IFX_GTM_FIFO_CH_CTRL_RAP_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_CTRL_Bits.RAP */
#define IFX_GTM_FIFO_CH_CTRL_RAP_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_CTRL_Bits.RAP */
#define IFX_GTM_FIFO_CH_CTRL_RAP_OFF                      (1)

/** \\brief  Length for Ifx_GTM_FIFO_CH_CTRL_Bits.RBM */
#define IFX_GTM_FIFO_CH_CTRL_RBM_LEN                      (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_CTRL_Bits.RBM */
#define IFX_GTM_FIFO_CH_CTRL_RBM_MSK                      (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_CTRL_Bits.RBM */
#define IFX_GTM_FIFO_CH_CTRL_RBM_OFF                      (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_CTRL_Bits.Reserved */
#define IFX_GTM_FIFO_CH_CTRL_RESERVED_LEN                 (28)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_CTRL_Bits.Reserved */
#define IFX_GTM_FIFO_CH_CTRL_RESERVED_MSK                 (0xfffffff)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_CTRL_Bits.Reserved */
#define IFX_GTM_FIFO_CH_CTRL_RESERVED_OFF                 (4)

/** \\brief  Length for Ifx_GTM_FIFO_CH_CTRL_Bits.WULOCK */
#define IFX_GTM_FIFO_CH_CTRL_WULOCK_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_CTRL_Bits.WULOCK */
#define IFX_GTM_FIFO_CH_CTRL_WULOCK_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_CTRL_Bits.WULOCK */
#define IFX_GTM_FIFO_CH_CTRL_WULOCK_OFF                   (3)

/** \\brief  Length for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_EMPTY_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_EMPTY_EIRQ_EN_LEN    (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_EMPTY_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_EMPTY_EIRQ_EN_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_EMPTY_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_EMPTY_EIRQ_EN_OFF    (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_FULL_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_FULL_EIRQ_EN_LEN     (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_FULL_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_FULL_EIRQ_EN_MSK     (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_FULL_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_FULL_EIRQ_EN_OFF     (1)

/** \\brief  Length for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_LWM_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_LWM_EIRQ_EN_LEN      (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_LWM_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_LWM_EIRQ_EN_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_LWM_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_LWM_EIRQ_EN_OFF      (2)

/** \\brief  Length for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_UWM_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_UWM_EIRQ_EN_LEN      (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_UWM_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_UWM_EIRQ_EN_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_UWM_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_UWM_EIRQ_EN_OFF      (3)

/** \\brief  Length for Ifx_GTM_FIFO_CH_END_ADDR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_END_ADDR_ADDR_LEN                 (10)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_END_ADDR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_END_ADDR_ADDR_MSK                 (0x3ff)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_END_ADDR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_END_ADDR_ADDR_OFF                 (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_END_ADDR_Bits.Reserved */
#define IFX_GTM_FIFO_CH_END_ADDR_RESERVED_LEN             (22)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_END_ADDR_Bits.Reserved */
#define IFX_GTM_FIFO_CH_END_ADDR_RESERVED_MSK             (0x3fffff)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_END_ADDR_Bits.Reserved */
#define IFX_GTM_FIFO_CH_END_ADDR_RESERVED_OFF             (10)

/** \\brief  Length for Ifx_GTM_FIFO_CH_FILL_LEVEL_Bits.LEVEL */
#define IFX_GTM_FIFO_CH_FILL_LEVEL_LEVEL_LEN              (11)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_FILL_LEVEL_Bits.LEVEL */
#define IFX_GTM_FIFO_CH_FILL_LEVEL_LEVEL_MSK              (0x7ff)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_FILL_LEVEL_Bits.LEVEL */
#define IFX_GTM_FIFO_CH_FILL_LEVEL_LEVEL_OFF              (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_EMPTY_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_EMPTY_IRQ_EN_LEN      (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_EMPTY_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_EMPTY_IRQ_EN_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_EMPTY_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_EMPTY_IRQ_EN_OFF      (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_FULL_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_FULL_IRQ_EN_LEN       (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_FULL_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_FULL_IRQ_EN_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_FULL_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_FULL_IRQ_EN_OFF       (1)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_LWM_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_LWM_IRQ_EN_LEN        (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_LWM_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_LWM_IRQ_EN_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_LWM_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_LWM_IRQ_EN_OFF        (2)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_UWM_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_UWM_IRQ_EN_LEN        (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_UWM_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_UWM_IRQ_EN_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_UWM_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_UWM_IRQ_EN_OFF        (3)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_EMPTY */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_EMPTY_LEN    (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_EMPTY */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_EMPTY_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_EMPTY */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_EMPTY_OFF    (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_FULL */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_FULL_LEN     (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_FULL */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_FULL_MSK     (0x1)

