Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_FIFO_CH_STATUS_Bits.UP_WM */
#define IFX_GTM_FIFO_CH_STATUS_UP_WM_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_STATUS_Bits.UP_WM */
#define IFX_GTM_FIFO_CH_STATUS_UP_WM_OFF                  (3)

/** \\brief  Length for Ifx_GTM_FIFO_CH_UPPER_WM_Bits.ADDR */
#define IFX_GTM_FIFO_CH_UPPER_WM_ADDR_LEN                 (10)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_UPPER_WM_Bits.ADDR */
#define IFX_GTM_FIFO_CH_UPPER_WM_ADDR_MSK                 (0x3ff)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_UPPER_WM_Bits.ADDR */
#define IFX_GTM_FIFO_CH_UPPER_WM_ADDR_OFF                 (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_WR_PTR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_WR_PTR_ADDR_LEN                   (10)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_WR_PTR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_WR_PTR_ADDR_MSK                   (0x3ff)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_WR_PTR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_WR_PTR_ADDR_OFF                   (0)

/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.ARU_CONNECT_CONFIG */
#define IFX_GTM_HW_CONF_ARU_CONNECT_CONFIG_LEN            (1)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.ARU_CONNECT_CONFIG */
#define IFX_GTM_HW_CONF_ARU_CONNECT_CONFIG_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.ARU_CONNECT_CONFIG */
#define IFX_GTM_HW_CONF_ARU_CONNECT_CONFIG_OFF            (14)

/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.ATOM_OUT_RST */
#define IFX_GTM_HW_CONF_ATOM_OUT_RST_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.ATOM_OUT_RST */
#define IFX_GTM_HW_CONF_ATOM_OUT_RST_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.ATOM_OUT_RST */
#define IFX_GTM_HW_CONF_ATOM_OUT_RST_OFF                  (4)

/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.ATOM_TRIG_CHAIN */
#define IFX_GTM_HW_CONF_ATOM_TRIG_CHAIN_LEN               (3)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.ATOM_TRIG_CHAIN */
#define IFX_GTM_HW_CONF_ATOM_TRIG_CHAIN_MSK               (0x7)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.ATOM_TRIG_CHAIN */
#define IFX_GTM_HW_CONF_ATOM_TRIG_CHAIN_OFF               (5)

/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.ATOM_TRIG_INTCHAIN */
#define IFX_GTM_HW_CONF_ATOM_TRIG_INTCHAIN_LEN            (4)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.ATOM_TRIG_INTCHAIN */
#define IFX_GTM_HW_CONF_ATOM_TRIG_INTCHAIN_MSK            (0xf)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.ATOM_TRIG_INTCHAIN */
#define IFX_GTM_HW_CONF_ATOM_TRIG_INTCHAIN_OFF            (20)

/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_HW_CONF_BRIDGE_MODE_RST_LEN               (1)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_HW_CONF_BRIDGE_MODE_RST_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_HW_CONF_BRIDGE_MODE_RST_OFF               (1)

/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.CFG_CLOCK_RATE */
#define IFX_GTM_HW_CONF_CFG_CLOCK_RATE_LEN                (1)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.CFG_CLOCK_RATE */
#define IFX_GTM_HW_CONF_CFG_CLOCK_RATE_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.CFG_CLOCK_RATE */
#define IFX_GTM_HW_CONF_CFG_CLOCK_RATE_OFF                (3)

/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.ERM */
#define IFX_GTM_HW_CONF_ERM_LEN                           (1)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.ERM */
#define IFX_GTM_HW_CONF_ERM_MSK                           (0x1)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.ERM */
#define IFX_GTM_HW_CONF_ERM_OFF                           (13)

/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_HW_CONF_GRSTEN_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_HW_CONF_GRSTEN_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_HW_CONF_GRSTEN_OFF                        (0)

/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.INT_CLK_EN_GEN */
#define IFX_GTM_HW_CONF_INT_CLK_EN_GEN_LEN                (1)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.INT_CLK_EN_GEN */
#define IFX_GTM_HW_CONF_INT_CLK_EN_GEN_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.INT_CLK_EN_GEN */
#define IFX_GTM_HW_CONF_INT_CLK_EN_GEN_OFF                (29)

/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_LEVEL */
#define IFX_GTM_HW_CONF_IRQ_MODE_LEVEL_LEN                (1)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_LEVEL */
#define IFX_GTM_HW_CONF_IRQ_MODE_LEVEL_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_LEVEL */
#define IFX_GTM_HW_CONF_IRQ_MODE_LEVEL_OFF                (16)

/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_PULSE */
#define IFX_GTM_HW_CONF_IRQ_MODE_PULSE_LEN                (1)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_PULSE */
#define IFX_GTM_HW_CONF_IRQ_MODE_PULSE_MSK                (0x1)

/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_PULSE_NOTIFY */
#define IFX_GTM_HW_CONF_IRQ_MODE_PULSE_NOTIFY_LEN         (1)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_PULSE_NOTIFY */
#define IFX_GTM_HW_CONF_IRQ_MODE_PULSE_NOTIFY_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_PULSE_NOTIFY */
#define IFX_GTM_HW_CONF_IRQ_MODE_PULSE_NOTIFY_OFF         (18)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_PULSE */
#define IFX_GTM_HW_CONF_IRQ_MODE_PULSE_OFF                (17)

/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_HW_CONF_IRQ_MODE_SINGLE_PULSE_LEN         (1)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_HW_CONF_IRQ_MODE_SINGLE_PULSE_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_HW_CONF_IRQ_MODE_SINGLE_PULSE_OFF         (19)

/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.RAM_INIT_RST */
#define IFX_GTM_HW_CONF_RAM_INIT_RST_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.RAM_INIT_RST */
#define IFX_GTM_HW_CONF_RAM_INIT_RST_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.RAM_INIT_RST */
#define IFX_GTM_HW_CONF_RAM_INIT_RST_OFF                  (12)

