Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_HW_CONF_SYNC_INPUT_REG_LEN                (1)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_HW_CONF_SYNC_INPUT_REG_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_HW_CONF_SYNC_INPUT_REG_OFF                (2)

/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.TOM_OUT_RST */
#define IFX_GTM_HW_CONF_TOM_OUT_RST_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.TOM_OUT_RST */
#define IFX_GTM_HW_CONF_TOM_OUT_RST_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.TOM_OUT_RST */
#define IFX_GTM_HW_CONF_TOM_OUT_RST_OFF                   (8)

/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.TOM_TRIG_CHAIN */
#define IFX_GTM_HW_CONF_TOM_TRIG_CHAIN_LEN                (3)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.TOM_TRIG_CHAIN */
#define IFX_GTM_HW_CONF_TOM_TRIG_CHAIN_MSK                (0x7)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.TOM_TRIG_CHAIN */
#define IFX_GTM_HW_CONF_TOM_TRIG_CHAIN_OFF                (9)

/** \\brief  Length for Ifx_GTM_HW_CONF_Bits.TOM_TRIG_INTCHAIN */
#define IFX_GTM_HW_CONF_TOM_TRIG_INTCHAIN_LEN             (5)

/** \\brief  Mask for Ifx_GTM_HW_CONF_Bits.TOM_TRIG_INTCHAIN */
#define IFX_GTM_HW_CONF_TOM_TRIG_INTCHAIN_MSK             (0x1f)

/** \\brief  Offset for Ifx_GTM_HW_CONF_Bits.TOM_TRIG_INTCHAIN */
#define IFX_GTM_HW_CONF_TOM_TRIG_INTCHAIN_OFF             (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.AEI_IRQ */
#define IFX_GTM_ICM_IRQG_0_AEI_IRQ_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.AEI_IRQ */
#define IFX_GTM_ICM_IRQG_0_AEI_IRQ_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.AEI_IRQ */
#define IFX_GTM_ICM_IRQG_0_AEI_IRQ_OFF                    (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.ARU_ACC_ACK_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_ACC_ACK_IRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.ARU_ACC_ACK_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_ACC_ACK_IRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.ARU_ACC_ACK_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_ACC_ACK_IRQ_OFF            (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.ARU_NEW_DATA0_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_NEW_DATA0_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.ARU_NEW_DATA0_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_NEW_DATA0_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.ARU_NEW_DATA0_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_NEW_DATA0_IRQ_OFF          (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.ARU_NEW_DATA1_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_NEW_DATA1_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.ARU_NEW_DATA1_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_NEW_DATA1_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.ARU_NEW_DATA1_IRQ */
#define IFX_GTM_ICM_IRQG_0_ARU_NEW_DATA1_IRQ_OFF          (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.BRC_IRQ */
#define IFX_GTM_ICM_IRQG_0_BRC_IRQ_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.BRC_IRQ */
#define IFX_GTM_ICM_IRQG_0_BRC_IRQ_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.BRC_IRQ */
#define IFX_GTM_ICM_IRQG_0_BRC_IRQ_OFF                    (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.CMP_IRQ */
#define IFX_GTM_ICM_IRQG_0_CMP_IRQ_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.CMP_IRQ */
#define IFX_GTM_ICM_IRQG_0_CMP_IRQ_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.CMP_IRQ */
#define IFX_GTM_ICM_IRQG_0_CMP_IRQ_OFF                    (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH0_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH0_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH0_IRQ_OFF               (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH1_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH1_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH1_IRQ_OFF               (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH2_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH2_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH2_IRQ_OFF               (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH3_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH3_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH3_IRQ_OFF               (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH4_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH4_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH4_IRQ_OFF               (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH5_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH5_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH5_IRQ_OFF               (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH6_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH6_IRQ_MSK               (0x1)

