Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH6_IRQ_OFF               (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH7_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH7_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH7_IRQ_OFF               (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH0_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH0_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH0_IRQ_OFF               (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH1_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH1_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH1_IRQ_OFF               (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH2_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH2_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH2_IRQ_OFF               (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH3_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH3_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH3_IRQ_OFF               (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH4_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH4_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH4_IRQ_OFF               (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH5_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH5_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH5_IRQ_OFF               (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH6_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH6_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH6_IRQ_OFF               (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH7_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH7_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH7_IRQ_OFF               (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE0_IRQ_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE0_IRQ_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE0_IRQ_OFF                   (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE1_IRQ_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE1_IRQ_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE1_IRQ_OFF                   (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.SPE2_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE2_IRQ_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.SPE2_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE2_IRQ_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.SPE2_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE2_IRQ_OFF                   (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.SPE3_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE3_IRQ_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.SPE3_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE3_IRQ_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.SPE3_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE3_IRQ_OFF                   (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.SPE4_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE4_IRQ_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.SPE4_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE4_IRQ_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.SPE4_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE4_IRQ_OFF                   (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.SPE5_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE5_IRQ_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.SPE5_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE5_IRQ_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.SPE5_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE5_IRQ_OFF                   (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH0_IRQ_LEN             (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH0_IRQ_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH0_IRQ_OFF             (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH1_IRQ_LEN             (1)

