Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH1_IRQ_OFF            (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH2_IRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH2_IRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH2_IRQ_OFF            (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH3_IRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH3_IRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH3_IRQ_OFF            (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH4_IRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH4_IRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH4_IRQ_OFF            (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH5_IRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH5_IRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH5_IRQ_OFF            (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH6_IRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH6_IRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH6_IRQ_OFF            (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH7_IRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH7_IRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM10_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM10_CH7_IRQ_OFF            (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH0_IRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH0_IRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH0_IRQ_OFF            (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH1_IRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH1_IRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH1_IRQ_OFF            (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH2_IRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH2_IRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH2_IRQ_OFF            (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH3_IRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH3_IRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH3_IRQ_OFF            (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH4_IRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH4_IRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH4_IRQ_OFF            (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH5_IRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH5_IRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH5_IRQ_OFF            (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH6_IRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH6_IRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH6_IRQ_OFF            (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH7_IRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH7_IRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM11_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM11_CH7_IRQ_OFF            (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH0_IRQ_LEN             (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH0_IRQ_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH0_IRQ_OFF             (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH1_IRQ_LEN             (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH1_IRQ_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH1_IRQ_OFF             (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH2_IRQ_LEN             (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH2_IRQ_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH2_IRQ_OFF             (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH3_IRQ_LEN             (1)

