Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EDI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EDI_IRQ_OFF               (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EI_IRQ_LEN                (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EI_IRQ_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EI_IRQ_OFF                (15)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GL1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GL1I_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GL1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GL1I_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GL1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GL1I_IRQ_OFF              (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GL2I_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GL2I_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GL2I_IRQ_OFF              (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LL1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LL1I_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LL1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LL1I_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LL1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LL1I_IRQ_OFF              (14)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LL2I_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LL2I_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LL2I_IRQ_OFF              (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MSI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MSI_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MSI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MSI_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MSI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MSI_IRQ_OFF               (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MTI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MTI_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MTI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MTI_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MTI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MTI_IRQ_OFF               (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_PWI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_PWI_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_PWI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_PWI_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_PWI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_PWI_IRQ_OFF               (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SASI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SASI_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SASI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SASI_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SASI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SASI_IRQ_OFF              (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SISI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SISI_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SISI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SISI_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SISI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SISI_IRQ_OFF              (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SORI_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SORI_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SORI_IRQ_OFF              (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TASI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TASI_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TASI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TASI_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TASI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TASI_IRQ_OFF              (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAXI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAXI_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAXI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAXI_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAXI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAXI_IRQ_OFF              (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE0I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE0I_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE0I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE0I_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE0I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE0I_IRQ_OFF              (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE1I_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE1I_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE1I_IRQ_OFF              (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE2I_IRQ_LEN              (1)

