Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE2I_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE2I_IRQ_OFF              (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE3I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE3I_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE3I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE3I_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE3I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE3I_IRQ_OFF              (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE4I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE4I_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE4I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE4I_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE4I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE4I_IRQ_OFF              (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TINI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TINI_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TINI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TINI_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TINI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TINI_IRQ_OFF              (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TISI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TISI_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TISI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TISI_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TISI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TISI_IRQ_OFF              (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TORI_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TORI_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TORI_IRQ_OFF              (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W1I_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W1I_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W1I_IRQ_OFF               (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W2I_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W2I_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W2I_IRQ_OFF               (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH0_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH0_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH0_IRQ_OFF               (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH1_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH1_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH1_IRQ_OFF               (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH2_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH2_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH2_IRQ_OFF               (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH3_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH3_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH3_IRQ_OFF               (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH4_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH4_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH4_IRQ_OFF               (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH5_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH5_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH5_IRQ_OFF               (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH6_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH6_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH6_IRQ_OFF               (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH7_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH7_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH7_IRQ_OFF               (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH0_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH0_IRQ_MSK               (0x1)

