Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH0_IRQ_OFF               (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH1_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH1_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH1_IRQ_OFF               (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH2_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH2_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH2_IRQ_OFF               (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH3_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH3_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH3_IRQ_OFF               (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH4_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH4_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH4_IRQ_OFF               (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH5_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH5_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH5_IRQ_OFF               (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH6_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH6_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH6_IRQ_OFF               (14)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH7_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH7_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH7_IRQ_OFF               (15)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH0_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH0_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH0_IRQ_OFF               (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH1_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH1_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH1_IRQ_OFF               (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH2_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH2_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH2_IRQ_OFF               (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH3_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH3_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH3_IRQ_OFF               (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH4_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH4_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH4_IRQ_OFF               (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH5_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH5_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH5_IRQ_OFF               (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH6_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH6_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH6_IRQ_OFF               (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH7_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH7_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM2_CH7_IRQ_OFF               (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH0_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH0_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH0_IRQ_OFF               (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH1_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH1_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH1_IRQ_OFF               (25)

