Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH2_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH2_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH2_IRQ_OFF               (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH3_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH3_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH3_IRQ_OFF               (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH4_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH4_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH4_IRQ_OFF               (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH5_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH5_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH5_IRQ_OFF               (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH6_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH6_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH6_IRQ_OFF               (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH7_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH7_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH7_IRQ_OFF               (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH0_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH0_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH0_IRQ_OFF               (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH1_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH1_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH1_IRQ_OFF               (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH2_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH2_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH2_IRQ_OFF               (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH3_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH3_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH3_IRQ_OFF               (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH4_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH4_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH4_IRQ_OFF               (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH5_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH5_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH5_IRQ_OFF               (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH6_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH6_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH6_IRQ_OFF               (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH7_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH7_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_3_Bits.TIM4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM4_CH7_IRQ_OFF               (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_3_Bits.TIM5_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM5_CH0_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_3_Bits.TIM5_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM5_CH0_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_3_Bits.TIM5_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM5_CH0_IRQ_OFF               (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_3_Bits.TIM5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM5_CH1_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_3_Bits.TIM5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM5_CH1_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_3_Bits.TIM5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM5_CH1_IRQ_OFF               (9)

