Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ICM_IRQG_3_Bits.TIM7_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM7_CH3_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_3_Bits.TIM7_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM7_CH3_IRQ_OFF               (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_3_Bits.TIM7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM7_CH4_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_3_Bits.TIM7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM7_CH4_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_3_Bits.TIM7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM7_CH4_IRQ_OFF               (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_3_Bits.TIM7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM7_CH5_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_3_Bits.TIM7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM7_CH5_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_3_Bits.TIM7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM7_CH5_IRQ_OFF               (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_3_Bits.TIM7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM7_CH6_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_3_Bits.TIM7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM7_CH6_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_3_Bits.TIM7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM7_CH6_IRQ_OFF               (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_3_Bits.TIM7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM7_CH7_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_3_Bits.TIM7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM7_CH7_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_3_Bits.TIM7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_3_TIM7_CH7_IRQ_OFF               (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH0_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH0_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH0_IRQ_OFF               (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH1_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH1_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH1_IRQ_OFF               (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH2_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH2_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH2_IRQ_OFF               (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH3_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH3_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH3_IRQ_OFF               (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH4_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH4_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH4_IRQ_OFF               (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH5_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH5_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH5_IRQ_OFF               (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH6_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH6_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH6_IRQ_OFF               (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH7_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH7_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH7_IRQ_OFF               (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH0_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH0_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH0_IRQ_OFF               (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH1_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH1_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH1_IRQ_OFF               (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH2_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH2_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH2_IRQ_OFF               (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH3_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH3_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH3_IRQ_OFF               (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH4_IRQ_LEN               (1)

