Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH10_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH10_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH10_IRQ_OFF              (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH11_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH11_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH11_IRQ_OFF              (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH12_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH12_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH12_IRQ_OFF              (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH13_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH13_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH13_IRQ_OFF              (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH14_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH14_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH14_IRQ_OFF              (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH15_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH15_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH15_IRQ_OFF              (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH1_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH1_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH1_IRQ_OFF               (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH2_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH2_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH2_IRQ_OFF               (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH3_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH3_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH3_IRQ_OFF               (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH4_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH4_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH4_IRQ_OFF               (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH5_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH5_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH5_IRQ_OFF               (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH6_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH6_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH6_IRQ_OFF               (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH7_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH7_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH7_IRQ_OFF               (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH8_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH8_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH8_IRQ_OFF               (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH9_IRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH9_IRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH9_IRQ_OFF               (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH0_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH0_IRQ_MSK              (0x1)

