Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH0_IRQ_OFF              (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH1_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH1_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH1_IRQ_OFF              (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH2_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH2_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH2_IRQ_OFF              (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH3_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH3_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH3_IRQ_OFF              (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH4_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH4_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH4_IRQ_OFF              (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH5_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH5_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH5_IRQ_OFF              (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH6_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH6_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH6_IRQ_OFF              (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH7_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH7_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH7_IRQ_OFF              (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH0_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH0_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH0_IRQ_OFF              (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH1_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH1_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH1_IRQ_OFF              (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH2_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH2_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH2_IRQ_OFF              (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH3_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH3_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH3_IRQ_OFF              (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH4_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH4_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH4_IRQ_OFF              (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH5_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH5_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH5_IRQ_OFF              (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH6_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH6_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH6_IRQ_OFF              (14)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH7_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH7_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH7_IRQ_OFF              (15)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH0_IRQ_LEN              (1)

