Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH1_IRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH1_IRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH1_IRQ_OFF    (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH2_IRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH2_IRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH2_IRQ_OFF    (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH3_IRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH3_IRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH3_IRQ_OFF    (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH4_IRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH4_IRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH4_IRQ_OFF    (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH5_IRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH5_IRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH5_IRQ_OFF    (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH6_IRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH6_IRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH6_IRQ_OFF    (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH7_IRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH7_IRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_ATOM_2_CI_Bits.ATOM_M3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_ATOM_2_CI_ATOM_M3_CH7_IRQ_OFF    (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH0_EIRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH0_EIRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH0_EIRQ_OFF          (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH1_EIRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH1_EIRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH1_EIRQ_OFF          (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH2_EIRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH2_EIRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH2_EIRQ_OFF          (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH3_EIRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH3_EIRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH3_EIRQ_OFF          (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH4_EIRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH4_EIRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH4_EIRQ_OFF          (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH5_EIRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH5_EIRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH5_EIRQ_OFF          (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH6_EIRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH6_EIRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH6_EIRQ_OFF          (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH7_EIRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH7_EIRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH7_EIRQ_OFF          (7)

