Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS5_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS5_CH7_EIRQ_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS5_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS5_CH7_EIRQ_OFF           (15)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH0_EIRQ_LEN           (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH0_EIRQ_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH0_EIRQ_OFF           (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH1_EIRQ_LEN           (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH1_EIRQ_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH1_EIRQ_OFF           (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH2_EIRQ_LEN           (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH2_EIRQ_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH2_EIRQ_OFF           (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH3_EIRQ_LEN           (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH3_EIRQ_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH3_EIRQ_OFF           (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH4_EIRQ_LEN           (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH4_EIRQ_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH4_EIRQ_OFF           (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH5_EIRQ_LEN           (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH5_EIRQ_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH5_EIRQ_OFF           (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH6_EIRQ_LEN           (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH6_EIRQ_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH6_EIRQ_OFF           (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH7_EIRQ_LEN           (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH7_EIRQ_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH7_EIRQ_OFF           (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH0_EIRQ_LEN           (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH0_EIRQ_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH0_EIRQ_OFF           (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH1_EIRQ_LEN           (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH1_EIRQ_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH1_EIRQ_OFF           (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH2_EIRQ_LEN           (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH2_EIRQ_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH2_EIRQ_OFF           (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH3_EIRQ_LEN           (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH3_EIRQ_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH3_EIRQ_OFF           (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH4_EIRQ_LEN           (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH4_EIRQ_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH4_EIRQ_OFF           (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH5_EIRQ_LEN           (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH5_EIRQ_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH5_EIRQ_OFF           (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH6_EIRQ_LEN           (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH6_EIRQ_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH6_EIRQ_OFF           (30)

