Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH7_EIRQ_LEN           (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH7_EIRQ_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH7_EIRQ_OFF           (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.FIFO_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_FIFO_M0_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.FIFO_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_FIFO_M0_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.FIFO_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_FIFO_M0_EIRQ_OFF       (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.FIFO_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_FIFO_M1_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.FIFO_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_FIFO_M1_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.FIFO_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_FIFO_M1_EIRQ_OFF       (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.FIFO_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_FIFO_M2_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.FIFO_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_FIFO_M2_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.FIFO_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_FIFO_M2_EIRQ_OFF       (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.FIFO_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_FIFO_M3_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.FIFO_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_FIFO_M3_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.FIFO_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_FIFO_M3_EIRQ_OFF       (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.MCS_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_MCS_M0_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.MCS_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_MCS_M0_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.MCS_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_MCS_M0_EIRQ_OFF        (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.MCS_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_MCS_M1_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.MCS_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_MCS_M1_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.MCS_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_MCS_M1_EIRQ_OFF        (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.MCS_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_MCS_M2_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.MCS_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_MCS_M2_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.MCS_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_MCS_M2_EIRQ_OFF        (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.MCS_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_MCS_M3_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.MCS_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_MCS_M3_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.MCS_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_MCS_M3_EIRQ_OFF        (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.SPE_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_SPE_M0_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.SPE_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_SPE_M0_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.SPE_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_SPE_M0_EIRQ_OFF        (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.SPE_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_SPE_M1_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.SPE_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_SPE_M1_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.SPE_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_SPE_M1_EIRQ_OFF        (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.SPE_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_SPE_M2_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.SPE_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_SPE_M2_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.SPE_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_SPE_M2_EIRQ_OFF        (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.SPE_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_SPE_M3_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.SPE_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_SPE_M3_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.SPE_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_SPE_M3_EIRQ_OFF        (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.TIM_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_TIM_M0_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.TIM_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_TIM_M0_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.TIM_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_TIM_M0_EIRQ_OFF        (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.TIM_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_TIM_M1_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.TIM_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_TIM_M1_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_0_MEI_Bits.TIM_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_0_MEI_TIM_M1_EIRQ_OFF        (8)

