Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_2_MEI_Bits.TIM_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_2_MEI_TIM_M0_EIRQ_OFF        (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CLS_2_MEI_Bits.TIM_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_2_MEI_TIM_M1_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CLS_2_MEI_Bits.TIM_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_2_MEI_TIM_M1_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_2_MEI_Bits.TIM_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_2_MEI_TIM_M1_EIRQ_OFF        (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CLS_2_MEI_Bits.TIM_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_2_MEI_TIM_M2_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CLS_2_MEI_Bits.TIM_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_2_MEI_TIM_M2_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_2_MEI_Bits.TIM_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_2_MEI_TIM_M2_EIRQ_OFF        (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CLS_2_MEI_Bits.TIM_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_2_MEI_TIM_M3_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CLS_2_MEI_Bits.TIM_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_2_MEI_TIM_M3_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CLS_2_MEI_Bits.TIM_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_CLS_2_MEI_TIM_M3_EIRQ_OFF        (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH0_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH0_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH0_EIRQ_OFF        (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH10_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH10_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH10_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH10_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH10_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH10_EIRQ_OFF       (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH11_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH11_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH11_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH11_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH11_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH11_EIRQ_OFF       (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH12_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH12_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH12_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH12_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH12_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH12_EIRQ_OFF       (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH13_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH13_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH13_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH13_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH13_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH13_EIRQ_OFF       (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH14_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH14_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH14_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH14_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH14_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH14_EIRQ_OFF       (14)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH15_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH15_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH15_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH15_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH15_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH15_EIRQ_OFF       (15)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH16_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH16_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH16_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH16_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH16_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH16_EIRQ_OFF       (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH17_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH17_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH17_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH17_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH17_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH17_EIRQ_OFF       (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH18_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH18_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH18_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH18_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH18_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH18_EIRQ_OFF       (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH19_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH19_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH19_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH19_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH19_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH19_EIRQ_OFF       (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH1_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH1_EIRQ_MSK        (0x1)

