Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH1_EIRQ_OFF        (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH20_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH20_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH20_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH20_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH20_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH20_EIRQ_OFF       (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH21_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH21_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH21_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH21_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH21_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH21_EIRQ_OFF       (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH22_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH22_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH22_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH22_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH22_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH22_EIRQ_OFF       (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH23_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH23_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH23_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH23_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH23_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH23_EIRQ_OFF       (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH24_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH24_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH24_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH24_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH24_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH24_EIRQ_OFF       (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH25_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH25_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH25_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH25_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH25_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH25_EIRQ_OFF       (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH26_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH26_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH26_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH26_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH26_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH26_EIRQ_OFF       (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH27_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH27_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH27_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH27_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH27_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH27_EIRQ_OFF       (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH28_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH28_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH28_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH28_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH28_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH28_EIRQ_OFF       (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH29_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH29_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH29_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH29_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH29_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH29_EIRQ_OFF       (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH2_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH2_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH2_EIRQ_OFF        (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH30_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH30_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH30_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH30_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH30_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH30_EIRQ_OFF       (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH31_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH31_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH31_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH31_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH31_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH31_EIRQ_OFF       (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH3_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH3_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH3_EIRQ_OFF        (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH4_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH4_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH4_EIRQ_OFF        (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH5_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CEI_Bits.MCS_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CEI_MCS_CH5_EIRQ_MSK        (0x1)

