Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH22_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH22_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH22_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH22_IRQ_OFF         (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH23_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH23_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH23_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH23_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH23_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH23_IRQ_OFF         (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH24_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH24_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH24_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH24_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH24_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH24_IRQ_OFF         (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH25_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH25_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH25_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH25_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH25_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH25_IRQ_OFF         (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH26_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH26_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH26_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH26_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH26_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH26_IRQ_OFF         (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH27_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH27_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH27_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH27_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH27_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH27_IRQ_OFF         (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH28_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH28_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH28_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH28_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH28_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH28_IRQ_OFF         (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH29_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH29_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH29_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH29_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH29_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH29_IRQ_OFF         (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH2_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH2_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH2_IRQ_OFF          (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH30_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH30_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH30_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH30_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH30_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH30_IRQ_OFF         (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH31_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH31_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH31_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH31_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH31_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH31_IRQ_OFF         (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH3_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH3_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH3_IRQ_OFF          (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH4_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH4_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH4_IRQ_OFF          (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH5_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH5_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH5_IRQ_OFF          (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH6_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH6_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH6_IRQ_OFF          (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH7_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH7_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH7_IRQ_OFF          (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH8_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH8_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH8_IRQ_OFF          (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS0_CI_Bits.MCS_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_MCS0_CI_MCS_CH9_IRQ_LEN          (1)

