Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS1_CEI_Bits.MCS_CH8_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CEI_MCS_CH8_EIRQ_OFF        (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS1_CEI_Bits.MCS_CH9_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CEI_MCS_CH9_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS1_CEI_Bits.MCS_CH9_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CEI_MCS_CH9_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS1_CEI_Bits.MCS_CH9_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CEI_MCS_CH9_EIRQ_OFF        (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH0_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH0_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH0_IRQ_OFF          (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH10_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH10_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH10_IRQ_OFF         (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH11_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH11_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH11_IRQ_OFF         (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH12_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH12_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH12_IRQ_OFF         (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH13_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH13_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH13_IRQ_OFF         (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH14_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH14_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH14_IRQ_OFF         (14)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH15_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH15_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH15_IRQ_OFF         (15)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH16_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH16_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH16_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH16_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH16_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH16_IRQ_OFF         (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH17_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH17_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH17_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH17_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH17_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH17_IRQ_OFF         (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH18_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH18_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH18_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH18_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH18_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH18_IRQ_OFF         (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH19_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH19_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH19_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH19_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH19_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH19_IRQ_OFF         (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH1_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH1_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH1_IRQ_OFF          (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH20_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH20_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH20_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH20_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH20_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH20_IRQ_OFF         (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH21_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH21_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH21_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH21_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS1_CI_Bits.MCS_CH21_IRQ */
#define IFX_GTM_ICM_IRQG_MCS1_CI_MCS_CH21_IRQ_OFF         (21)

