Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH16_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH16_IRQ_OFF         (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH17_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH17_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH17_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH17_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH17_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH17_IRQ_OFF         (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH18_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH18_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH18_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH18_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH18_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH18_IRQ_OFF         (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH19_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH19_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH19_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH19_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH19_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH19_IRQ_OFF         (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH1_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH1_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH1_IRQ_OFF          (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH20_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH20_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH20_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH20_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH20_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH20_IRQ_OFF         (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH21_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH21_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH21_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH21_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH21_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH21_IRQ_OFF         (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH22_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH22_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH22_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH22_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH22_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH22_IRQ_OFF         (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH23_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH23_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH23_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH23_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH23_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH23_IRQ_OFF         (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH24_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH24_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH24_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH24_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH24_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH24_IRQ_OFF         (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH25_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH25_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH25_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH25_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH25_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH25_IRQ_OFF         (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH26_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH26_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH26_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH26_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH26_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH26_IRQ_OFF         (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH27_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH27_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH27_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH27_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH27_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH27_IRQ_OFF         (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH28_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH28_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH28_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH28_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH28_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH28_IRQ_OFF         (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH29_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH29_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH29_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH29_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH29_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH29_IRQ_OFF         (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH2_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH2_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH2_IRQ_OFF          (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH30_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH30_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH30_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH30_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH30_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH30_IRQ_OFF         (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH31_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH31_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH31_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH31_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH31_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH31_IRQ_OFF         (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS5_CI_Bits.MCS_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_MCS5_CI_MCS_CH3_IRQ_LEN          (1)

