Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH16_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH16_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH16_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH16_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH16_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH16_EIRQ_OFF       (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH17_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH17_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH17_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH17_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH17_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH17_EIRQ_OFF       (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH18_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH18_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH18_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH18_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH18_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH18_EIRQ_OFF       (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH19_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH19_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH19_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH19_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH19_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH19_EIRQ_OFF       (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH1_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH1_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH1_EIRQ_OFF        (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH20_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH20_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH20_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH20_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH20_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH20_EIRQ_OFF       (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH21_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH21_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH21_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH21_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH21_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH21_EIRQ_OFF       (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH22_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH22_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH22_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH22_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH22_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH22_EIRQ_OFF       (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH23_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH23_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH23_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH23_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH23_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH23_EIRQ_OFF       (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH24_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH24_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH24_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH24_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH24_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH24_EIRQ_OFF       (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH25_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH25_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH25_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH25_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH25_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH25_EIRQ_OFF       (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH26_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH26_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH26_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH26_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH26_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH26_EIRQ_OFF       (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH27_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH27_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH27_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH27_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH27_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH27_EIRQ_OFF       (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH28_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH28_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH28_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH28_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH28_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH28_EIRQ_OFF       (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH29_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH29_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH29_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH29_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CEI_Bits.MCS_CH29_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CEI_MCS_CH29_EIRQ_OFF       (29)

