Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH28_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH28_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH28_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH28_IRQ_OFF         (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH29_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH29_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH29_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH29_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH29_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH29_IRQ_OFF         (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH2_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH2_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH2_IRQ_OFF          (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH30_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH30_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH30_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH30_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH30_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH30_IRQ_OFF         (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH31_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH31_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH31_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH31_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH31_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH31_IRQ_OFF         (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH3_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH3_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH3_IRQ_OFF          (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH4_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH4_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH4_IRQ_OFF          (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH5_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH5_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH5_IRQ_OFF          (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH6_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH6_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH6_IRQ_OFF          (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH7_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH7_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH7_IRQ_OFF          (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH8_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH8_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH8_IRQ_OFF          (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH9_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH9_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS7_CI_Bits.MCS_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_MCS7_CI_MCS_CH9_IRQ_OFF          (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS8_CEI_Bits.MCS_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS8_CEI_MCS_CH0_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS8_CEI_Bits.MCS_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS8_CEI_MCS_CH0_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS8_CEI_Bits.MCS_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS8_CEI_MCS_CH0_EIRQ_OFF        (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS8_CEI_Bits.MCS_CH10_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS8_CEI_MCS_CH10_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS8_CEI_Bits.MCS_CH10_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS8_CEI_MCS_CH10_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS8_CEI_Bits.MCS_CH10_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS8_CEI_MCS_CH10_EIRQ_OFF       (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS8_CEI_Bits.MCS_CH11_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS8_CEI_MCS_CH11_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS8_CEI_Bits.MCS_CH11_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS8_CEI_MCS_CH11_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS8_CEI_Bits.MCS_CH11_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS8_CEI_MCS_CH11_EIRQ_OFF       (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS8_CEI_Bits.MCS_CH12_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS8_CEI_MCS_CH12_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS8_CEI_Bits.MCS_CH12_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS8_CEI_MCS_CH12_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS8_CEI_Bits.MCS_CH12_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS8_CEI_MCS_CH12_EIRQ_OFF       (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS8_CEI_Bits.MCS_CH13_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS8_CEI_MCS_CH13_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS8_CEI_Bits.MCS_CH13_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS8_CEI_MCS_CH13_EIRQ_MSK       (0x1)

