Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH29_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH29_EIRQ_OFF       (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH2_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH2_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH2_EIRQ_OFF        (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH30_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH30_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH30_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH30_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH30_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH30_EIRQ_OFF       (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH31_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH31_EIRQ_LEN       (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH31_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH31_EIRQ_MSK       (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH31_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH31_EIRQ_OFF       (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH3_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH3_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH3_EIRQ_OFF        (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH4_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH4_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH4_EIRQ_OFF        (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH5_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH5_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH5_EIRQ_OFF        (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH6_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH6_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH6_EIRQ_OFF        (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH7_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH7_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH7_EIRQ_OFF        (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH8_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH8_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH8_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH8_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH8_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH8_EIRQ_OFF        (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH9_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH9_EIRQ_LEN        (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH9_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH9_EIRQ_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CEI_Bits.MCS_CH9_EIRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CEI_MCS_CH9_EIRQ_OFF        (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH0_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH0_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH0_IRQ_OFF          (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH10_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH10_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH10_IRQ_OFF         (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH11_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH11_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH11_IRQ_OFF         (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH12_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH12_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH12_IRQ_OFF         (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH13_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH13_IRQ_MSK         (0x1)

