Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH2_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH2_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH2_IRQ_OFF          (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH30_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH30_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH30_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH30_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH30_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH30_IRQ_OFF         (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH31_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH31_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH31_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH31_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH31_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH31_IRQ_OFF         (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH3_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH3_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH3_IRQ_OFF          (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH4_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH4_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH4_IRQ_OFF          (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH5_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH5_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH5_IRQ_OFF          (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH6_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH6_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH6_IRQ_OFF          (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH7_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH7_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH7_IRQ_OFF          (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH8_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH8_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH8_IRQ_OFF          (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH9_IRQ_LEN          (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH9_IRQ_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MCS9_CI_Bits.MCS_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_MCS9_CI_MCS_CH9_IRQ_OFF          (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.BRC_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_BRC_EIRQ_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.BRC_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_BRC_EIRQ_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.BRC_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_BRC_EIRQ_OFF                 (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.CMP_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CMP_EIRQ_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.CMP_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CMP_EIRQ_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.CMP_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CMP_EIRQ_OFF                 (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.DPLL_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_DPLL_EIRQ_LEN                (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.DPLL_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_DPLL_EIRQ_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.DPLL_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_DPLL_EIRQ_OFF                (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.FIFO0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_FIFO0_EIRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.FIFO0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_FIFO0_EIRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.FIFO0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_FIFO0_EIRQ_OFF               (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.FIFO1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_FIFO1_EIRQ_LEN               (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.FIFO1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_FIFO1_EIRQ_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.FIFO1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_FIFO1_EIRQ_OFF               (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.GTM_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_GTM_EIRQ_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.GTM_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_GTM_EIRQ_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.GTM_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_GTM_EIRQ_OFF                 (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS0_EIRQ_LEN                (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS0_EIRQ_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS0_EIRQ_OFF                (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS1_EIRQ_LEN                (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS1_EIRQ_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS1_EIRQ_OFF                (13)

