Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH1_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH1_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH1_EIRQ_OFF    (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH2_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH2_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH2_EIRQ_OFF    (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH3_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH3_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH3_EIRQ_OFF    (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH4_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH4_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH4_EIRQ_OFF    (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH5_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH5_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH5_EIRQ_OFF    (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH6_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH6_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH6_EIRQ_OFF    (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH7_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH7_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M0_CH7_EIRQ_OFF    (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH0_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH0_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH0_EIRQ_OFF    (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH1_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH1_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH1_EIRQ_OFF    (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH2_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH2_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH2_EIRQ_OFF    (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH3_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH3_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH3_EIRQ_OFF    (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH4_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH4_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH4_EIRQ_OFF    (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH5_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH5_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH5_EIRQ_OFF    (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH6_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH6_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH6_EIRQ_OFF    (14)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH7_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH7_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M1_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M1_CH7_EIRQ_OFF    (15)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH0_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH0_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH0_EIRQ_OFF    (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH1_EIRQ_LEN    (1)

