Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH1_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH1_EIRQ_OFF    (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH2_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH2_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH2_EIRQ_OFF    (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH3_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH3_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH3_EIRQ_OFF    (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH4_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH4_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH4_EIRQ_OFF    (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH5_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH5_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH5_EIRQ_OFF    (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH6_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH6_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH6_EIRQ_OFF    (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH7_EIRQ_LEN    (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH7_EIRQ_MSK    (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CEI_Bits.PSM_M3_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CEI_PSM_M3_CH7_EIRQ_OFF    (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH0_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH0_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH0_IRQ_OFF      (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH1_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH1_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH1_IRQ_OFF      (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH2_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH2_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH2_IRQ_OFF      (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH3_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH3_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH3_IRQ_OFF      (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH4_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH4_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH4_IRQ_OFF      (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH5_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH5_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH5_IRQ_OFF      (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH6_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH6_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH6_IRQ_OFF      (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH7_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH7_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_PSM_0_CI_Bits.PSM_M0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_PSM_0_CI_PSM_M0_CH7_IRQ_OFF      (7)

