Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ICM_IRQG_SPE_CEI_Bits.SPE1_EIRQ */
#define IFX_GTM_ICM_IRQG_SPE_CEI_SPE1_EIRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_SPE_CEI_Bits.SPE1_EIRQ */
#define IFX_GTM_ICM_IRQG_SPE_CEI_SPE1_EIRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_SPE_CEI_Bits.SPE1_EIRQ */
#define IFX_GTM_ICM_IRQG_SPE_CEI_SPE1_EIRQ_OFF            (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_SPE_CEI_Bits.SPE2_EIRQ */
#define IFX_GTM_ICM_IRQG_SPE_CEI_SPE2_EIRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_SPE_CEI_Bits.SPE2_EIRQ */
#define IFX_GTM_ICM_IRQG_SPE_CEI_SPE2_EIRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_SPE_CEI_Bits.SPE2_EIRQ */
#define IFX_GTM_ICM_IRQG_SPE_CEI_SPE2_EIRQ_OFF            (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_SPE_CEI_Bits.SPE3_EIRQ */
#define IFX_GTM_ICM_IRQG_SPE_CEI_SPE3_EIRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_SPE_CEI_Bits.SPE3_EIRQ */
#define IFX_GTM_ICM_IRQG_SPE_CEI_SPE3_EIRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_SPE_CEI_Bits.SPE3_EIRQ */
#define IFX_GTM_ICM_IRQG_SPE_CEI_SPE3_EIRQ_OFF            (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_SPE_CEI_Bits.SPE4_EIRQ */
#define IFX_GTM_ICM_IRQG_SPE_CEI_SPE4_EIRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_SPE_CEI_Bits.SPE4_EIRQ */
#define IFX_GTM_ICM_IRQG_SPE_CEI_SPE4_EIRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_SPE_CEI_Bits.SPE4_EIRQ */
#define IFX_GTM_ICM_IRQG_SPE_CEI_SPE4_EIRQ_OFF            (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_SPE_CEI_Bits.SPE5_EIRQ */
#define IFX_GTM_ICM_IRQG_SPE_CEI_SPE5_EIRQ_LEN            (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_SPE_CEI_Bits.SPE5_EIRQ */
#define IFX_GTM_ICM_IRQG_SPE_CEI_SPE5_EIRQ_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_SPE_CEI_Bits.SPE5_EIRQ */
#define IFX_GTM_ICM_IRQG_SPE_CEI_SPE5_EIRQ_OFF            (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE0_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE0_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE0_IRQ_OFF              (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE1_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE1_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE1_IRQ_OFF              (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE2_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE2_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE2_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE2_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE2_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE2_IRQ_OFF              (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE3_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE3_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE3_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE3_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE3_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE3_IRQ_OFF              (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE4_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE4_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE4_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE4_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE4_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE4_IRQ_OFF              (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE5_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE5_IRQ_LEN              (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE5_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE5_IRQ_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_SPE_CI_Bits.SPE5_IRQ */
#define IFX_GTM_ICM_IRQG_SPE_CI_SPE5_IRQ_OFF              (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_0_CI_Bits.TOM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_0_CI_TOM_M0_CH0_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_0_CI_Bits.TOM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_0_CI_TOM_M0_CH0_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_0_CI_Bits.TOM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_0_CI_TOM_M0_CH0_IRQ_OFF      (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_0_CI_Bits.TOM_M0_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_0_CI_TOM_M0_CH10_IRQ_LEN     (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_0_CI_Bits.TOM_M0_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_0_CI_TOM_M0_CH10_IRQ_MSK     (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_0_CI_Bits.TOM_M0_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_0_CI_TOM_M0_CH10_IRQ_OFF     (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_0_CI_Bits.TOM_M0_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_0_CI_TOM_M0_CH11_IRQ_LEN     (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_0_CI_Bits.TOM_M0_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_0_CI_TOM_M0_CH11_IRQ_MSK     (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_0_CI_Bits.TOM_M0_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_0_CI_TOM_M0_CH11_IRQ_OFF     (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_0_CI_Bits.TOM_M0_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_0_CI_TOM_M0_CH12_IRQ_LEN     (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_0_CI_Bits.TOM_M0_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_0_CI_TOM_M0_CH12_IRQ_MSK     (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_0_CI_Bits.TOM_M0_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_0_CI_TOM_M0_CH12_IRQ_OFF     (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_0_CI_Bits.TOM_M0_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_0_CI_TOM_M0_CH13_IRQ_LEN     (1)

