Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH13_IRQ_OFF     (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH14_IRQ_LEN     (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH14_IRQ_MSK     (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH14_IRQ_OFF     (14)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH15_IRQ_LEN     (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH15_IRQ_MSK     (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH15_IRQ_OFF     (15)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH1_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH1_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH1_IRQ_OFF      (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH2_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH2_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH2_IRQ_OFF      (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH3_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH3_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH3_IRQ_OFF      (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH4_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH4_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH4_IRQ_OFF      (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH5_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH5_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH5_IRQ_OFF      (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH6_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH6_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH6_IRQ_OFF      (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH7_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH7_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH7_IRQ_OFF      (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH8_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH8_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH8_IRQ_OFF      (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH9_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH9_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M0_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M0_CH9_IRQ_OFF      (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH0_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH0_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH0_IRQ_OFF      (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH10_IRQ_LEN     (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH10_IRQ_MSK     (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH10_IRQ_OFF     (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH11_IRQ_LEN     (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH11_IRQ_MSK     (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH11_IRQ_OFF     (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH12_IRQ_LEN     (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH12_IRQ_MSK     (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH12_IRQ_OFF     (28)

