Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH13_IRQ_LEN     (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH13_IRQ_MSK     (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH13_IRQ_OFF     (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH14_IRQ_LEN     (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH14_IRQ_MSK     (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH14_IRQ_OFF     (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH15_IRQ_LEN     (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH15_IRQ_MSK     (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH15_IRQ_OFF     (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH1_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH1_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH1_IRQ_OFF      (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH2_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH2_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH2_IRQ_OFF      (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH3_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH3_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH3_IRQ_OFF      (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH4_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH4_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH4_IRQ_OFF      (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH5_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH5_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH5_IRQ_OFF      (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH6_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH6_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH6_IRQ_OFF      (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH7_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH7_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH7_IRQ_OFF      (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH8_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH8_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH8_IRQ_OFF      (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH9_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH9_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_1_CI_Bits.TOM_M1_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_1_CI_TOM_M1_CH9_IRQ_OFF      (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_2_CI_Bits.TOM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_2_CI_TOM_M0_CH0_IRQ_LEN      (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_2_CI_Bits.TOM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_2_CI_TOM_M0_CH0_IRQ_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_2_CI_Bits.TOM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_2_CI_TOM_M0_CH0_IRQ_OFF      (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_2_CI_Bits.TOM_M0_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_2_CI_TOM_M0_CH10_IRQ_LEN     (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_2_CI_Bits.TOM_M0_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_2_CI_TOM_M0_CH10_IRQ_MSK     (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_2_CI_Bits.TOM_M0_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_2_CI_TOM_M0_CH10_IRQ_OFF     (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_TOM_2_CI_Bits.TOM_M0_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_2_CI_TOM_M0_CH11_IRQ_LEN     (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_TOM_2_CI_Bits.TOM_M0_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_2_CI_TOM_M0_CH11_IRQ_MSK     (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_TOM_2_CI_Bits.TOM_M0_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_TOM_2_CI_TOM_M0_CH11_IRQ_OFF     (11)

