Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN28 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN28_OFF                  (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN29 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN29_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN29 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN29_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN29 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN29_OFF                  (29)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN2 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN2_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN2 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN2_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN2 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN2_OFF                   (2)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN30 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN30_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN30 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN30_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN30 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN30_OFF                  (30)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN31 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN31_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN31 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN31_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN31 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN31_OFF                  (31)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN3 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN3_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN3 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN3_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN3 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN3_OFF                   (3)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN4 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN4_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN4 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN4_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN4 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN4_OFF                   (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN5 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN5_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN5 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN5_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN5 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN5_OFF                   (5)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN6 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN6_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN6 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN6_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN6 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN6_OFF                   (6)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN7 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN7_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN7 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN7_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN7 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN7_OFF                   (7)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN8 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN8_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN8 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN8_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN8 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN8_OFF                   (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN9 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN9_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN9 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN9_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ACCEN0_Bits.EN9 */
#define IFX_GTM_INOUTSEL_ACCEN0_EN9_OFF                   (9)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL0_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL0_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL0_OFF           (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL1_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL1_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL1_OFF           (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL2_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL2_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL2_OFF           (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL3_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL3_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL3_OFF           (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL4_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL4_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL4_OFF           (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL5_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL5_MSK           (0xf)

