Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL5_OFF           (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL6_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL6_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL6_OFF           (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL7_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL7_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT00_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT00_SEL7_OFF           (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT01_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT01_SEL0_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT01_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT01_SEL0_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT01_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT01_SEL0_OFF           (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT01_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT01_SEL1_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT01_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT01_SEL1_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT01_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT01_SEL1_OFF           (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT01_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT01_SEL2_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT01_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT01_SEL2_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT01_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT01_SEL2_OFF           (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT01_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT01_SEL3_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT01_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT01_SEL3_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT01_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT01_SEL3_OFF           (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL0_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL0_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL0_OFF           (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL1_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL1_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL1_OFF           (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL2_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL2_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL2_OFF           (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL3_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL3_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL3_OFF           (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL4_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL4_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL4_OFF           (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL5_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL5_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL5_OFF           (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL6_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL6_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL6_OFF           (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL7_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL7_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT10_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT10_SEL7_OFF           (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT11_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT11_SEL0_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT11_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT11_SEL0_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT11_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT11_SEL0_OFF           (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT11_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT11_SEL1_LEN           (4)

