Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT11_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT11_SEL1_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT11_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT11_SEL1_OFF           (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT11_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT11_SEL2_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT11_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT11_SEL2_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT11_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT11_SEL2_OFF           (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT11_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT11_SEL3_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT11_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT11_SEL3_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT11_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT11_SEL3_OFF           (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL0_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL0_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL0_OFF           (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL1_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL1_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL1_OFF           (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL2_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL2_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL2_OFF           (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL3_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL3_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL3_OFF           (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL4_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL4_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL4_OFF           (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL5_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL5_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL5_OFF           (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL6_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL6_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL6_OFF           (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL7_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL7_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT20_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT20_SEL7_OFF           (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT21_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT21_SEL0_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT21_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT21_SEL0_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT21_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT21_SEL0_OFF           (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT21_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT21_SEL1_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT21_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT21_SEL1_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT21_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT21_SEL1_OFF           (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT21_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT21_SEL2_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT21_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT21_SEL2_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT21_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT21_SEL2_OFF           (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT21_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT21_SEL3_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT21_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT21_SEL3_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT21_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT21_SEL3_OFF           (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL0_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL0_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL0_OFF           (0)

