Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL1_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL1_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL1_OFF           (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL2_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL2_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL2_OFF           (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL3_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL3_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL3_OFF           (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL4_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL4_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL4_OFF           (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL5_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL5_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL5_OFF           (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL6_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL6_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL6_OFF           (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL7_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL7_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT30_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT30_SEL7_OFF           (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT31_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT31_SEL0_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT31_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT31_SEL0_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT31_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT31_SEL0_OFF           (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT31_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT31_SEL1_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT31_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT31_SEL1_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT31_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT31_SEL1_OFF           (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT31_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT31_SEL2_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT31_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT31_SEL2_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT31_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT31_SEL2_OFF           (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ADCTRIG_OUT31_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT31_SEL3_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ADCTRIG_OUT31_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT31_SEL3_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ADCTRIG_OUT31_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_ADCTRIG_OUT31_SEL3_OFF           (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL0_LEN              (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL0_MSK              (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL0_OFF              (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL1_LEN              (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL1_MSK              (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL1_OFF              (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL2_LEN              (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL2_MSK              (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL2_OFF              (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL3_LEN              (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL3_MSK              (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL3_OFF              (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL4_LEN              (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL4_MSK              (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL4_OFF              (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL5_LEN              (4)

