Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL5_MSK              (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL5_OFF              (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL6_LEN              (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL6_MSK              (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL6_OFF              (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL7_LEN              (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL7_MSK              (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL7_OFF              (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DATA_IN0_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN0_DATA_LEN                (32)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DATA_IN0_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN0_DATA_MSK                (0xffffffff)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DATA_IN0_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN0_DATA_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DATA_IN1_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN1_DATA_LEN                (32)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DATA_IN1_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN1_DATA_MSK                (0xffffffff)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DATA_IN1_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN1_DATA_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DATA_IN2_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN2_DATA_LEN                (32)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DATA_IN2_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN2_DATA_MSK                (0xffffffff)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DATA_IN2_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN2_DATA_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DATA_IN3_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN3_DATA_LEN                (32)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DATA_IN3_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN3_DATA_MSK                (0xffffffff)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DATA_IN3_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN3_DATA_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DATA_IN4_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN4_DATA_LEN                (32)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DATA_IN4_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN4_DATA_MSK                (0xffffffff)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DATA_IN4_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN4_DATA_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DATA_IN5_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN5_DATA_LEN                (32)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DATA_IN5_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN5_DATA_MSK                (0xffffffff)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DATA_IN5_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN5_DATA_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DATA_IN6_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN6_DATA_LEN                (32)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DATA_IN6_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN6_DATA_MSK                (0xffffffff)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DATA_IN6_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN6_DATA_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DATA_IN7_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN7_DATA_LEN                (32)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DATA_IN7_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN7_DATA_MSK                (0xffffffff)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DATA_IN7_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN7_DATA_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DATA_IN8_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN8_DATA_LEN                (32)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DATA_IN8_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN8_DATA_MSK                (0xffffffff)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DATA_IN8_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN8_DATA_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DATA_IN9_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN9_DATA_LEN                (32)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DATA_IN9_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN9_DATA_MSK                (0xffffffff)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DATA_IN9_Bits.DATA */
#define IFX_GTM_INOUTSEL_DATA_IN9_DATA_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL0 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL0_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL0 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL0_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL0 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL0_OFF           (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL1 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL1_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL1 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL1_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL1 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL1_OFF           (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL2 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL2_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL2 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL2_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL2 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL2_OFF           (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL3 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL3_LEN           (4)

