Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL3 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL3_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL3 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL3_OFF           (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL4 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL4_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL4 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL4_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL4 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL4_OFF           (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL5 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL5_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL5 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL5_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL5 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL5_OFF           (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL6 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL6_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL6 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL6_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL6 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL6_OFF           (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL7 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL7_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL7 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL7_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL7 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL7_OFF           (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL0_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL0_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL0_OFF           (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL1_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL1_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL1_OFF           (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL2_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL2_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL2_OFF           (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL3_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL3_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL3_OFF           (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL4_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL4_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL4_OFF           (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL5_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL5_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL5_OFF           (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL6_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL6_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL6_OFF           (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL7_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL7_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL7_OFF           (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL10 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL10_LEN          (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL10 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL10_MSK          (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL10 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL10_OFF          (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL11 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL11_LEN          (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL11 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL11_MSK          (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL11 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL11_OFF          (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL12 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL12_LEN          (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL12 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL12_MSK          (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL12 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL12_OFF          (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL13 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL13_LEN          (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL13 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL13_MSK          (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL13 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL13_OFF          (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL8_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL8_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL8_OFF           (0)

