Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL9_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL9_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL9_OFF           (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS0 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS0_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS0 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS0_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS0 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS0_OFF                 (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS1 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS1_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS1 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS1_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS1 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS1_OFF                 (17)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS2 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS2_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS2 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS2_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS2 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS2_OFF                 (18)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS3 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS3_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS3 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS3_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS3 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS3_OFF                 (19)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS4 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS4_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS4 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS4_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS4 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS4_OFF                 (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS5 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS5_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS5 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS5_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS5 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS5_OFF                 (21)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS6 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS6_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS6 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS6_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS6 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS6_OFF                 (22)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS7 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS7_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS7 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS7_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS7 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS7_OFF                 (23)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS8 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS8_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS8 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS8_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS8 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS8_OFF                 (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS9 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS9_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS9 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS9_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.DSS9 */
#define IFX_GTM_INOUTSEL_DXINCON_DSS9_OFF                 (25)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN0 */
#define IFX_GTM_INOUTSEL_DXINCON_IN0_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN0 */
#define IFX_GTM_INOUTSEL_DXINCON_IN0_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN0 */
#define IFX_GTM_INOUTSEL_DXINCON_IN0_OFF                  (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN1 */
#define IFX_GTM_INOUTSEL_DXINCON_IN1_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN1 */
#define IFX_GTM_INOUTSEL_DXINCON_IN1_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN1 */
#define IFX_GTM_INOUTSEL_DXINCON_IN1_OFF                  (1)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN2 */
#define IFX_GTM_INOUTSEL_DXINCON_IN2_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN2 */
#define IFX_GTM_INOUTSEL_DXINCON_IN2_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN2 */
#define IFX_GTM_INOUTSEL_DXINCON_IN2_OFF                  (2)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN3 */
#define IFX_GTM_INOUTSEL_DXINCON_IN3_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN3 */
#define IFX_GTM_INOUTSEL_DXINCON_IN3_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN3 */
#define IFX_GTM_INOUTSEL_DXINCON_IN3_OFF                  (3)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN4 */
#define IFX_GTM_INOUTSEL_DXINCON_IN4_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN4 */
#define IFX_GTM_INOUTSEL_DXINCON_IN4_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN4 */
#define IFX_GTM_INOUTSEL_DXINCON_IN4_OFF                  (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN5 */
#define IFX_GTM_INOUTSEL_DXINCON_IN5_LEN                  (1)

