Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN5 */
#define IFX_GTM_INOUTSEL_DXINCON_IN5_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN5 */
#define IFX_GTM_INOUTSEL_DXINCON_IN5_OFF                  (5)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN6 */
#define IFX_GTM_INOUTSEL_DXINCON_IN6_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN6 */
#define IFX_GTM_INOUTSEL_DXINCON_IN6_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN6 */
#define IFX_GTM_INOUTSEL_DXINCON_IN6_OFF                  (6)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN7 */
#define IFX_GTM_INOUTSEL_DXINCON_IN7_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN7 */
#define IFX_GTM_INOUTSEL_DXINCON_IN7_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN7 */
#define IFX_GTM_INOUTSEL_DXINCON_IN7_OFF                  (7)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN8 */
#define IFX_GTM_INOUTSEL_DXINCON_IN8_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN8 */
#define IFX_GTM_INOUTSEL_DXINCON_IN8_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN8 */
#define IFX_GTM_INOUTSEL_DXINCON_IN8_OFF                  (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN9 */
#define IFX_GTM_INOUTSEL_DXINCON_IN9_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN9 */
#define IFX_GTM_INOUTSEL_DXINCON_IN9_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXINCON_Bits.IN9 */
#define IFX_GTM_INOUTSEL_DXINCON_IN9_OFF                  (9)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT0 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT0_LEN                (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT0 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT0_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT0 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT0_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT1 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT1_LEN                (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT1 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT1_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT1 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT1_OFF                (1)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT2 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT2_LEN                (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT2 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT2_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT2 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT2_OFF                (2)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT3 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT3_LEN                (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT3 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT3_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT3 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT3_OFF                (3)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT4 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT4_LEN                (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT4 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT4_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT4 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT4_OFF                (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT5 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT5_LEN                (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT5 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT5_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT5 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT5_OFF                (5)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT6 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT6_LEN                (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT6 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT6_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT6 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT6_OFF                (6)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT7 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT7_LEN                (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT7 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT7_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT7 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT7_OFF                (7)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT8 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT8_LEN                (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT8 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT8_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT8 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT8_OFF                (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT9 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT9_LEN                (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT9 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT9_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DXOUTCON_Bits.OUT9 */
#define IFX_GTM_INOUTSEL_DXOUTCON_OUT9_OFF                (9)

/** \\brief  Length for Ifx_GTM_INOUTSEL_INT_OUT0_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT0_INT0_LEN                (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_INT_OUT0_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT0_INT0_MSK                (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_INT_OUT0_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT0_INT0_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_INT_OUT1_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT1_INT0_LEN                (2)

