Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_INOUTSEL_INT_OUT1_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT1_INT0_MSK                (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_INT_OUT1_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT1_INT0_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_INT_OUT2_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT2_INT0_LEN                (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_INT_OUT2_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT2_INT0_MSK                (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_INT_OUT2_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT2_INT0_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_INT_OUT3_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT3_INT0_LEN                (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_INT_OUT3_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT3_INT0_MSK                (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_INT_OUT3_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT3_INT0_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_INT_OUT4_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT4_INT0_LEN                (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_INT_OUT4_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT4_INT0_MSK                (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_INT_OUT4_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT4_INT0_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_INT_OUT5_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT5_INT0_LEN                (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_INT_OUT5_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT5_INT0_MSK                (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_INT_OUT5_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT5_INT0_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_INT_OUT6_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT6_INT0_LEN                (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_INT_OUT6_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT6_INT0_MSK                (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_INT_OUT6_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT6_INT0_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_INT_OUT7_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT7_INT0_LEN                (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_INT_OUT7_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT7_INT0_MSK                (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_INT_OUT7_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT7_INT0_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_INT_OUT8_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT8_INT0_LEN                (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_INT_OUT8_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT8_INT0_MSK                (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_INT_OUT8_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT8_INT0_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_INT_OUT9_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT9_INT0_LEN                (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_INT_OUT9_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT9_INT0_MSK                (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_INT_OUT9_Bits.INT0 */
#define IFX_GTM_INOUTSEL_INT_OUT9_INT0_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS0 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS0_LEN               (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS0 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS0_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS0 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS0_OFF               (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS1 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS1_LEN               (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS1 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS1_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS1 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS1_OFF               (1)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS2 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS2_LEN               (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS2 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS2_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS2 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS2_OFF               (2)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS3 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS3_LEN               (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS3 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS3_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS3 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS3_OFF               (3)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS4 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS4_LEN               (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS4 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS4_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS4 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS4_OFF               (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS5 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS5_LEN               (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS5 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS5_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS5 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS5_OFF               (5)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS6 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS6_LEN               (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS6 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS6_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS6 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS6_OFF               (6)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS7 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS7_LEN               (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS7 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS7_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS7 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS7_OFF               (7)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS8 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS8_LEN               (1)

