Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS8 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS8_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS8 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS8_OFF               (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS9 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS9_LEN               (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS9 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS9_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTCLR_Bits.MCS9 */
#define IFX_GTM_INOUTSEL_MCSINTCLR_MCS9_OFF               (9)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS00 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS00_LEN             (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS00 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS00_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS00 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS00_OFF             (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS10 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS10_LEN             (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS10 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS10_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS10 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS10_OFF             (1)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS20 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS20_LEN             (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS20 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS20_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS20 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS20_OFF             (2)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS30 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS30_LEN             (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS30 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS30_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS30 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS30_OFF             (3)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS40 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS40_LEN             (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS40 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS40_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS40 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS40_OFF             (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS50 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS50_LEN             (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS50 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS50_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS50 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS50_OFF             (5)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS60 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS60_LEN             (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS60 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS60_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS60 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS60_OFF             (6)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS70 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS70_LEN             (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS70 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS70_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS70 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS70_OFF             (7)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS80 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS80_LEN             (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS80 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS80_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS80 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS80_OFF             (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS90 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS90_LEN             (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS90 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS90_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSINTSTAT_Bits.MCS90 */
#define IFX_GTM_INOUTSEL_MCSINTSTAT_MCS90_OFF             (9)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL0_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL0_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL0_OFF           (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL1_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL1_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL1_OFF           (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL2_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL2_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL2_OFF           (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL3_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL3_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL3_OFF           (12)

