Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL4_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL4_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL4_OFF           (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL5_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL5_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL5_OFF           (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL6_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL6_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL6_OFF           (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL7_LEN           (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL7_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_MCSTRIGOUTSEL_SEL7_OFF           (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL0_LEN           (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL0_MSK           (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL0_OFF           (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL10 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL10_LEN          (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL10 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL10_MSK          (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL10 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL10_OFF          (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL11 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL11_LEN          (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL11 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL11_MSK          (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL11 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL11_OFF          (22)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL12 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL12_LEN          (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL12 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL12_MSK          (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL12 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL12_OFF          (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL13 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL13_LEN          (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL13 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL13_MSK          (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL13 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL13_OFF          (26)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL14 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL14_LEN          (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL14 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL14_MSK          (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL14 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL14_OFF          (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL15 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL15_LEN          (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL15 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL15_MSK          (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL15 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL15_OFF          (30)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL1_LEN           (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL1_MSK           (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL1_OFF           (2)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL2_LEN           (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL2_MSK           (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL2_OFF           (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL3_LEN           (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL3_MSK           (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL3_OFF           (6)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL4_LEN           (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL4_MSK           (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL4_OFF           (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_IN_INHCON_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_MSC_IN_INHCON_SEL5_LEN           (2)

