Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_MSC_IN_INLEXTCON_SEL5_OFF        (10)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_MSC_IN_INLEXTCON_SEL6_LEN        (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_MSC_IN_INLEXTCON_SEL6_MSK        (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_MSC_IN_INLEXTCON_SEL6_OFF        (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_MSC_IN_INLEXTCON_SEL7_LEN        (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_MSC_IN_INLEXTCON_SEL7_MSK        (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_MSC_IN_INLEXTCON_SEL7_OFF        (14)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_MSC_IN_INLEXTCON_SEL8_LEN        (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_MSC_IN_INLEXTCON_SEL8_MSK        (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_MSC_IN_INLEXTCON_SEL8_OFF        (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_MSC_IN_INLEXTCON_SEL9_LEN        (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_MSC_IN_INLEXTCON_SEL9_MSK        (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_MSC_IN_INLEXTCON_SEL9_OFF        (18)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_SET1CON0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON0_SEL0_LEN            (5)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_SET1CON0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON0_SEL0_MSK            (0x1f)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_SET1CON0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON0_SEL0_OFF            (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_SET1CON0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON0_SEL1_LEN            (5)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_SET1CON0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON0_SEL1_MSK            (0x1f)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_SET1CON0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON0_SEL1_OFF            (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_SET1CON0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON0_SEL2_LEN            (5)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_SET1CON0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON0_SEL2_MSK            (0x1f)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_SET1CON0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON0_SEL2_OFF            (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_SET1CON0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON0_SEL3_LEN            (5)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_SET1CON0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON0_SEL3_MSK            (0x1f)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_SET1CON0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON0_SEL3_OFF            (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_SET1CON1_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON1_SEL4_LEN            (5)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_SET1CON1_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON1_SEL4_MSK            (0x1f)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_SET1CON1_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON1_SEL4_OFF            (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_SET1CON1_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON1_SEL5_LEN            (5)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_SET1CON1_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON1_SEL5_MSK            (0x1f)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_SET1CON1_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON1_SEL5_OFF            (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_SET1CON1_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON1_SEL6_LEN            (5)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_SET1CON1_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON1_SEL6_MSK            (0x1f)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_SET1CON1_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON1_SEL6_OFF            (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_SET1CON1_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON1_SEL7_LEN            (5)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_SET1CON1_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON1_SEL7_MSK            (0x1f)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_SET1CON1_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON1_SEL7_OFF            (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_SET1CON2_Bits.SEL10 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON2_SEL10_LEN           (5)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_SET1CON2_Bits.SEL10 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON2_SEL10_MSK           (0x1f)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_SET1CON2_Bits.SEL10 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON2_SEL10_OFF           (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_SET1CON2_Bits.SEL11 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON2_SEL11_LEN           (5)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_SET1CON2_Bits.SEL11 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON2_SEL11_MSK           (0x1f)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_SET1CON2_Bits.SEL11 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON2_SEL11_OFF           (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_SET1CON2_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON2_SEL8_LEN            (5)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_SET1CON2_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON2_SEL8_MSK            (0x1f)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_SET1CON2_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON2_SEL8_OFF            (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_SET1CON2_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON2_SEL9_LEN            (5)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_SET1CON2_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_MSC_SET1CON2_SEL9_MSK            (0x1f)

