Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_SET9CON3_Bits.SEL12 */
#define IFX_GTM_INOUTSEL_MSC_SET9CON3_SEL12_OFF           (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_SET9CON3_Bits.SEL13 */
#define IFX_GTM_INOUTSEL_MSC_SET9CON3_SEL13_LEN           (5)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_SET9CON3_Bits.SEL13 */
#define IFX_GTM_INOUTSEL_MSC_SET9CON3_SEL13_MSK           (0x1f)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_SET9CON3_Bits.SEL13 */
#define IFX_GTM_INOUTSEL_MSC_SET9CON3_SEL13_OFF           (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_SET9CON3_Bits.SEL14 */
#define IFX_GTM_INOUTSEL_MSC_SET9CON3_SEL14_LEN           (5)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_SET9CON3_Bits.SEL14 */
#define IFX_GTM_INOUTSEL_MSC_SET9CON3_SEL14_MSK           (0x1f)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_SET9CON3_Bits.SEL14 */
#define IFX_GTM_INOUTSEL_MSC_SET9CON3_SEL14_OFF           (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_MSC_SET9CON3_Bits.SEL15 */
#define IFX_GTM_INOUTSEL_MSC_SET9CON3_SEL15_LEN           (5)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_MSC_SET9CON3_Bits.SEL15 */
#define IFX_GTM_INOUTSEL_MSC_SET9CON3_SEL15_MSK           (0x1f)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_MSC_SET9CON3_Bits.SEL15 */
#define IFX_GTM_INOUTSEL_MSC_SET9CON3_SEL15_OFF           (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OCS_Bits.SUS */
#define IFX_GTM_INOUTSEL_OCS_SUS_LEN                      (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OCS_Bits.SUS */
#define IFX_GTM_INOUTSEL_OCS_SUS_MSK                      (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OCS_Bits.SUS */
#define IFX_GTM_INOUTSEL_OCS_SUS_OFF                      (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OCS_Bits.SUS_P */
#define IFX_GTM_INOUTSEL_OCS_SUS_P_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OCS_Bits.SUS_P */
#define IFX_GTM_INOUTSEL_OCS_SUS_P_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OCS_Bits.SUS_P */
#define IFX_GTM_INOUTSEL_OCS_SUS_P_OFF                    (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OCS_Bits.SUSSTA */
#define IFX_GTM_INOUTSEL_OCS_SUSSTA_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OCS_Bits.SUSSTA */
#define IFX_GTM_INOUTSEL_OCS_SUSSTA_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OCS_Bits.SUSSTA */
#define IFX_GTM_INOUTSEL_OCS_SUSSTA_OFF                   (29)

/** \\brief  Length for Ifx_GTM_INOUTSEL_ODA_Bits.DRAC */
#define IFX_GTM_INOUTSEL_ODA_DRAC_LEN                     (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_ODA_Bits.DRAC */
#define IFX_GTM_INOUTSEL_ODA_DRAC_MSK                     (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_ODA_Bits.DRAC */
#define IFX_GTM_INOUTSEL_ODA_DRAC_OFF                     (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTBU0T_Bits.CM */
#define IFX_GTM_INOUTSEL_OTBU0T_CM_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTBU0T_Bits.CM */
#define IFX_GTM_INOUTSEL_OTBU0T_CM_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTBU0T_Bits.CM */
#define IFX_GTM_INOUTSEL_OTBU0T_CM_OFF                    (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTBU0T_Bits.CV */
#define IFX_GTM_INOUTSEL_OTBU0T_CV_LEN                    (27)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTBU0T_Bits.CV */
#define IFX_GTM_INOUTSEL_OTBU0T_CV_MSK                    (0x7ffffff)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTBU0T_Bits.CV */
#define IFX_GTM_INOUTSEL_OTBU0T_CV_OFF                    (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTBU1T_Bits.CV */
#define IFX_GTM_INOUTSEL_OTBU1T_CV_LEN                    (24)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTBU1T_Bits.CV */
#define IFX_GTM_INOUTSEL_OTBU1T_CV_MSK                    (0xffffff)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTBU1T_Bits.CV */
#define IFX_GTM_INOUTSEL_OTBU1T_CV_OFF                    (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTBU1T_Bits.EN */
#define IFX_GTM_INOUTSEL_OTBU1T_EN_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTBU1T_Bits.EN */
#define IFX_GTM_INOUTSEL_OTBU1T_EN_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTBU1T_Bits.EN */
#define IFX_GTM_INOUTSEL_OTBU1T_EN_OFF                    (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTBU2T_Bits.CV */
#define IFX_GTM_INOUTSEL_OTBU2T_CV_LEN                    (24)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTBU2T_Bits.CV */
#define IFX_GTM_INOUTSEL_OTBU2T_CV_MSK                    (0xffffff)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTBU2T_Bits.CV */
#define IFX_GTM_INOUTSEL_OTBU2T_CV_OFF                    (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTBU2T_Bits.EN */
#define IFX_GTM_INOUTSEL_OTBU2T_EN_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTBU2T_Bits.EN */
#define IFX_GTM_INOUTSEL_OTBU2T_EN_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTBU2T_Bits.EN */
#define IFX_GTM_INOUTSEL_OTBU2T_EN_OFF                    (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTSC0_Bits.B0HMI */
#define IFX_GTM_INOUTSEL_OTSC0_B0HMI_LEN                  (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTSC0_Bits.B0HMI */
#define IFX_GTM_INOUTSEL_OTSC0_B0HMI_MSK                  (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTSC0_Bits.B0HMI */
#define IFX_GTM_INOUTSEL_OTSC0_B0HMI_OFF                  (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTSC0_Bits.B0HMT */
#define IFX_GTM_INOUTSEL_OTSC0_B0HMT_LEN                  (3)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTSC0_Bits.B0HMT */
#define IFX_GTM_INOUTSEL_OTSC0_B0HMT_MSK                  (0x7)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTSC0_Bits.B0HMT */
#define IFX_GTM_INOUTSEL_OTSC0_B0HMT_OFF                  (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTSC0_Bits.B0LMI */
#define IFX_GTM_INOUTSEL_OTSC0_B0LMI_LEN                  (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTSC0_Bits.B0LMI */
#define IFX_GTM_INOUTSEL_OTSC0_B0LMI_MSK                  (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTSC0_Bits.B0LMI */
#define IFX_GTM_INOUTSEL_OTSC0_B0LMI_OFF                  (4)

