Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_INOUTSEL_OTSC0_Bits.B0LMT */
#define IFX_GTM_INOUTSEL_OTSC0_B0LMT_LEN                  (3)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTSC0_Bits.B0LMT */
#define IFX_GTM_INOUTSEL_OTSC0_B0LMT_MSK                  (0x7)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTSC0_Bits.B0LMT */
#define IFX_GTM_INOUTSEL_OTSC0_B0LMT_OFF                  (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTSC0_Bits.B1HMI */
#define IFX_GTM_INOUTSEL_OTSC0_B1HMI_LEN                  (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTSC0_Bits.B1HMI */
#define IFX_GTM_INOUTSEL_OTSC0_B1HMI_MSK                  (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTSC0_Bits.B1HMI */
#define IFX_GTM_INOUTSEL_OTSC0_B1HMI_OFF                  (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTSC0_Bits.B1HMT */
#define IFX_GTM_INOUTSEL_OTSC0_B1HMT_LEN                  (3)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTSC0_Bits.B1HMT */
#define IFX_GTM_INOUTSEL_OTSC0_B1HMT_MSK                  (0x7)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTSC0_Bits.B1HMT */
#define IFX_GTM_INOUTSEL_OTSC0_B1HMT_OFF                  (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTSC0_Bits.B1LMI */
#define IFX_GTM_INOUTSEL_OTSC0_B1LMI_LEN                  (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTSC0_Bits.B1LMI */
#define IFX_GTM_INOUTSEL_OTSC0_B1LMI_MSK                  (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTSC0_Bits.B1LMI */
#define IFX_GTM_INOUTSEL_OTSC0_B1LMI_OFF                  (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTSC0_Bits.B1LMT */
#define IFX_GTM_INOUTSEL_OTSC0_B1LMT_LEN                  (3)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTSC0_Bits.B1LMT */
#define IFX_GTM_INOUTSEL_OTSC0_B1LMT_MSK                  (0x7)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTSC0_Bits.B1LMT */
#define IFX_GTM_INOUTSEL_OTSC0_B1LMT_OFF                  (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTSC1_Bits.MCS */
#define IFX_GTM_INOUTSEL_OTSC1_MCS_LEN                    (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTSC1_Bits.MCS */
#define IFX_GTM_INOUTSEL_OTSC1_MCS_MSK                    (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTSC1_Bits.MCS */
#define IFX_GTM_INOUTSEL_OTSC1_MCS_OFF                    (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTSC1_Bits.MI */
#define IFX_GTM_INOUTSEL_OTSC1_MI_LEN                     (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTSC1_Bits.MI */
#define IFX_GTM_INOUTSEL_OTSC1_MI_MSK                     (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTSC1_Bits.MI */
#define IFX_GTM_INOUTSEL_OTSC1_MI_OFF                     (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTSC1_Bits.MOE */
#define IFX_GTM_INOUTSEL_OTSC1_MOE_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTSC1_Bits.MOE */
#define IFX_GTM_INOUTSEL_OTSC1_MOE_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTSC1_Bits.MOE */
#define IFX_GTM_INOUTSEL_OTSC1_MOE_OFF                    (9)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTSS_Bits.OTGB0 */
#define IFX_GTM_INOUTSEL_OTSS_OTGB0_LEN                   (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTSS_Bits.OTGB0 */
#define IFX_GTM_INOUTSEL_OTSS_OTGB0_MSK                   (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTSS_Bits.OTGB0 */
#define IFX_GTM_INOUTSEL_OTSS_OTGB0_OFF                   (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTSS_Bits.OTGB1 */
#define IFX_GTM_INOUTSEL_OTSS_OTGB1_LEN                   (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTSS_Bits.OTGB1 */
#define IFX_GTM_INOUTSEL_OTSS_OTGB1_MSK                   (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTSS_Bits.OTGB1 */
#define IFX_GTM_INOUTSEL_OTSS_OTGB1_OFF                   (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTSS_Bits.OTGBM0 */
#define IFX_GTM_INOUTSEL_OTSS_OTGBM0_LEN                  (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTSS_Bits.OTGBM0 */
#define IFX_GTM_INOUTSEL_OTSS_OTGBM0_MSK                  (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTSS_Bits.OTGBM0 */
#define IFX_GTM_INOUTSEL_OTSS_OTGBM0_OFF                  (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_OTSS_Bits.OTGBM1 */
#define IFX_GTM_INOUTSEL_OTSS_OTGBM1_LEN                  (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_OTSS_Bits.OTGBM1 */
#define IFX_GTM_INOUTSEL_OTSS_OTGBM1_MSK                  (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_OTSS_Bits.OTGBM1 */
#define IFX_GTM_INOUTSEL_OTSS_OTGBM1_OFF                  (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL0_LEN              (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL0_MSK              (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL0_OFF              (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL1_LEN              (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL1_MSK              (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL1_OFF              (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL2_LEN              (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL2_MSK              (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL2_OFF              (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL3_LEN              (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL3_MSK              (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL3_OFF              (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL4_LEN              (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL4_MSK              (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL4_OFF              (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL5_LEN              (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL5_MSK              (0xf)

