Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_PSI5OUTSEL_SEL5_OFF              (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL0_LEN            (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL0_MSK            (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL0_OFF            (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL1_LEN            (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL1_MSK            (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL1_OFF            (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL2_LEN            (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL2_MSK            (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL2_OFF            (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL3_LEN            (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL3_MSK            (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL3_OFF            (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL4_LEN            (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL4_MSK            (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL4_OFF            (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL5_LEN            (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL5_MSK            (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL5_OFF            (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL6_LEN            (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL6_MSK            (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL6_OFF            (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL7_LEN            (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL7_MSK            (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL7_OFF            (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_RESET1_Bits.RST */
#define IFX_GTM_INOUTSEL_RESET1_RST_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_RESET1_Bits.RST */
#define IFX_GTM_INOUTSEL_RESET1_RST_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_RESET1_Bits.RST */
#define IFX_GTM_INOUTSEL_RESET1_RST_OFF                   (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_RESET1_Bits.RSTSTAT */
#define IFX_GTM_INOUTSEL_RESET1_RSTSTAT_LEN               (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_RESET1_Bits.RSTSTAT */
#define IFX_GTM_INOUTSEL_RESET1_RSTSTAT_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_RESET1_Bits.RSTSTAT */
#define IFX_GTM_INOUTSEL_RESET1_RSTSTAT_OFF               (1)

/** \\brief  Length for Ifx_GTM_INOUTSEL_RESET2_Bits.RST */
#define IFX_GTM_INOUTSEL_RESET2_RST_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_RESET2_Bits.RST */
#define IFX_GTM_INOUTSEL_RESET2_RST_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_RESET2_Bits.RST */
#define IFX_GTM_INOUTSEL_RESET2_RST_OFF                   (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_RESET_CLR_Bits.CLR */
#define IFX_GTM_INOUTSEL_RESET_CLR_CLR_LEN                (1)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_RESET_CLR_Bits.CLR */
#define IFX_GTM_INOUTSEL_RESET_CLR_CLR_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_RESET_CLR_Bits.CLR */
#define IFX_GTM_INOUTSEL_RESET_CLR_CLR_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL0_LEN                (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL0_MSK                (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL0_OFF                (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL1_LEN                (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL1_MSK                (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL1_OFF                (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL2_LEN                (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL2_MSK                (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL2_OFF                (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL3_LEN                (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL3_MSK                (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL3_OFF                (12)

