Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL4_LEN                (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL4_MSK                (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL4_OFF                (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL5_LEN                (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL5_MSK                (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL5_OFF                (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL6_LEN                (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL6_MSK                (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL6_OFF                (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL7_LEN                (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL7_MSK                (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL7_OFF                (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH0SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH0SEL_LEN             (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH0SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH0SEL_MSK             (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH0SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH0SEL_OFF             (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH1SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH1SEL_LEN             (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH1SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH1SEL_MSK             (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH1SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH1SEL_OFF             (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH2SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH2SEL_LEN             (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH2SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH2SEL_MSK             (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH2SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH2SEL_OFF             (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH3SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH3SEL_LEN             (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH3SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH3SEL_MSK             (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH3SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH3SEL_OFF             (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH4SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH4SEL_LEN             (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH4SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH4SEL_MSK             (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH4SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH4SEL_OFF             (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH5SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH5SEL_LEN             (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH5SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH5SEL_MSK             (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH5SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH5SEL_OFF             (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH6SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH6SEL_LEN             (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH6SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH6SEL_MSK             (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH6SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH6SEL_OFF             (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH7SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH7SEL_LEN             (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH7SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH7SEL_MSK             (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH7SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH7SEL_OFF             (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits.TRIG0 */
#define IFX_GTM_INOUTSEL_TRIG_OUT0_TRIG0_LEN              (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits.TRIG0 */
#define IFX_GTM_INOUTSEL_TRIG_OUT0_TRIG0_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits.TRIG0 */
#define IFX_GTM_INOUTSEL_TRIG_OUT0_TRIG0_OFF              (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits.TRIG10 */
#define IFX_GTM_INOUTSEL_TRIG_OUT0_TRIG10_LEN             (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits.TRIG10 */
#define IFX_GTM_INOUTSEL_TRIG_OUT0_TRIG10_MSK             (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits.TRIG10 */
#define IFX_GTM_INOUTSEL_TRIG_OUT0_TRIG10_OFF             (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits.TRIG11 */
#define IFX_GTM_INOUTSEL_TRIG_OUT0_TRIG11_LEN             (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits.TRIG11 */
#define IFX_GTM_INOUTSEL_TRIG_OUT0_TRIG11_MSK             (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits.TRIG11 */
#define IFX_GTM_INOUTSEL_TRIG_OUT0_TRIG11_OFF             (22)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits.TRIG12 */
#define IFX_GTM_INOUTSEL_TRIG_OUT0_TRIG12_LEN             (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits.TRIG12 */
#define IFX_GTM_INOUTSEL_TRIG_OUT0_TRIG12_MSK             (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits.TRIG12 */
#define IFX_GTM_INOUTSEL_TRIG_OUT0_TRIG12_OFF             (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits.TRIG13 */
#define IFX_GTM_INOUTSEL_TRIG_OUT0_TRIG13_LEN             (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits.TRIG13 */
#define IFX_GTM_INOUTSEL_TRIG_OUT0_TRIG13_MSK             (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT0_Bits.TRIG13 */
#define IFX_GTM_INOUTSEL_TRIG_OUT0_TRIG13_OFF             (26)

