Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG14 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG14_OFF             (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG15 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG15_LEN             (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG15 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG15_MSK             (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG15 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG15_OFF             (30)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG1 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG1_LEN              (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG1 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG1_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG1 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG1_OFF              (2)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG2 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG2_LEN              (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG2 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG2_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG2 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG2_OFF              (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG3 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG3_LEN              (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG3 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG3_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG3 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG3_OFF              (6)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG4 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG4_LEN              (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG4 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG4_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG4 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG4_OFF              (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG5 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG5_LEN              (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG5 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG5_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG5 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG5_OFF              (10)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG6 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG6_LEN              (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG6 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG6_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG6 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG6_OFF              (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG7 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG7_LEN              (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG7 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG7_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG7 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG7_OFF              (14)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG8 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG8_LEN              (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG8 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG8_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG8 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG8_OFF              (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG9 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG9_LEN              (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG9 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG9_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT2_Bits.TRIG9 */
#define IFX_GTM_INOUTSEL_TRIG_OUT2_TRIG9_OFF              (18)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG0 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG0_LEN              (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG0 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG0_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG0 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG0_OFF              (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG10 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG10_LEN             (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG10 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG10_MSK             (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG10 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG10_OFF             (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG11 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG11_LEN             (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG11 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG11_MSK             (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG11 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG11_OFF             (22)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG12 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG12_LEN             (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG12 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG12_MSK             (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG12 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG12_OFF             (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG13 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG13_LEN             (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG13 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG13_MSK             (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG13 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG13_OFF             (26)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG14 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG14_LEN             (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG14 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG14_MSK             (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG14 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG14_OFF             (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT3_Bits.TRIG15 */
#define IFX_GTM_INOUTSEL_TRIG_OUT3_TRIG15_LEN             (2)

