Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG3 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG3_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG3 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG3_OFF              (6)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG4 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG4_LEN              (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG4 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG4_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG4 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG4_OFF              (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG5 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG5_LEN              (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG5 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG5_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG5 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG5_OFF              (10)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG6 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG6_LEN              (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG6 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG6_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG6 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG6_OFF              (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG7 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG7_LEN              (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG7 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG7_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG7 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG7_OFF              (14)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG8 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG8_LEN              (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG8 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG8_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG8 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG8_OFF              (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG9 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG9_LEN              (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG9 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG9_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TRIG_OUT9_Bits.TRIG9 */
#define IFX_GTM_INOUTSEL_TRIG_OUT9_TRIG9_OFF              (18)

/** \\brief  Length for Ifx_GTM_IRQ_EN_Bits.AEI_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_IM_ADDR_IRQ_EN_LEN             (1)

/** \\brief  Mask for Ifx_GTM_IRQ_EN_Bits.AEI_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_IM_ADDR_IRQ_EN_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_EN_Bits.AEI_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_IM_ADDR_IRQ_EN_OFF             (2)

/** \\brief  Length for Ifx_GTM_IRQ_EN_Bits.AEI_TO_XPT_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_TO_XPT_IRQ_EN_LEN              (1)

/** \\brief  Mask for Ifx_GTM_IRQ_EN_Bits.AEI_TO_XPT_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_TO_XPT_IRQ_EN_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_EN_Bits.AEI_TO_XPT_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_TO_XPT_IRQ_EN_OFF              (0)

/** \\brief  Length for Ifx_GTM_IRQ_EN_Bits.AEI_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_ADDR_IRQ_EN_LEN            (1)

/** \\brief  Mask for Ifx_GTM_IRQ_EN_Bits.AEI_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_ADDR_IRQ_EN_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_EN_Bits.AEI_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_ADDR_IRQ_EN_OFF            (1)

/** \\brief  Length for Ifx_GTM_IRQ_EN_Bits.AEI_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_BE_IRQ_EN_LEN              (1)

/** \\brief  Mask for Ifx_GTM_IRQ_EN_Bits.AEI_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_BE_IRQ_EN_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_EN_Bits.AEI_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_BE_IRQ_EN_OFF              (3)

/** \\brief  Length for Ifx_GTM_IRQ_EN_Bits.AEIM_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_IM_ADDR_IRQ_EN_LEN            (1)

/** \\brief  Mask for Ifx_GTM_IRQ_EN_Bits.AEIM_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_IM_ADDR_IRQ_EN_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_EN_Bits.AEIM_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_IM_ADDR_IRQ_EN_OFF            (5)

/** \\brief  Length for Ifx_GTM_IRQ_EN_Bits.AEIM_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_USP_ADDR_IRQ_EN_LEN           (1)

/** \\brief  Mask for Ifx_GTM_IRQ_EN_Bits.AEIM_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_USP_ADDR_IRQ_EN_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_EN_Bits.AEIM_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_USP_ADDR_IRQ_EN_OFF           (4)

/** \\brief  Length for Ifx_GTM_IRQ_EN_Bits.AEIM_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_USP_BE_IRQ_EN_LEN             (1)

/** \\brief  Mask for Ifx_GTM_IRQ_EN_Bits.AEIM_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_USP_BE_IRQ_EN_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_EN_Bits.AEIM_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_USP_BE_IRQ_EN_OFF             (6)

/** \\brief  Length for Ifx_GTM_IRQ_EN_Bits.CLK_EN_ERR_IRQ_EN */
#define IFX_GTM_IRQ_EN_CLK_EN_ERR_IRQ_EN_LEN              (1)

/** \\brief  Mask for Ifx_GTM_IRQ_EN_Bits.CLK_EN_ERR_IRQ_EN */
#define IFX_GTM_IRQ_EN_CLK_EN_ERR_IRQ_EN_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_EN_Bits.CLK_EN_ERR_IRQ_EN */
#define IFX_GTM_IRQ_EN_CLK_EN_ERR_IRQ_EN_OFF              (7)

/** \\brief  Length for Ifx_GTM_IRQ_EN_Bits.CLK_PER_ERR_IRQ_EN */
#define IFX_GTM_IRQ_EN_CLK_PER_ERR_IRQ_EN_LEN             (1)

/** \\brief  Mask for Ifx_GTM_IRQ_EN_Bits.CLK_PER_ERR_IRQ_EN */
#define IFX_GTM_IRQ_EN_CLK_PER_ERR_IRQ_EN_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_EN_Bits.CLK_PER_ERR_IRQ_EN */
#define IFX_GTM_IRQ_EN_CLK_PER_ERR_IRQ_EN_OFF             (8)

