Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_ERR */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_ERR_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_ERR */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_ERR_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_ERR */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_ERR_OFF                 (7)

/** \\brief  Length for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_ERR_STATE */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_ERR_STATE_LEN           (4)

/** \\brief  Mask for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_ERR_STATE */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_ERR_STATE_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_ERR_STATE */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_ERR_STATE_OFF           (24)

/** \\brief  Length for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_EXP_STATE */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_EXP_STATE_LEN           (4)

/** \\brief  Mask for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_EXP_STATE */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_EXP_STATE_MSK           (0xf)

/** \\brief  Offset for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_EXP_STATE */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_EXP_STATE_OFF           (28)

/** \\brief  Length for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_PER_ERR */
#define IFX_GTM_IRQ_NOTIFY_CLK_PER_ERR_LEN                (1)

/** \\brief  Mask for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_PER_ERR */
#define IFX_GTM_IRQ_NOTIFY_CLK_PER_ERR_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_PER_ERR */
#define IFX_GTM_IRQ_NOTIFY_CLK_PER_ERR_OFF                (8)

/** \\brief  Length for Ifx_GTM_LCDCDCOUTSEL_Bits.SEL */
#define IFX_GTM_LCDCDCOUTSEL_SEL_LEN                      (4)

/** \\brief  Mask for Ifx_GTM_LCDCDCOUTSEL_Bits.SEL */
#define IFX_GTM_LCDCDCOUTSEL_SEL_MSK                      (0xf)

/** \\brief  Offset for Ifx_GTM_LCDCDCOUTSEL_Bits.SEL */
#define IFX_GTM_LCDCDCOUTSEL_SEL_OFF                      (0)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.LSEL */
#define IFX_GTM_MAP_CTRL_LSEL_LEN                         (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.LSEL */
#define IFX_GTM_MAP_CTRL_LSEL_MSK                         (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.LSEL */
#define IFX_GTM_MAP_CTRL_LSEL_OFF                         (4)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.SSL */
#define IFX_GTM_MAP_CTRL_SSL_LEN                          (3)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.SSL */
#define IFX_GTM_MAP_CTRL_SSL_MSK                          (0x7)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.SSL */
#define IFX_GTM_MAP_CTRL_SSL_OFF                          (1)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSEL */
#define IFX_GTM_MAP_CTRL_TSEL_LEN                         (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSEL */
#define IFX_GTM_MAP_CTRL_TSEL_MSK                         (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSEL */
#define IFX_GTM_MAP_CTRL_TSEL_OFF                         (0)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP0_DLD */
#define IFX_GTM_MAP_CTRL_TSPP0_DLD_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP0_DLD */
#define IFX_GTM_MAP_CTRL_TSPP0_DLD_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP0_DLD */
#define IFX_GTM_MAP_CTRL_TSPP0_DLD_OFF                    (17)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP0_EN */
#define IFX_GTM_MAP_CTRL_TSPP0_EN_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP0_EN */
#define IFX_GTM_MAP_CTRL_TSPP0_EN_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP0_EN */
#define IFX_GTM_MAP_CTRL_TSPP0_EN_OFF                     (16)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I0V */
#define IFX_GTM_MAP_CTRL_TSPP0_I0V_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I0V */
#define IFX_GTM_MAP_CTRL_TSPP0_I0V_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I0V */
#define IFX_GTM_MAP_CTRL_TSPP0_I0V_OFF                    (20)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I1V */
#define IFX_GTM_MAP_CTRL_TSPP0_I1V_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I1V */
#define IFX_GTM_MAP_CTRL_TSPP0_I1V_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I1V */
#define IFX_GTM_MAP_CTRL_TSPP0_I1V_OFF                    (21)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I2V */
#define IFX_GTM_MAP_CTRL_TSPP0_I2V_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I2V */
#define IFX_GTM_MAP_CTRL_TSPP0_I2V_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I2V */
#define IFX_GTM_MAP_CTRL_TSPP0_I2V_OFF                    (22)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP1_DLD */
#define IFX_GTM_MAP_CTRL_TSPP1_DLD_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP1_DLD */
#define IFX_GTM_MAP_CTRL_TSPP1_DLD_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP1_DLD */
#define IFX_GTM_MAP_CTRL_TSPP1_DLD_OFF                    (25)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP1_EN */
#define IFX_GTM_MAP_CTRL_TSPP1_EN_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP1_EN */
#define IFX_GTM_MAP_CTRL_TSPP1_EN_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP1_EN */
#define IFX_GTM_MAP_CTRL_TSPP1_EN_OFF                     (24)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I0V */
#define IFX_GTM_MAP_CTRL_TSPP1_I0V_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I0V */
#define IFX_GTM_MAP_CTRL_TSPP1_I0V_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I0V */
#define IFX_GTM_MAP_CTRL_TSPP1_I0V_OFF                    (28)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I1V */
#define IFX_GTM_MAP_CTRL_TSPP1_I1V_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I1V */
#define IFX_GTM_MAP_CTRL_TSPP1_I1V_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I1V */
#define IFX_GTM_MAP_CTRL_TSPP1_I1V_OFF                    (29)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I2V */
#define IFX_GTM_MAP_CTRL_TSPP1_I2V_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I2V */
#define IFX_GTM_MAP_CTRL_TSPP1_I2V_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I2V */
#define IFX_GTM_MAP_CTRL_TSPP1_I2V_OFF                    (30)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM0 */
#define IFX_GTM_MCFG_CTRL_MEM0_LEN                        (2)

