Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM0 */
#define IFX_GTM_MCFG_CTRL_MEM0_MSK                        (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM0 */
#define IFX_GTM_MCFG_CTRL_MEM0_OFF                        (0)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM1 */
#define IFX_GTM_MCFG_CTRL_MEM1_LEN                        (2)

/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM1 */
#define IFX_GTM_MCFG_CTRL_MEM1_MSK                        (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM1 */
#define IFX_GTM_MCFG_CTRL_MEM1_OFF                        (2)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM2 */
#define IFX_GTM_MCFG_CTRL_MEM2_LEN                        (2)

/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM2 */
#define IFX_GTM_MCFG_CTRL_MEM2_MSK                        (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM2 */
#define IFX_GTM_MCFG_CTRL_MEM2_OFF                        (4)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM3 */
#define IFX_GTM_MCFG_CTRL_MEM3_LEN                        (2)

/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM3 */
#define IFX_GTM_MCFG_CTRL_MEM3_MSK                        (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM3 */
#define IFX_GTM_MCFG_CTRL_MEM3_OFF                        (6)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM4 */
#define IFX_GTM_MCFG_CTRL_MEM4_LEN                        (2)

/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM4 */
#define IFX_GTM_MCFG_CTRL_MEM4_MSK                        (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM4 */
#define IFX_GTM_MCFG_CTRL_MEM4_OFF                        (8)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM5 */
#define IFX_GTM_MCFG_CTRL_MEM5_LEN                        (2)

/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM5 */
#define IFX_GTM_MCFG_CTRL_MEM5_MSK                        (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM5 */
#define IFX_GTM_MCFG_CTRL_MEM5_OFF                        (10)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM6 */
#define IFX_GTM_MCFG_CTRL_MEM6_LEN                        (2)

/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM6 */
#define IFX_GTM_MCFG_CTRL_MEM6_MSK                        (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM6 */
#define IFX_GTM_MCFG_CTRL_MEM6_OFF                        (12)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM7 */
#define IFX_GTM_MCFG_CTRL_MEM7_LEN                        (2)

/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM7 */
#define IFX_GTM_MCFG_CTRL_MEM7_MSK                        (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM7 */
#define IFX_GTM_MCFG_CTRL_MEM7_OFF                        (14)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM8 */
#define IFX_GTM_MCFG_CTRL_MEM8_LEN                        (2)

/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM8 */
#define IFX_GTM_MCFG_CTRL_MEM8_MSK                        (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM8 */
#define IFX_GTM_MCFG_CTRL_MEM8_OFF                        (16)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM9 */
#define IFX_GTM_MCFG_CTRL_MEM9_LEN                        (2)

/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM9 */
#define IFX_GTM_MCFG_CTRL_MEM9_MSK                        (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM9 */
#define IFX_GTM_MCFG_CTRL_MEM9_OFF                        (18)

/** \\brief  Length for Ifx_GTM_MCS2DPLL_DEB_Bits.DATA */
#define IFX_GTM_MCS2DPLL_DEB_DATA_LEN                     (24)

/** \\brief  Mask for Ifx_GTM_MCS2DPLL_DEB_Bits.DATA */
#define IFX_GTM_MCS2DPLL_DEB_DATA_MSK                     (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS2DPLL_DEB_Bits.DATA */
#define IFX_GTM_MCS2DPLL_DEB_DATA_OFF                     (0)

/** \\brief  Length for Ifx_GTM_MCS2DPLL_DEB_Bits.na */
#define IFX_GTM_MCS2DPLL_DEB_NA_LEN                       (8)

/** \\brief  Mask for Ifx_GTM_MCS2DPLL_DEB_Bits.na */
#define IFX_GTM_MCS2DPLL_DEB_NA_MSK                       (0xff)

/** \\brief  Offset for Ifx_GTM_MCS2DPLL_DEB_Bits.na */
#define IFX_GTM_MCS2DPLL_DEB_NA_OFF                       (24)

/** \\brief  Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS0 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS0_LEN                  (2)

/** \\brief  Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS0 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS0_MSK                  (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS0 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS0_OFF                  (0)

/** \\brief  Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS10 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS10_LEN                 (2)

/** \\brief  Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS10 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS10_MSK                 (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS10 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS10_OFF                 (20)

/** \\brief  Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS11 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS11_LEN                 (2)

/** \\brief  Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS11 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS11_MSK                 (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS11 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS11_OFF                 (22)

/** \\brief  Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS1 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS1_LEN                  (2)

/** \\brief  Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS1 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS1_MSK                  (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS1 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS1_OFF                  (2)

/** \\brief  Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS2 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS2_LEN                  (2)

/** \\brief  Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS2 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS2_MSK                  (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS2 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS2_OFF                  (4)

/** \\brief  Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS3 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS3_LEN                  (2)

/** \\brief  Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS3 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS3_MSK                  (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS3 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS3_OFF                  (6)

/** \\brief  Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS4 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS4_LEN                  (2)

