Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS4 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS4_MSK                  (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS4 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS4_OFF                  (8)

/** \\brief  Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS5 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS5_LEN                  (2)

/** \\brief  Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS5 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS5_MSK                  (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS5 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS5_OFF                  (10)

/** \\brief  Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS6 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS6_LEN                  (2)

/** \\brief  Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS6 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS6_MSK                  (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS6 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS6_OFF                  (12)

/** \\brief  Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS7 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS7_LEN                  (2)

/** \\brief  Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS7 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS7_MSK                  (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS7 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS7_OFF                  (14)

/** \\brief  Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS8 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS8_LEN                  (2)

/** \\brief  Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS8 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS8_MSK                  (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS8 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS8_OFF                  (16)

/** \\brief  Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS9 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS9_LEN                  (2)

/** \\brief  Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS9 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS9_MSK                  (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS9 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS9_OFF                  (18)

/** \\brief  Length for Ifx_GTM_MCS_CAT_Bits.CAT0 */
#define IFX_GTM_MCS_CAT_CAT0_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_CAT_Bits.CAT0 */
#define IFX_GTM_MCS_CAT_CAT0_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CAT_Bits.CAT0 */
#define IFX_GTM_MCS_CAT_CAT0_OFF                          (0)

/** \\brief  Length for Ifx_GTM_MCS_CAT_Bits.CAT1 */
#define IFX_GTM_MCS_CAT_CAT1_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_CAT_Bits.CAT1 */
#define IFX_GTM_MCS_CAT_CAT1_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CAT_Bits.CAT1 */
#define IFX_GTM_MCS_CAT_CAT1_OFF                          (1)

/** \\brief  Length for Ifx_GTM_MCS_CAT_Bits.CAT2 */
#define IFX_GTM_MCS_CAT_CAT2_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_CAT_Bits.CAT2 */
#define IFX_GTM_MCS_CAT_CAT2_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CAT_Bits.CAT2 */
#define IFX_GTM_MCS_CAT_CAT2_OFF                          (2)

/** \\brief  Length for Ifx_GTM_MCS_CAT_Bits.CAT3 */
#define IFX_GTM_MCS_CAT_CAT3_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_CAT_Bits.CAT3 */
#define IFX_GTM_MCS_CAT_CAT3_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CAT_Bits.CAT3 */
#define IFX_GTM_MCS_CAT_CAT3_OFF                          (3)

/** \\brief  Length for Ifx_GTM_MCS_CAT_Bits.CAT4 */
#define IFX_GTM_MCS_CAT_CAT4_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_CAT_Bits.CAT4 */
#define IFX_GTM_MCS_CAT_CAT4_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CAT_Bits.CAT4 */
#define IFX_GTM_MCS_CAT_CAT4_OFF                          (4)

/** \\brief  Length for Ifx_GTM_MCS_CAT_Bits.CAT5 */
#define IFX_GTM_MCS_CAT_CAT5_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_CAT_Bits.CAT5 */
#define IFX_GTM_MCS_CAT_CAT5_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CAT_Bits.CAT5 */
#define IFX_GTM_MCS_CAT_CAT5_OFF                          (5)

/** \\brief  Length for Ifx_GTM_MCS_CAT_Bits.CAT6 */
#define IFX_GTM_MCS_CAT_CAT6_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_CAT_Bits.CAT6 */
#define IFX_GTM_MCS_CAT_CAT6_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CAT_Bits.CAT6 */
#define IFX_GTM_MCS_CAT_CAT6_OFF                          (6)

/** \\brief  Length for Ifx_GTM_MCS_CAT_Bits.CAT7 */
#define IFX_GTM_MCS_CAT_CAT7_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_CAT_Bits.CAT7 */
#define IFX_GTM_MCS_CAT_CAT7_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CAT_Bits.CAT7 */
#define IFX_GTM_MCS_CAT_CAT7_OFF                          (7)

/** \\brief  Length for Ifx_GTM_MCS_CAT_Bits.Reserved */
#define IFX_GTM_MCS_CAT_RESERVED_LEN                      (24)

/** \\brief  Mask for Ifx_GTM_MCS_CAT_Bits.Reserved */
#define IFX_GTM_MCS_CAT_RESERVED_MSK                      (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CAT_Bits.Reserved */
#define IFX_GTM_MCS_CAT_RESERVED_OFF                      (8)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH0_CTRG_TRG0_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH0_CTRG_TRG0_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH0_CTRG_TRG0_OFF                     (0)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH0_CTRG_TRG10_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH0_CTRG_TRG10_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH0_CTRG_TRG10_OFF                    (10)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH0_CTRG_TRG11_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH0_CTRG_TRG11_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH0_CTRG_TRG11_OFF                    (11)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH0_CTRG_TRG12_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH0_CTRG_TRG12_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH0_CTRG_TRG12_OFF                    (12)

