Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH0_CTRG_TRG13_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH0_CTRG_TRG13_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH0_CTRG_TRG13_OFF                    (13)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH0_CTRG_TRG14_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH0_CTRG_TRG14_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH0_CTRG_TRG14_OFF                    (14)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH0_CTRG_TRG15_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH0_CTRG_TRG15_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH0_CTRG_TRG15_OFF                    (15)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG16 */
#define IFX_GTM_MCS_CH0_CTRG_TRG16_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG16 */
#define IFX_GTM_MCS_CH0_CTRG_TRG16_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG16 */
#define IFX_GTM_MCS_CH0_CTRG_TRG16_OFF                    (16)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG17 */
#define IFX_GTM_MCS_CH0_CTRG_TRG17_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG17 */
#define IFX_GTM_MCS_CH0_CTRG_TRG17_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG17 */
#define IFX_GTM_MCS_CH0_CTRG_TRG17_OFF                    (17)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG18 */
#define IFX_GTM_MCS_CH0_CTRG_TRG18_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG18 */
#define IFX_GTM_MCS_CH0_CTRG_TRG18_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG18 */
#define IFX_GTM_MCS_CH0_CTRG_TRG18_OFF                    (18)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG19 */
#define IFX_GTM_MCS_CH0_CTRG_TRG19_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG19 */
#define IFX_GTM_MCS_CH0_CTRG_TRG19_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG19 */
#define IFX_GTM_MCS_CH0_CTRG_TRG19_OFF                    (19)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH0_CTRG_TRG1_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH0_CTRG_TRG1_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH0_CTRG_TRG1_OFF                     (1)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG20 */
#define IFX_GTM_MCS_CH0_CTRG_TRG20_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG20 */
#define IFX_GTM_MCS_CH0_CTRG_TRG20_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG20 */
#define IFX_GTM_MCS_CH0_CTRG_TRG20_OFF                    (20)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG21 */
#define IFX_GTM_MCS_CH0_CTRG_TRG21_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG21 */
#define IFX_GTM_MCS_CH0_CTRG_TRG21_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG21 */
#define IFX_GTM_MCS_CH0_CTRG_TRG21_OFF                    (21)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG22 */
#define IFX_GTM_MCS_CH0_CTRG_TRG22_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG22 */
#define IFX_GTM_MCS_CH0_CTRG_TRG22_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG22 */
#define IFX_GTM_MCS_CH0_CTRG_TRG22_OFF                    (22)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG23 */
#define IFX_GTM_MCS_CH0_CTRG_TRG23_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG23 */
#define IFX_GTM_MCS_CH0_CTRG_TRG23_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG23 */
#define IFX_GTM_MCS_CH0_CTRG_TRG23_OFF                    (23)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH0_CTRG_TRG2_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH0_CTRG_TRG2_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH0_CTRG_TRG2_OFF                     (2)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH0_CTRG_TRG3_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH0_CTRG_TRG3_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH0_CTRG_TRG3_OFF                     (3)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH0_CTRG_TRG4_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH0_CTRG_TRG4_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH0_CTRG_TRG4_OFF                     (4)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH0_CTRG_TRG5_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH0_CTRG_TRG5_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH0_CTRG_TRG5_OFF                     (5)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH0_CTRG_TRG6_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH0_CTRG_TRG6_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH0_CTRG_TRG6_OFF                     (6)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH0_CTRG_TRG7_LEN                     (1)

