Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH0_CTRG_TRG7_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH0_CTRG_TRG7_OFF                     (7)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH0_CTRG_TRG8_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH0_CTRG_TRG8_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH0_CTRG_TRG8_OFF                     (8)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH0_CTRG_TRG9_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH0_CTRG_TRG9_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH0_CTRG_TRG9_OFF                     (9)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH0_STRG_TRG0_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH0_STRG_TRG0_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH0_STRG_TRG0_OFF                     (0)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH0_STRG_TRG10_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH0_STRG_TRG10_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH0_STRG_TRG10_OFF                    (10)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH0_STRG_TRG11_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH0_STRG_TRG11_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH0_STRG_TRG11_OFF                    (11)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH0_STRG_TRG12_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH0_STRG_TRG12_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH0_STRG_TRG12_OFF                    (12)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH0_STRG_TRG13_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH0_STRG_TRG13_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH0_STRG_TRG13_OFF                    (13)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH0_STRG_TRG14_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH0_STRG_TRG14_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH0_STRG_TRG14_OFF                    (14)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH0_STRG_TRG15_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH0_STRG_TRG15_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH0_STRG_TRG15_OFF                    (15)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG16 */
#define IFX_GTM_MCS_CH0_STRG_TRG16_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG16 */
#define IFX_GTM_MCS_CH0_STRG_TRG16_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG16 */
#define IFX_GTM_MCS_CH0_STRG_TRG16_OFF                    (16)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG17 */
#define IFX_GTM_MCS_CH0_STRG_TRG17_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG17 */
#define IFX_GTM_MCS_CH0_STRG_TRG17_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG17 */
#define IFX_GTM_MCS_CH0_STRG_TRG17_OFF                    (17)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG18 */
#define IFX_GTM_MCS_CH0_STRG_TRG18_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG18 */
#define IFX_GTM_MCS_CH0_STRG_TRG18_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG18 */
#define IFX_GTM_MCS_CH0_STRG_TRG18_OFF                    (18)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG19 */
#define IFX_GTM_MCS_CH0_STRG_TRG19_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG19 */
#define IFX_GTM_MCS_CH0_STRG_TRG19_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG19 */
#define IFX_GTM_MCS_CH0_STRG_TRG19_OFF                    (19)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH0_STRG_TRG1_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH0_STRG_TRG1_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH0_STRG_TRG1_OFF                     (1)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG20 */
#define IFX_GTM_MCS_CH0_STRG_TRG20_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG20 */
#define IFX_GTM_MCS_CH0_STRG_TRG20_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG20 */
#define IFX_GTM_MCS_CH0_STRG_TRG20_OFF                    (20)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG21 */
#define IFX_GTM_MCS_CH0_STRG_TRG21_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG21 */
#define IFX_GTM_MCS_CH0_STRG_TRG21_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG21 */
#define IFX_GTM_MCS_CH0_STRG_TRG21_OFF                    (21)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG22 */
#define IFX_GTM_MCS_CH0_STRG_TRG22_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG22 */
#define IFX_GTM_MCS_CH0_STRG_TRG22_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG22 */
#define IFX_GTM_MCS_CH0_STRG_TRG22_OFF                    (22)

