Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG23 */
#define IFX_GTM_MCS_CH0_STRG_TRG23_LEN                    (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG23 */
#define IFX_GTM_MCS_CH0_STRG_TRG23_MSK                    (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG23 */
#define IFX_GTM_MCS_CH0_STRG_TRG23_OFF                    (23)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH0_STRG_TRG2_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH0_STRG_TRG2_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH0_STRG_TRG2_OFF                     (2)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH0_STRG_TRG3_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH0_STRG_TRG3_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH0_STRG_TRG3_OFF                     (3)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH0_STRG_TRG4_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH0_STRG_TRG4_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH0_STRG_TRG4_OFF                     (4)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH0_STRG_TRG5_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH0_STRG_TRG5_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH0_STRG_TRG5_OFF                     (5)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH0_STRG_TRG6_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH0_STRG_TRG6_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH0_STRG_TRG6_OFF                     (6)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH0_STRG_TRG7_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH0_STRG_TRG7_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH0_STRG_TRG7_OFF                     (7)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH0_STRG_TRG8_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH0_STRG_TRG8_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH0_STRG_TRG8_OFF                     (8)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH0_STRG_TRG9_LEN                     (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH0_STRG_TRG9_MSK                     (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH0_STRG_TRG9_OFF                     (9)

/** \\brief  Length for Ifx_GTM_MCS_CH_ACB_Bits.ACB0 */
#define IFX_GTM_MCS_CH_ACB_ACB0_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_ACB_Bits.ACB0 */
#define IFX_GTM_MCS_CH_ACB_ACB0_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_ACB_Bits.ACB0 */
#define IFX_GTM_MCS_CH_ACB_ACB0_OFF                       (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_ACB_Bits.ACB1 */
#define IFX_GTM_MCS_CH_ACB_ACB1_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_ACB_Bits.ACB1 */
#define IFX_GTM_MCS_CH_ACB_ACB1_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_ACB_Bits.ACB1 */
#define IFX_GTM_MCS_CH_ACB_ACB1_OFF                       (1)

/** \\brief  Length for Ifx_GTM_MCS_CH_ACB_Bits.ACB2 */
#define IFX_GTM_MCS_CH_ACB_ACB2_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_ACB_Bits.ACB2 */
#define IFX_GTM_MCS_CH_ACB_ACB2_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_ACB_Bits.ACB2 */
#define IFX_GTM_MCS_CH_ACB_ACB2_OFF                       (2)

/** \\brief  Length for Ifx_GTM_MCS_CH_ACB_Bits.ACB3 */
#define IFX_GTM_MCS_CH_ACB_ACB3_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_ACB_Bits.ACB3 */
#define IFX_GTM_MCS_CH_ACB_ACB3_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_ACB_Bits.ACB3 */
#define IFX_GTM_MCS_CH_ACB_ACB3_OFF                       (3)

/** \\brief  Length for Ifx_GTM_MCS_CH_ACB_Bits.ACB4 */
#define IFX_GTM_MCS_CH_ACB_ACB4_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_ACB_Bits.ACB4 */
#define IFX_GTM_MCS_CH_ACB_ACB4_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_ACB_Bits.ACB4 */
#define IFX_GTM_MCS_CH_ACB_ACB4_OFF                       (4)

/** \\brief  Length for Ifx_GTM_MCS_CH_CTRL_Bits.CAT */
#define IFX_GTM_MCS_CH_CTRL_CAT_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_CTRL_Bits.CAT */
#define IFX_GTM_MCS_CH_CTRL_CAT_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_CTRL_Bits.CAT */
#define IFX_GTM_MCS_CH_CTRL_CAT_OFF                       (8)

/** \\brief  Length for Ifx_GTM_MCS_CH_CTRL_Bits.CWT */
#define IFX_GTM_MCS_CH_CTRL_CWT_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_CTRL_Bits.CWT */
#define IFX_GTM_MCS_CH_CTRL_CWT_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_CTRL_Bits.CWT */
#define IFX_GTM_MCS_CH_CTRL_CWT_OFF                       (9)

/** \\brief  Length for Ifx_GTM_MCS_CH_CTRL_Bits.CY */
#define IFX_GTM_MCS_CH_CTRL_CY_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_CTRL_Bits.CY */
#define IFX_GTM_MCS_CH_CTRL_CY_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_CTRL_Bits.CY */
#define IFX_GTM_MCS_CH_CTRL_CY_OFF                        (4)

/** \\brief  Length for Ifx_GTM_MCS_CH_CTRL_Bits.EN */
#define IFX_GTM_MCS_CH_CTRL_EN_LEN                        (1)

