Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_STK_ERR_IRQ_OFF    (1)

/** \\brief  Length for Ifx_GTM_MCS_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_MCS_CH_IRQ_MODE_IRQ_MODE_LEN              (2)

/** \\brief  Mask for Ifx_GTM_MCS_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_MCS_CH_IRQ_MODE_IRQ_MODE_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_MCS_CH_IRQ_MODE_IRQ_MODE_OFF              (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_ERR_IRQ_LEN             (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_ERR_IRQ_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_ERR_IRQ_OFF             (2)

/** \\brief  Length for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.MCS_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_MCS_IRQ_LEN             (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.MCS_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_MCS_IRQ_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.MCS_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_MCS_IRQ_OFF             (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_STK_ERR_IRQ_LEN         (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_STK_ERR_IRQ_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_STK_ERR_IRQ_OFF         (1)

/** \\brief  Length for Ifx_GTM_MCS_CH_MHB_Bits.DATA */
#define IFX_GTM_MCS_CH_MHB_DATA_LEN                       (8)

/** \\brief  Mask for Ifx_GTM_MCS_CH_MHB_Bits.DATA */
#define IFX_GTM_MCS_CH_MHB_DATA_MSK                       (0xff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_MHB_Bits.DATA */
#define IFX_GTM_MCS_CH_MHB_DATA_OFF                       (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_PC_Bits.PC */
#define IFX_GTM_MCS_CH_PC_PC_LEN                          (16)

/** \\brief  Mask for Ifx_GTM_MCS_CH_PC_Bits.PC */
#define IFX_GTM_MCS_CH_PC_PC_MSK                          (0xffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_PC_Bits.PC */
#define IFX_GTM_MCS_CH_PC_PC_OFF                          (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R0_Bits.DATA */
#define IFX_GTM_MCS_CH_R0_DATA_LEN                        (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R0_Bits.DATA */
#define IFX_GTM_MCS_CH_R0_DATA_MSK                        (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R0_Bits.DATA */
#define IFX_GTM_MCS_CH_R0_DATA_OFF                        (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R0_Bits.Reserved */
#define IFX_GTM_MCS_CH_R0_RESERVED_LEN                    (8)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R0_Bits.Reserved */
#define IFX_GTM_MCS_CH_R0_RESERVED_MSK                    (0xff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R0_Bits.Reserved */
#define IFX_GTM_MCS_CH_R0_RESERVED_OFF                    (24)

/** \\brief  Length for Ifx_GTM_MCS_CH_R1_Bits.DATA */
#define IFX_GTM_MCS_CH_R1_DATA_LEN                        (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R1_Bits.DATA */
#define IFX_GTM_MCS_CH_R1_DATA_MSK                        (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R1_Bits.DATA */
#define IFX_GTM_MCS_CH_R1_DATA_OFF                        (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R1_Bits.Reserved */
#define IFX_GTM_MCS_CH_R1_RESERVED_LEN                    (8)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R1_Bits.Reserved */
#define IFX_GTM_MCS_CH_R1_RESERVED_MSK                    (0xff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R1_Bits.Reserved */
#define IFX_GTM_MCS_CH_R1_RESERVED_OFF                    (24)

/** \\brief  Length for Ifx_GTM_MCS_CH_R2_Bits.DATA */
#define IFX_GTM_MCS_CH_R2_DATA_LEN                        (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R2_Bits.DATA */
#define IFX_GTM_MCS_CH_R2_DATA_MSK                        (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R2_Bits.DATA */
#define IFX_GTM_MCS_CH_R2_DATA_OFF                        (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R2_Bits.Reserved */
#define IFX_GTM_MCS_CH_R2_RESERVED_LEN                    (8)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R2_Bits.Reserved */
#define IFX_GTM_MCS_CH_R2_RESERVED_MSK                    (0xff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R2_Bits.Reserved */
#define IFX_GTM_MCS_CH_R2_RESERVED_OFF                    (24)

/** \\brief  Length for Ifx_GTM_MCS_CH_R3_Bits.DATA */
#define IFX_GTM_MCS_CH_R3_DATA_LEN                        (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R3_Bits.DATA */
#define IFX_GTM_MCS_CH_R3_DATA_MSK                        (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R3_Bits.DATA */
#define IFX_GTM_MCS_CH_R3_DATA_OFF                        (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R3_Bits.Reserved */
#define IFX_GTM_MCS_CH_R3_RESERVED_LEN                    (8)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R3_Bits.Reserved */
#define IFX_GTM_MCS_CH_R3_RESERVED_MSK                    (0xff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R3_Bits.Reserved */
#define IFX_GTM_MCS_CH_R3_RESERVED_OFF                    (24)

/** \\brief  Length for Ifx_GTM_MCS_CH_R4_Bits.DATA */
#define IFX_GTM_MCS_CH_R4_DATA_LEN                        (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R4_Bits.DATA */
#define IFX_GTM_MCS_CH_R4_DATA_MSK                        (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R4_Bits.DATA */
#define IFX_GTM_MCS_CH_R4_DATA_OFF                        (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R4_Bits.Reserved */
#define IFX_GTM_MCS_CH_R4_RESERVED_LEN                    (8)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R4_Bits.Reserved */
#define IFX_GTM_MCS_CH_R4_RESERVED_MSK                    (0xff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R4_Bits.Reserved */
#define IFX_GTM_MCS_CH_R4_RESERVED_OFF                    (24)

/** \\brief  Length for Ifx_GTM_MCS_CH_R5_Bits.DATA */
#define IFX_GTM_MCS_CH_R5_DATA_LEN                        (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R5_Bits.DATA */
#define IFX_GTM_MCS_CH_R5_DATA_MSK                        (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R5_Bits.DATA */
#define IFX_GTM_MCS_CH_R5_DATA_OFF                        (0)

