Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_MCS_CH_R5_Bits.Reserved */
#define IFX_GTM_MCS_CH_R5_RESERVED_LEN                    (8)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R5_Bits.Reserved */
#define IFX_GTM_MCS_CH_R5_RESERVED_MSK                    (0xff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R5_Bits.Reserved */
#define IFX_GTM_MCS_CH_R5_RESERVED_OFF                    (24)

/** \\brief  Length for Ifx_GTM_MCS_CH_R6_Bits.DATA */
#define IFX_GTM_MCS_CH_R6_DATA_LEN                        (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R6_Bits.DATA */
#define IFX_GTM_MCS_CH_R6_DATA_MSK                        (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R6_Bits.DATA */
#define IFX_GTM_MCS_CH_R6_DATA_OFF                        (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R6_Bits.Reserved */
#define IFX_GTM_MCS_CH_R6_RESERVED_LEN                    (8)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R6_Bits.Reserved */
#define IFX_GTM_MCS_CH_R6_RESERVED_MSK                    (0xff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R6_Bits.Reserved */
#define IFX_GTM_MCS_CH_R6_RESERVED_OFF                    (24)

/** \\brief  Length for Ifx_GTM_MCS_CH_R7_Bits.DATA */
#define IFX_GTM_MCS_CH_R7_DATA_LEN                        (24)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R7_Bits.DATA */
#define IFX_GTM_MCS_CH_R7_DATA_MSK                        (0xffffff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R7_Bits.DATA */
#define IFX_GTM_MCS_CH_R7_DATA_OFF                        (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_R7_Bits.Reserved */
#define IFX_GTM_MCS_CH_R7_RESERVED_LEN                    (8)

/** \\brief  Mask for Ifx_GTM_MCS_CH_R7_Bits.Reserved */
#define IFX_GTM_MCS_CH_R7_RESERVED_MSK                    (0xff)

/** \\brief  Offset for Ifx_GTM_MCS_CH_R7_Bits.Reserved */
#define IFX_GTM_MCS_CH_R7_RESERVED_OFF                    (24)

/** \\brief  Length for Ifx_GTM_MCS_CTRL_STAT_Bits.EN_TIM_FOUT */
#define IFX_GTM_MCS_CTRL_STAT_EN_TIM_FOUT_LEN             (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRL_STAT_Bits.EN_TIM_FOUT */
#define IFX_GTM_MCS_CTRL_STAT_EN_TIM_FOUT_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRL_STAT_Bits.EN_TIM_FOUT */
#define IFX_GTM_MCS_CTRL_STAT_EN_TIM_FOUT_OFF             (24)

/** \\brief  Length for Ifx_GTM_MCS_CTRL_STAT_Bits.EN_XOREG */
#define IFX_GTM_MCS_CTRL_STAT_EN_XOREG_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRL_STAT_Bits.EN_XOREG */
#define IFX_GTM_MCS_CTRL_STAT_EN_XOREG_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRL_STAT_Bits.EN_XOREG */
#define IFX_GTM_MCS_CTRL_STAT_EN_XOREG_OFF                (25)

/** \\brief  Length for Ifx_GTM_MCS_CTRL_STAT_Bits.ERR_SRC_ID */
#define IFX_GTM_MCS_CTRL_STAT_ERR_SRC_ID_LEN              (3)

/** \\brief  Mask for Ifx_GTM_MCS_CTRL_STAT_Bits.ERR_SRC_ID */
#define IFX_GTM_MCS_CTRL_STAT_ERR_SRC_ID_MSK              (0x7)

/** \\brief  Offset for Ifx_GTM_MCS_CTRL_STAT_Bits.ERR_SRC_ID */
#define IFX_GTM_MCS_CTRL_STAT_ERR_SRC_ID_OFF              (20)

/** \\brief  Length for Ifx_GTM_MCS_CTRL_STAT_Bits.HLT_AEIM_ERR */
#define IFX_GTM_MCS_CTRL_STAT_HLT_AEIM_ERR_LEN            (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRL_STAT_Bits.HLT_AEIM_ERR */
#define IFX_GTM_MCS_CTRL_STAT_HLT_AEIM_ERR_MSK            (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRL_STAT_Bits.HLT_AEIM_ERR */
#define IFX_GTM_MCS_CTRL_STAT_HLT_AEIM_ERR_OFF            (26)

/** \\brief  Length for Ifx_GTM_MCS_CTRL_STAT_Bits.HLT_SP_OFL */
#define IFX_GTM_MCS_CTRL_STAT_HLT_SP_OFL_LEN              (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRL_STAT_Bits.HLT_SP_OFL */
#define IFX_GTM_MCS_CTRL_STAT_HLT_SP_OFL_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRL_STAT_Bits.HLT_SP_OFL */
#define IFX_GTM_MCS_CTRL_STAT_HLT_SP_OFL_OFF              (17)

/** \\brief  Length for Ifx_GTM_MCS_CTRL_STAT_Bits.RAM_RST */
#define IFX_GTM_MCS_CTRL_STAT_RAM_RST_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_MCS_CTRL_STAT_Bits.RAM_RST */
#define IFX_GTM_MCS_CTRL_STAT_RAM_RST_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CTRL_STAT_Bits.RAM_RST */
#define IFX_GTM_MCS_CTRL_STAT_RAM_RST_OFF                 (16)

/** \\brief  Length for Ifx_GTM_MCS_CTRL_STAT_Bits.SCD_CH */
#define IFX_GTM_MCS_CTRL_STAT_SCD_CH_LEN                  (4)

/** \\brief  Mask for Ifx_GTM_MCS_CTRL_STAT_Bits.SCD_CH */
#define IFX_GTM_MCS_CTRL_STAT_SCD_CH_MSK                  (0xf)

/** \\brief  Offset for Ifx_GTM_MCS_CTRL_STAT_Bits.SCD_CH */
#define IFX_GTM_MCS_CTRL_STAT_SCD_CH_OFF                  (8)

/** \\brief  Length for Ifx_GTM_MCS_CTRL_STAT_Bits.SCD_MODE */
#define IFX_GTM_MCS_CTRL_STAT_SCD_MODE_LEN                (2)

/** \\brief  Mask for Ifx_GTM_MCS_CTRL_STAT_Bits.SCD_MODE */
#define IFX_GTM_MCS_CTRL_STAT_SCD_MODE_MSK                (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_CTRL_STAT_Bits.SCD_MODE */
#define IFX_GTM_MCS_CTRL_STAT_SCD_MODE_OFF                (0)

/** \\brief  Length for Ifx_GTM_MCS_CWT_Bits.CWT0 */
#define IFX_GTM_MCS_CWT_CWT0_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_CWT_Bits.CWT0 */
#define IFX_GTM_MCS_CWT_CWT0_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CWT_Bits.CWT0 */
#define IFX_GTM_MCS_CWT_CWT0_OFF                          (0)

/** \\brief  Length for Ifx_GTM_MCS_CWT_Bits.CWT1 */
#define IFX_GTM_MCS_CWT_CWT1_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_CWT_Bits.CWT1 */
#define IFX_GTM_MCS_CWT_CWT1_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CWT_Bits.CWT1 */
#define IFX_GTM_MCS_CWT_CWT1_OFF                          (1)

/** \\brief  Length for Ifx_GTM_MCS_CWT_Bits.CWT2 */
#define IFX_GTM_MCS_CWT_CWT2_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_CWT_Bits.CWT2 */
#define IFX_GTM_MCS_CWT_CWT2_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CWT_Bits.CWT2 */
#define IFX_GTM_MCS_CWT_CWT2_OFF                          (2)

/** \\brief  Length for Ifx_GTM_MCS_CWT_Bits.CWT3 */
#define IFX_GTM_MCS_CWT_CWT3_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_CWT_Bits.CWT3 */
#define IFX_GTM_MCS_CWT_CWT3_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CWT_Bits.CWT3 */
#define IFX_GTM_MCS_CWT_CWT3_OFF                          (3)

/** \\brief  Length for Ifx_GTM_MCS_CWT_Bits.CWT4 */
#define IFX_GTM_MCS_CWT_CWT4_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_CWT_Bits.CWT4 */
#define IFX_GTM_MCS_CWT_CWT4_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CWT_Bits.CWT4 */
#define IFX_GTM_MCS_CWT_CWT4_OFF                          (4)

/** \\brief  Length for Ifx_GTM_MCS_CWT_Bits.CWT5 */
#define IFX_GTM_MCS_CWT_CWT5_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_CWT_Bits.CWT5 */
#define IFX_GTM_MCS_CWT_CWT5_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CWT_Bits.CWT5 */
#define IFX_GTM_MCS_CWT_CWT5_OFF                          (5)

/** \\brief  Length for Ifx_GTM_MCS_CWT_Bits.CWT6 */
#define IFX_GTM_MCS_CWT_CWT6_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_CWT_Bits.CWT6 */
#define IFX_GTM_MCS_CWT_CWT6_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CWT_Bits.CWT6 */
#define IFX_GTM_MCS_CWT_CWT6_OFF                          (6)

