Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_MCS_CWT_Bits.CWT7 */
#define IFX_GTM_MCS_CWT_CWT7_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_CWT_Bits.CWT7 */
#define IFX_GTM_MCS_CWT_CWT7_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CWT_Bits.CWT7 */
#define IFX_GTM_MCS_CWT_CWT7_OFF                          (7)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR0 */
#define IFX_GTM_MCS_ERR_ERR0_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR0 */
#define IFX_GTM_MCS_ERR_ERR0_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR0 */
#define IFX_GTM_MCS_ERR_ERR0_OFF                          (0)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR1 */
#define IFX_GTM_MCS_ERR_ERR1_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR1 */
#define IFX_GTM_MCS_ERR_ERR1_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR1 */
#define IFX_GTM_MCS_ERR_ERR1_OFF                          (1)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR2 */
#define IFX_GTM_MCS_ERR_ERR2_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR2 */
#define IFX_GTM_MCS_ERR_ERR2_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR2 */
#define IFX_GTM_MCS_ERR_ERR2_OFF                          (2)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR3 */
#define IFX_GTM_MCS_ERR_ERR3_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR3 */
#define IFX_GTM_MCS_ERR_ERR3_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR3 */
#define IFX_GTM_MCS_ERR_ERR3_OFF                          (3)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR4 */
#define IFX_GTM_MCS_ERR_ERR4_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR4 */
#define IFX_GTM_MCS_ERR_ERR4_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR4 */
#define IFX_GTM_MCS_ERR_ERR4_OFF                          (4)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR5 */
#define IFX_GTM_MCS_ERR_ERR5_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR5 */
#define IFX_GTM_MCS_ERR_ERR5_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR5 */
#define IFX_GTM_MCS_ERR_ERR5_OFF                          (5)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR6 */
#define IFX_GTM_MCS_ERR_ERR6_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR6 */
#define IFX_GTM_MCS_ERR_ERR6_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR6 */
#define IFX_GTM_MCS_ERR_ERR6_OFF                          (6)

/** \\brief  Length for Ifx_GTM_MCS_ERR_Bits.ERR7 */
#define IFX_GTM_MCS_ERR_ERR7_LEN                          (1)

/** \\brief  Mask for Ifx_GTM_MCS_ERR_Bits.ERR7 */
#define IFX_GTM_MCS_ERR_ERR7_MSK                          (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_ERR_Bits.ERR7 */
#define IFX_GTM_MCS_ERR_ERR7_OFF                          (7)

/** \\brief  Length for Ifx_GTM_MCS_REG_PROT_Bits.WPROT0 */
#define IFX_GTM_MCS_REG_PROT_WPROT0_LEN                   (2)

/** \\brief  Mask for Ifx_GTM_MCS_REG_PROT_Bits.WPROT0 */
#define IFX_GTM_MCS_REG_PROT_WPROT0_MSK                   (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_REG_PROT_Bits.WPROT0 */
#define IFX_GTM_MCS_REG_PROT_WPROT0_OFF                   (0)

/** \\brief  Length for Ifx_GTM_MCS_REG_PROT_Bits.WPROT1 */
#define IFX_GTM_MCS_REG_PROT_WPROT1_LEN                   (2)

/** \\brief  Mask for Ifx_GTM_MCS_REG_PROT_Bits.WPROT1 */
#define IFX_GTM_MCS_REG_PROT_WPROT1_MSK                   (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_REG_PROT_Bits.WPROT1 */
#define IFX_GTM_MCS_REG_PROT_WPROT1_OFF                   (2)

/** \\brief  Length for Ifx_GTM_MCS_REG_PROT_Bits.WPROT2 */
#define IFX_GTM_MCS_REG_PROT_WPROT2_LEN                   (2)

/** \\brief  Mask for Ifx_GTM_MCS_REG_PROT_Bits.WPROT2 */
#define IFX_GTM_MCS_REG_PROT_WPROT2_MSK                   (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_REG_PROT_Bits.WPROT2 */
#define IFX_GTM_MCS_REG_PROT_WPROT2_OFF                   (4)

/** \\brief  Length for Ifx_GTM_MCS_REG_PROT_Bits.WPROT3 */
#define IFX_GTM_MCS_REG_PROT_WPROT3_LEN                   (2)

/** \\brief  Mask for Ifx_GTM_MCS_REG_PROT_Bits.WPROT3 */
#define IFX_GTM_MCS_REG_PROT_WPROT3_MSK                   (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_REG_PROT_Bits.WPROT3 */
#define IFX_GTM_MCS_REG_PROT_WPROT3_OFF                   (6)

/** \\brief  Length for Ifx_GTM_MCS_REG_PROT_Bits.WPROT4 */
#define IFX_GTM_MCS_REG_PROT_WPROT4_LEN                   (2)

/** \\brief  Mask for Ifx_GTM_MCS_REG_PROT_Bits.WPROT4 */
#define IFX_GTM_MCS_REG_PROT_WPROT4_MSK                   (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_REG_PROT_Bits.WPROT4 */
#define IFX_GTM_MCS_REG_PROT_WPROT4_OFF                   (8)

/** \\brief  Length for Ifx_GTM_MCS_REG_PROT_Bits.WPROT5 */
#define IFX_GTM_MCS_REG_PROT_WPROT5_LEN                   (2)

/** \\brief  Mask for Ifx_GTM_MCS_REG_PROT_Bits.WPROT5 */
#define IFX_GTM_MCS_REG_PROT_WPROT5_MSK                   (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_REG_PROT_Bits.WPROT5 */
#define IFX_GTM_MCS_REG_PROT_WPROT5_OFF                   (10)

/** \\brief  Length for Ifx_GTM_MCS_REG_PROT_Bits.WPROT6 */
#define IFX_GTM_MCS_REG_PROT_WPROT6_LEN                   (2)

/** \\brief  Mask for Ifx_GTM_MCS_REG_PROT_Bits.WPROT6 */
#define IFX_GTM_MCS_REG_PROT_WPROT6_MSK                   (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_REG_PROT_Bits.WPROT6 */
#define IFX_GTM_MCS_REG_PROT_WPROT6_OFF                   (12)

/** \\brief  Length for Ifx_GTM_MCS_REG_PROT_Bits.WPROT7 */
#define IFX_GTM_MCS_REG_PROT_WPROT7_LEN                   (2)

/** \\brief  Mask for Ifx_GTM_MCS_REG_PROT_Bits.WPROT7 */
#define IFX_GTM_MCS_REG_PROT_WPROT7_MSK                   (0x3)

/** \\brief  Offset for Ifx_GTM_MCS_REG_PROT_Bits.WPROT7 */
#define IFX_GTM_MCS_REG_PROT_WPROT7_OFF                   (14)

/** \\brief  Length for Ifx_GTM_MCS_RESET_Bits.RST0 */
#define IFX_GTM_MCS_RESET_RST0_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_MCS_RESET_Bits.RST0 */
#define IFX_GTM_MCS_RESET_RST0_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RESET_Bits.RST0 */
#define IFX_GTM_MCS_RESET_RST0_OFF                        (0)

/** \\brief  Length for Ifx_GTM_MCS_RESET_Bits.RST1 */
#define IFX_GTM_MCS_RESET_RST1_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_MCS_RESET_Bits.RST1 */
#define IFX_GTM_MCS_RESET_RST1_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RESET_Bits.RST1 */
#define IFX_GTM_MCS_RESET_RST1_OFF                        (1)

