Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_MCS_RESET_Bits.RST2 */
#define IFX_GTM_MCS_RESET_RST2_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_MCS_RESET_Bits.RST2 */
#define IFX_GTM_MCS_RESET_RST2_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RESET_Bits.RST2 */
#define IFX_GTM_MCS_RESET_RST2_OFF                        (2)

/** \\brief  Length for Ifx_GTM_MCS_RESET_Bits.RST3 */
#define IFX_GTM_MCS_RESET_RST3_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_MCS_RESET_Bits.RST3 */
#define IFX_GTM_MCS_RESET_RST3_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RESET_Bits.RST3 */
#define IFX_GTM_MCS_RESET_RST3_OFF                        (3)

/** \\brief  Length for Ifx_GTM_MCS_RESET_Bits.RST4 */
#define IFX_GTM_MCS_RESET_RST4_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_MCS_RESET_Bits.RST4 */
#define IFX_GTM_MCS_RESET_RST4_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RESET_Bits.RST4 */
#define IFX_GTM_MCS_RESET_RST4_OFF                        (4)

/** \\brief  Length for Ifx_GTM_MCS_RESET_Bits.RST5 */
#define IFX_GTM_MCS_RESET_RST5_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_MCS_RESET_Bits.RST5 */
#define IFX_GTM_MCS_RESET_RST5_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RESET_Bits.RST5 */
#define IFX_GTM_MCS_RESET_RST5_OFF                        (5)

/** \\brief  Length for Ifx_GTM_MCS_RESET_Bits.RST6 */
#define IFX_GTM_MCS_RESET_RST6_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_MCS_RESET_Bits.RST6 */
#define IFX_GTM_MCS_RESET_RST6_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RESET_Bits.RST6 */
#define IFX_GTM_MCS_RESET_RST6_OFF                        (6)

/** \\brief  Length for Ifx_GTM_MCS_RESET_Bits.RST7 */
#define IFX_GTM_MCS_RESET_RST7_LEN                        (1)

/** \\brief  Mask for Ifx_GTM_MCS_RESET_Bits.RST7 */
#define IFX_GTM_MCS_RESET_RST7_MSK                        (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RESET_Bits.RST7 */
#define IFX_GTM_MCS_RESET_RST7_OFF                        (7)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_0_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_0_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_0_OFF                (0)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_1_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_1_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_1_OFF                (1)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_2_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_2_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_2_OFF                (2)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_3_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_3_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_3_OFF                (3)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_4_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_4_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_4_OFF                (4)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_5_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_5_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_5_OFF                (5)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_6_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_6_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_6_OFF                (6)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_7_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_7_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_7_OFF                (7)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_0_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_0_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_0_OFF                (8)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_1_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_1_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_1_OFF                (9)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_2_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_2_MSK                (0x1)

