Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_2_OFF                (10)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_3_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_3_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_3_OFF                (11)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_4_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_4_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_4_OFF                (12)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_5_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_5_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_5_OFF                (13)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_6_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_6_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_6_OFF                (14)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_7_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_7_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_7_OFF                (15)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_00 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_00_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_00 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_00_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_00 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_00_OFF               (16)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_01 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_01_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_01 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_01_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_01 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_01_OFF               (17)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_02 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_02_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_02 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_02_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_02 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_02_OFF               (18)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_03 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_03_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_03 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_03_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_03 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_03_OFF               (19)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_04 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_04_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_04 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_04_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_04 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_04_OFF               (20)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_05 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_05_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_05 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_05_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_05 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_05_OFF               (21)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_06 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_06_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_06 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_06_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_06 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_06_OFF               (22)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_07 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_07_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_07 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_07_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_07 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_07_OFF               (23)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_00 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_00_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_00 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_00_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_00 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_00_OFF               (24)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_01 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_01_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_01 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_01_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_01 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_01_OFF               (25)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_02 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_02_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_02 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_02_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_02 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_02_OFF               (26)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_03 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_03_LEN               (1)

