Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_03 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_03_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_03 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_03_OFF               (27)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_04 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_04_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_04 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_04_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_04 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_04_OFF               (28)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_05 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_05_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_05 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_05_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_05 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_05_OFF               (29)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_06 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_06_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_06 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_06_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_06 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_06_OFF               (30)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_07 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_07_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_07 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_07_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_07 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_07_OFF               (31)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_0_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_0_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_0_OFF                (0)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_1_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_1_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_1_OFF                (1)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_2_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_2_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_2_OFF                (2)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_3_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_3_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_3_OFF                (3)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_4_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_4_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_4_OFF                (4)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_5 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_5_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_5 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_5_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_5 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_5_OFF                (5)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_6 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_6_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_6 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_6_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_6 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_6_OFF                (6)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_7 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_7_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_7 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_7_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_7 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_7_OFF                (7)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_0_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_0_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_0_OFF                (8)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_1_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_1_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_1_OFF                (9)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_2_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_2_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_2_OFF                (10)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_3_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_3_MSK                (0x1)

