Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_3_OFF                (11)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_4_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_4_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_4_OFF                (12)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_5 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_5_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_5 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_5_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_5 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_5_OFF                (13)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_6 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_6_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_6 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_6_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_6 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_6_OFF                (14)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_7 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_7_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_7 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_7_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_7 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_7_OFF                (15)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_0_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_0_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_0_OFF                (16)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_1_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_1_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_1_OFF                (17)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_2_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_2_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_2_OFF                (18)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_3_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_3_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_3_OFF                (19)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_4_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_4_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_4_OFF                (20)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_5 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_5_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_5 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_5_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_5 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_5_OFF                (21)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_6 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_6_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_6 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_6_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_6 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_6_OFF                (22)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_7 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_7_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_7 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_7_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_6_7 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_6_7_OFF                (23)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_7_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_7_0_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_7_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_7_0_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_7_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_7_0_OFF                (24)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_7_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_7_1_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_7_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_7_1_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_7_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_7_1_OFF                (25)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_7_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_7_2_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_7_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_7_2_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_7_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_7_2_OFF                (26)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_7_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_7_3_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_7_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_7_3_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_7_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_7_3_OFF                (27)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_7_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_7_4_LEN                (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_7_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_7_4_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_7_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_7_4_OFF                (28)

