Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_1 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_1_OFF               (1)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_2 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_2_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_2 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_2_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_2 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_2_OFF               (2)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_3 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_3_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_3 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_3_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_3 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_3_OFF               (3)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_4 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_4_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_4 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_4_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_4 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_4_OFF               (4)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_5 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_5_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_5 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_5_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_5 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_5_OFF               (5)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_6 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_6_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_6 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_6_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_6 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_6_OFF               (6)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_7 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_7_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_7 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_7_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_MCS8_Bits.MCA_7 */
#define IFX_GTM_MON_ACTIVITY_MCS8_MCA_7_OFF               (7)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_0 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_0_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_0 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_0_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_0 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_0_OFF               (0)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_1 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_1_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_1 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_1_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_1 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_1_OFF               (1)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_2 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_2_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_2 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_2_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_2 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_2_OFF               (2)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_3 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_3_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_3 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_3_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_3 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_3_OFF               (3)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_4 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_4_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_4 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_4_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_4 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_4_OFF               (4)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_5 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_5_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_5 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_5_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_5 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_5_OFF               (5)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_6 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_6_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_6 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_6_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_6 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_6_OFF               (6)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_7 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_7_LEN               (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_7 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_7_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_MCS9_Bits.MCA_7 */
#define IFX_GTM_MON_ACTIVITY_MCS9_MCA_7_OFF               (7)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU0 */
#define IFX_GTM_MON_STATUS_ACT_CMU0_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU0 */
#define IFX_GTM_MON_STATUS_ACT_CMU0_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU0 */
#define IFX_GTM_MON_STATUS_ACT_CMU0_OFF                   (0)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU1 */
#define IFX_GTM_MON_STATUS_ACT_CMU1_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU1 */
#define IFX_GTM_MON_STATUS_ACT_CMU1_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU1 */
#define IFX_GTM_MON_STATUS_ACT_CMU1_OFF                   (1)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU2 */
#define IFX_GTM_MON_STATUS_ACT_CMU2_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU2 */
#define IFX_GTM_MON_STATUS_ACT_CMU2_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU2 */
#define IFX_GTM_MON_STATUS_ACT_CMU2_OFF                   (2)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU3 */
#define IFX_GTM_MON_STATUS_ACT_CMU3_LEN                   (1)

