Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS4_ERR */
#define IFX_GTM_MON_STATUS_MCS4_ERR_OFF                   (24)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS5_ERR */
#define IFX_GTM_MON_STATUS_MCS5_ERR_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS5_ERR */
#define IFX_GTM_MON_STATUS_MCS5_ERR_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS5_ERR */
#define IFX_GTM_MON_STATUS_MCS5_ERR_OFF                   (25)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS6_ERR */
#define IFX_GTM_MON_STATUS_MCS6_ERR_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS6_ERR */
#define IFX_GTM_MON_STATUS_MCS6_ERR_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS6_ERR */
#define IFX_GTM_MON_STATUS_MCS6_ERR_OFF                   (26)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS7_ERR */
#define IFX_GTM_MON_STATUS_MCS7_ERR_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS7_ERR */
#define IFX_GTM_MON_STATUS_MCS7_ERR_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS7_ERR */
#define IFX_GTM_MON_STATUS_MCS7_ERR_OFF                   (27)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS8_ERR */
#define IFX_GTM_MON_STATUS_MCS8_ERR_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS8_ERR */
#define IFX_GTM_MON_STATUS_MCS8_ERR_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS8_ERR */
#define IFX_GTM_MON_STATUS_MCS8_ERR_OFF                   (28)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS9_ERR */
#define IFX_GTM_MON_STATUS_MCS9_ERR_LEN                   (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS9_ERR */
#define IFX_GTM_MON_STATUS_MCS9_ERR_MSK                   (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS9_ERR */
#define IFX_GTM_MON_STATUS_MCS9_ERR_OFF                   (29)

/** \\brief  Length for Ifx_GTM_OTBU3T_Bits.CV */
#define IFX_GTM_OTBU3T_CV_LEN                             (24)

/** \\brief  Mask for Ifx_GTM_OTBU3T_Bits.CV */
#define IFX_GTM_OTBU3T_CV_MSK                             (0xffffff)

/** \\brief  Offset for Ifx_GTM_OTBU3T_Bits.CV */
#define IFX_GTM_OTBU3T_CV_OFF                             (0)

/** \\brief  Length for Ifx_GTM_OTBU3T_Bits.EN */
#define IFX_GTM_OTBU3T_EN_LEN                             (1)

/** \\brief  Mask for Ifx_GTM_OTBU3T_Bits.EN */
#define IFX_GTM_OTBU3T_EN_MSK                             (0x1)

/** \\brief  Offset for Ifx_GTM_OTBU3T_Bits.EN */
#define IFX_GTM_OTBU3T_EN_OFF                             (28)

/** \\brief  Length for Ifx_GTM_REV_Bits.DEV_CODE0 */
#define IFX_GTM_REV_DEV_CODE0_LEN                         (4)

/** \\brief  Mask for Ifx_GTM_REV_Bits.DEV_CODE0 */
#define IFX_GTM_REV_DEV_CODE0_MSK                         (0xf)

/** \\brief  Offset for Ifx_GTM_REV_Bits.DEV_CODE0 */
#define IFX_GTM_REV_DEV_CODE0_OFF                         (20)

/** \\brief  Length for Ifx_GTM_REV_Bits.DEV_CODE1 */
#define IFX_GTM_REV_DEV_CODE1_LEN                         (4)

/** \\brief  Mask for Ifx_GTM_REV_Bits.DEV_CODE1 */
#define IFX_GTM_REV_DEV_CODE1_MSK                         (0xf)

/** \\brief  Offset for Ifx_GTM_REV_Bits.DEV_CODE1 */
#define IFX_GTM_REV_DEV_CODE1_OFF                         (24)

/** \\brief  Length for Ifx_GTM_REV_Bits.DEV_CODE2 */
#define IFX_GTM_REV_DEV_CODE2_LEN                         (4)

/** \\brief  Mask for Ifx_GTM_REV_Bits.DEV_CODE2 */
#define IFX_GTM_REV_DEV_CODE2_MSK                         (0xf)

/** \\brief  Offset for Ifx_GTM_REV_Bits.DEV_CODE2 */
#define IFX_GTM_REV_DEV_CODE2_OFF                         (28)

/** \\brief  Length for Ifx_GTM_REV_Bits.MAJOR */
#define IFX_GTM_REV_MAJOR_LEN                             (4)

/** \\brief  Mask for Ifx_GTM_REV_Bits.MAJOR */
#define IFX_GTM_REV_MAJOR_MSK                             (0xf)

/** \\brief  Offset for Ifx_GTM_REV_Bits.MAJOR */
#define IFX_GTM_REV_MAJOR_OFF                             (16)

/** \\brief  Length for Ifx_GTM_REV_Bits.MINOR */
#define IFX_GTM_REV_MINOR_LEN                             (4)

/** \\brief  Mask for Ifx_GTM_REV_Bits.MINOR */
#define IFX_GTM_REV_MINOR_MSK                             (0xf)

/** \\brief  Offset for Ifx_GTM_REV_Bits.MINOR */
#define IFX_GTM_REV_MINOR_OFF                             (12)

/** \\brief  Length for Ifx_GTM_REV_Bits.NO */
#define IFX_GTM_REV_NO_LEN                                (4)

/** \\brief  Mask for Ifx_GTM_REV_Bits.NO */
#define IFX_GTM_REV_NO_MSK                                (0xf)

/** \\brief  Offset for Ifx_GTM_REV_Bits.NO */
#define IFX_GTM_REV_NO_OFF                                (8)

/** \\brief  Length for Ifx_GTM_REV_Bits.STEP */
#define IFX_GTM_REV_STEP_LEN                              (8)

/** \\brief  Mask for Ifx_GTM_REV_Bits.STEP */
#define IFX_GTM_REV_STEP_MSK                              (0xff)

/** \\brief  Offset for Ifx_GTM_REV_Bits.STEP */
#define IFX_GTM_REV_STEP_OFF                              (0)

/** \\brief  Length for Ifx_GTM_RST_Bits.BRIDGE_MODE_WRDIS */
#define IFX_GTM_RST_BRIDGE_MODE_WRDIS_LEN                 (1)

/** \\brief  Mask for Ifx_GTM_RST_Bits.BRIDGE_MODE_WRDIS */
#define IFX_GTM_RST_BRIDGE_MODE_WRDIS_MSK                 (0x1)

/** \\brief  Offset for Ifx_GTM_RST_Bits.BRIDGE_MODE_WRDIS */
#define IFX_GTM_RST_BRIDGE_MODE_WRDIS_OFF                 (27)

/** \\brief  Length for Ifx_GTM_RST_Bits.RST */
#define IFX_GTM_RST_RST_LEN                               (1)

/** \\brief  Mask for Ifx_GTM_RST_Bits.RST */
#define IFX_GTM_RST_RST_MSK                               (0x1)

/** \\brief  Offset for Ifx_GTM_RST_Bits.RST */
#define IFX_GTM_RST_RST_OFF                               (0)

/** \\brief  Length for Ifx_GTM_SPE_CMD_Bits.SPE_CTRL_CMD */
#define IFX_GTM_SPE_CMD_SPE_CTRL_CMD_LEN                  (2)

/** \\brief  Mask for Ifx_GTM_SPE_CMD_Bits.SPE_CTRL_CMD */
#define IFX_GTM_SPE_CMD_SPE_CTRL_CMD_MSK                  (0x3)

/** \\brief  Offset for Ifx_GTM_SPE_CMD_Bits.SPE_CTRL_CMD */
#define IFX_GTM_SPE_CMD_SPE_CTRL_CMD_OFF                  (0)

/** \\brief  Length for Ifx_GTM_SPE_CMD_Bits.SPE_UPD_TRIG */
#define IFX_GTM_SPE_CMD_SPE_UPD_TRIG_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_SPE_CMD_Bits.SPE_UPD_TRIG */
#define IFX_GTM_SPE_CMD_SPE_UPD_TRIG_MSK                  (0x1)

