Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP6_PAT */
#define IFX_GTM_SPE_PAT_IP6_PAT_OFF                       (25)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP6_VAL */
#define IFX_GTM_SPE_PAT_IP6_VAL_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP6_VAL */
#define IFX_GTM_SPE_PAT_IP6_VAL_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP6_VAL */
#define IFX_GTM_SPE_PAT_IP6_VAL_OFF                       (24)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP7_PAT */
#define IFX_GTM_SPE_PAT_IP7_PAT_LEN                       (3)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP7_PAT */
#define IFX_GTM_SPE_PAT_IP7_PAT_MSK                       (0x7)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP7_PAT */
#define IFX_GTM_SPE_PAT_IP7_PAT_OFF                       (29)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP7_VAL */
#define IFX_GTM_SPE_PAT_IP7_VAL_LEN                       (1)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP7_VAL */
#define IFX_GTM_SPE_PAT_IP7_VAL_MSK                       (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP7_VAL */
#define IFX_GTM_SPE_PAT_IP7_VAL_OFF                       (28)

/** \\brief  Length for Ifx_GTM_SPE_REV_CMP_Bits.REV_CMP */
#define IFX_GTM_SPE_REV_CMP_REV_CMP_LEN                   (24)

/** \\brief  Mask for Ifx_GTM_SPE_REV_CMP_Bits.REV_CMP */
#define IFX_GTM_SPE_REV_CMP_REV_CMP_MSK                   (0xffffff)

/** \\brief  Offset for Ifx_GTM_SPE_REV_CMP_Bits.REV_CMP */
#define IFX_GTM_SPE_REV_CMP_REV_CMP_OFF                   (0)

/** \\brief  Length for Ifx_GTM_SPE_REV_CNT_Bits.REV_CNT */
#define IFX_GTM_SPE_REV_CNT_REV_CNT_LEN                   (24)

/** \\brief  Mask for Ifx_GTM_SPE_REV_CNT_Bits.REV_CNT */
#define IFX_GTM_SPE_REV_CNT_REV_CNT_MSK                   (0xffffff)

/** \\brief  Offset for Ifx_GTM_SPE_REV_CNT_Bits.REV_CNT */
#define IFX_GTM_SPE_REV_CNT_REV_CNT_OFF                   (0)

/** \\brief  Length for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_LEN                     (27)

/** \\brief  Mask for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_MSK                     (0x7ffffff)

/** \\brief  Offset for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_OFF                     (0)

/** \\brief  Length for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_LEN               (3)

/** \\brief  Mask for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_MSK               (0x7)

/** \\brief  Offset for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_OFF               (1)

/** \\brief  Length for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_OFF                  (0)

/** \\brief  Length for Ifx_GTM_TBU_CH1_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH1_BASE_BASE_LEN                     (24)

/** \\brief  Mask for Ifx_GTM_TBU_CH1_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH1_BASE_BASE_MSK                     (0xffffff)

/** \\brief  Offset for Ifx_GTM_TBU_CH1_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH1_BASE_BASE_OFF                     (0)

/** \\brief  Length for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_LEN               (3)

/** \\brief  Mask for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_MSK               (0x7)

/** \\brief  Offset for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_OFF               (1)

/** \\brief  Length for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_OFF                  (0)

/** \\brief  Length for Ifx_GTM_TBU_CH2_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH2_BASE_BASE_LEN                     (24)

/** \\brief  Mask for Ifx_GTM_TBU_CH2_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH2_BASE_BASE_MSK                     (0xffffff)

/** \\brief  Offset for Ifx_GTM_TBU_CH2_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH2_BASE_BASE_OFF                     (0)

/** \\brief  Length for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH2_CTRL_CH_CLK_SRC_LEN               (3)

/** \\brief  Mask for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH2_CTRL_CH_CLK_SRC_MSK               (0x7)

/** \\brief  Offset for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH2_CTRL_CH_CLK_SRC_OFF               (1)

/** \\brief  Length for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH2_CTRL_CH_MODE_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH2_CTRL_CH_MODE_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH2_CTRL_CH_MODE_OFF                  (0)

/** \\brief  Length for Ifx_GTM_TBU_CH3_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH3_BASE_BASE_LEN                     (24)

/** \\brief  Mask for Ifx_GTM_TBU_CH3_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH3_BASE_BASE_MSK                     (0xffffff)

/** \\brief  Offset for Ifx_GTM_TBU_CH3_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH3_BASE_BASE_OFF                     (0)

/** \\brief  Length for Ifx_GTM_TBU_CH3_BASE_CAPTURE_Bits.BASE_CAPTURE */
#define IFX_GTM_TBU_CH3_BASE_CAPTURE_BASE_CAPTURE_LEN     (24)

/** \\brief  Mask for Ifx_GTM_TBU_CH3_BASE_CAPTURE_Bits.BASE_CAPTURE */
#define IFX_GTM_TBU_CH3_BASE_CAPTURE_BASE_CAPTURE_MSK     (0xffffff)

/** \\brief  Offset for Ifx_GTM_TBU_CH3_BASE_CAPTURE_Bits.BASE_CAPTURE */
#define IFX_GTM_TBU_CH3_BASE_CAPTURE_BASE_CAPTURE_OFF     (0)

/** \\brief  Length for Ifx_GTM_TBU_CH3_BASE_MARK_Bits.BASE_MARK */
#define IFX_GTM_TBU_CH3_BASE_MARK_BASE_MARK_LEN           (24)

/** \\brief  Mask for Ifx_GTM_TBU_CH3_BASE_MARK_Bits.BASE_MARK */
#define IFX_GTM_TBU_CH3_BASE_MARK_BASE_MARK_MSK           (0xffffff)

