Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_TBU_CH3_BASE_MARK_Bits.BASE_MARK */
#define IFX_GTM_TBU_CH3_BASE_MARK_BASE_MARK_OFF           (0)

/** \\brief  Length for Ifx_GTM_TBU_CH3_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH3_CTRL_CH_MODE_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_TBU_CH3_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH3_CTRL_CH_MODE_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_TBU_CH3_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH3_CTRL_CH_MODE_OFF                  (0)

/** \\brief  Length for Ifx_GTM_TBU_CH3_CTRL_Bits.USE_CH2 */
#define IFX_GTM_TBU_CH3_CTRL_USE_CH2_LEN                  (1)

/** \\brief  Mask for Ifx_GTM_TBU_CH3_CTRL_Bits.USE_CH2 */
#define IFX_GTM_TBU_CH3_CTRL_USE_CH2_MSK                  (0x1)

/** \\brief  Offset for Ifx_GTM_TBU_CH3_CTRL_Bits.USE_CH2 */
#define IFX_GTM_TBU_CH3_CTRL_USE_CH2_OFF                  (4)

/** \\brief  Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_OFF                    (0)

/** \\brief  Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_OFF                    (2)

/** \\brief  Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_OFF                    (4)

/** \\brief  Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH3 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH3_LEN                    (2)

/** \\brief  Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH3 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH3_MSK                    (0x3)

/** \\brief  Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH3 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH3_OFF                    (6)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH0 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH0_LEN          (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH0 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH0_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH0 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH0_OFF          (16)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH1 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH1_LEN          (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH1 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH1_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH1 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH1_OFF          (17)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH2 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH2_LEN          (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH2 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH2_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH2 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH2_OFF          (18)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH3 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH3_LEN          (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH3 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH3_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH3 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH3_OFF          (19)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH4 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH4_LEN          (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH4 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH4_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH4 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH4_OFF          (20)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH5 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH5_LEN          (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH5 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH5_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH5 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH5_OFF          (21)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH6 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH6_LEN          (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH6 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH6_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH6 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH6_OFF          (22)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH7 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH7_LEN          (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH7 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH7_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH7 */
#define IFX_GTM_TIM_AUX_IN_SRC_SEL_OUT_N_CH7_OFF          (23)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH0 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH0_LEN                (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH0 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH0_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH0 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH0_OFF                (0)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH1 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH1_LEN                (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH1 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH1_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH1 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH1_OFF                (1)

