Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_TIM_CH_ECTRL_Bits.EFLT_CTR_FE */
#define IFX_GTM_TIM_CH_ECTRL_EFLT_CTR_FE_LEN              (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.EFLT_CTR_FE */
#define IFX_GTM_TIM_CH_ECTRL_EFLT_CTR_FE_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.EFLT_CTR_FE */
#define IFX_GTM_TIM_CH_ECTRL_EFLT_CTR_FE_OFF              (25)

/** \\brief  Length for Ifx_GTM_TIM_CH_ECTRL_Bits.EFLT_CTR_RE */
#define IFX_GTM_TIM_CH_ECTRL_EFLT_CTR_RE_LEN              (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.EFLT_CTR_RE */
#define IFX_GTM_TIM_CH_ECTRL_EFLT_CTR_RE_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.EFLT_CTR_RE */
#define IFX_GTM_TIM_CH_ECTRL_EFLT_CTR_RE_OFF              (24)

/** \\brief  Length for Ifx_GTM_TIM_CH_ECTRL_Bits.EXT_CAP_SRC */
#define IFX_GTM_TIM_CH_ECTRL_EXT_CAP_SRC_LEN              (4)

/** \\brief  Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.EXT_CAP_SRC */
#define IFX_GTM_TIM_CH_ECTRL_EXT_CAP_SRC_MSK              (0xf)

/** \\brief  Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.EXT_CAP_SRC */
#define IFX_GTM_TIM_CH_ECTRL_EXT_CAP_SRC_OFF              (0)

/** \\brief  Length for Ifx_GTM_TIM_CH_ECTRL_Bits.IMM_START */
#define IFX_GTM_TIM_CH_ECTRL_IMM_START_LEN                (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.IMM_START */
#define IFX_GTM_TIM_CH_ECTRL_IMM_START_MSK                (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.IMM_START */
#define IFX_GTM_TIM_CH_ECTRL_IMM_START_OFF                (29)

/** \\brief  Length for Ifx_GTM_TIM_CH_ECTRL_Bits.SWAP_CAPTURE */
#define IFX_GTM_TIM_CH_ECTRL_SWAP_CAPTURE_LEN             (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.SWAP_CAPTURE */
#define IFX_GTM_TIM_CH_ECTRL_SWAP_CAPTURE_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.SWAP_CAPTURE */
#define IFX_GTM_TIM_CH_ECTRL_SWAP_CAPTURE_OFF             (28)

/** \\brief  Length for Ifx_GTM_TIM_CH_ECTRL_Bits.TDU_RESYNC */
#define IFX_GTM_TIM_CH_ECTRL_TDU_RESYNC_LEN               (4)

/** \\brief  Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.TDU_RESYNC */
#define IFX_GTM_TIM_CH_ECTRL_TDU_RESYNC_MSK               (0xf)

/** \\brief  Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.TDU_RESYNC */
#define IFX_GTM_TIM_CH_ECTRL_TDU_RESYNC_OFF               (16)

/** \\brief  Length for Ifx_GTM_TIM_CH_ECTRL_Bits.TDU_START */
#define IFX_GTM_TIM_CH_ECTRL_TDU_START_LEN                (3)

/** \\brief  Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.TDU_START */
#define IFX_GTM_TIM_CH_ECTRL_TDU_START_MSK                (0x7)

/** \\brief  Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.TDU_START */
#define IFX_GTM_TIM_CH_ECTRL_TDU_START_OFF                (8)

/** \\brief  Length for Ifx_GTM_TIM_CH_ECTRL_Bits.TDU_STOP */
#define IFX_GTM_TIM_CH_ECTRL_TDU_STOP_LEN                 (3)

/** \\brief  Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.TDU_STOP */
#define IFX_GTM_TIM_CH_ECTRL_TDU_STOP_MSK                 (0x7)

/** \\brief  Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.TDU_STOP */
#define IFX_GTM_TIM_CH_ECTRL_TDU_STOP_OFF                 (12)

/** \\brief  Length for Ifx_GTM_TIM_CH_ECTRL_Bits.TODET_IRQ_SRC */
#define IFX_GTM_TIM_CH_ECTRL_TODET_IRQ_SRC_LEN            (2)

/** \\brief  Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.TODET_IRQ_SRC */
#define IFX_GTM_TIM_CH_ECTRL_TODET_IRQ_SRC_MSK            (0x3)

/** \\brief  Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.TODET_IRQ_SRC */
#define IFX_GTM_TIM_CH_ECTRL_TODET_IRQ_SRC_OFF            (6)

/** \\brief  Length for Ifx_GTM_TIM_CH_ECTRL_Bits.USE_LUT */
#define IFX_GTM_TIM_CH_ECTRL_USE_LUT_LEN                  (2)

/** \\brief  Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.USE_LUT */
#define IFX_GTM_TIM_CH_ECTRL_USE_LUT_MSK                  (0x3)

/** \\brief  Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.USE_LUT */
#define IFX_GTM_TIM_CH_ECTRL_USE_LUT_OFF                  (22)

/** \\brief  Length for Ifx_GTM_TIM_CH_ECTRL_Bits.USE_PREV_CH_IN */
#define IFX_GTM_TIM_CH_ECTRL_USE_PREV_CH_IN_LEN           (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.USE_PREV_CH_IN */
#define IFX_GTM_TIM_CH_ECTRL_USE_PREV_CH_IN_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.USE_PREV_CH_IN */
#define IFX_GTM_TIM_CH_ECTRL_USE_PREV_CH_IN_OFF           (31)

/** \\brief  Length for Ifx_GTM_TIM_CH_ECTRL_Bits.USE_PREV_TDU_IN */
#define IFX_GTM_TIM_CH_ECTRL_USE_PREV_TDU_IN_LEN          (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_ECTRL_Bits.USE_PREV_TDU_IN */
#define IFX_GTM_TIM_CH_ECTRL_USE_PREV_TDU_IN_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_ECTRL_Bits.USE_PREV_TDU_IN */
#define IFX_GTM_TIM_CH_ECTRL_USE_PREV_TDU_IN_OFF          (5)

/** \\brief  Length for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.CNTOFL_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_CNTOFL_EIRQ_EN_LEN         (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.CNTOFL_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_CNTOFL_EIRQ_EN_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.CNTOFL_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_CNTOFL_EIRQ_EN_OFF         (2)

/** \\brief  Length for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.ECNTOFL_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_ECNTOFL_EIRQ_EN_LEN        (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.ECNTOFL_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_ECNTOFL_EIRQ_EN_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.ECNTOFL_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_ECNTOFL_EIRQ_EN_OFF        (1)

/** \\brief  Length for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.GLITCHDET_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_GLITCHDET_EIRQ_EN_LEN      (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.GLITCHDET_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_GLITCHDET_EIRQ_EN_MSK      (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.GLITCHDET_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_GLITCHDET_EIRQ_EN_OFF      (5)

/** \\brief  Length for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.GPROFL_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_GPROFL_EIRQ_EN_LEN         (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.GPROFL_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_GPROFL_EIRQ_EN_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.GPROFL_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_GPROFL_EIRQ_EN_OFF         (3)

/** \\brief  Length for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.NEWVAL_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_NEWVAL_EIRQ_EN_LEN         (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.NEWVAL_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_NEWVAL_EIRQ_EN_MSK         (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.NEWVAL_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_NEWVAL_EIRQ_EN_OFF         (0)

/** \\brief  Length for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.TODET_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_TODET_EIRQ_EN_LEN          (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.TODET_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_TODET_EIRQ_EN_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_EIRQ_EN_Bits.TODET_EIRQ_EN */
#define IFX_GTM_TIM_CH_EIRQ_EN_TODET_EIRQ_EN_OFF          (4)

/** \\brief  Length for Ifx_GTM_TIM_CH_FLT_FE_Bits.FLT_FE */
#define IFX_GTM_TIM_CH_FLT_FE_FLT_FE_LEN                  (24)

/** \\brief  Mask for Ifx_GTM_TIM_CH_FLT_FE_Bits.FLT_FE */
#define IFX_GTM_TIM_CH_FLT_FE_FLT_FE_MSK                  (0xffffff)

/** \\brief  Offset for Ifx_GTM_TIM_CH_FLT_FE_Bits.FLT_FE */
#define IFX_GTM_TIM_CH_FLT_FE_FLT_FE_OFF                  (0)

/** \\brief  Length for Ifx_GTM_TIM_CH_FLT_RE_Bits.FLT_RE */
#define IFX_GTM_TIM_CH_FLT_RE_FLT_RE_LEN                  (24)

/** \\brief  Mask for Ifx_GTM_TIM_CH_FLT_RE_Bits.FLT_RE */
#define IFX_GTM_TIM_CH_FLT_RE_FLT_RE_MSK                  (0xffffff)

/** \\brief  Offset for Ifx_GTM_TIM_CH_FLT_RE_Bits.FLT_RE */
#define IFX_GTM_TIM_CH_FLT_RE_FLT_RE_OFF                  (0)

