Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_TIM_CH_IRQ_FORCINT_Bits.TRG_TODET */
#define IFX_GTM_TIM_CH_IRQ_FORCINT_TRG_TODET_OFF          (4)

/** \\brief  Length for Ifx_GTM_TIM_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_TIM_CH_IRQ_MODE_IRQ_MODE_LEN              (2)

/** \\brief  Mask for Ifx_GTM_TIM_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_TIM_CH_IRQ_MODE_IRQ_MODE_MSK              (0x3)

/** \\brief  Offset for Ifx_GTM_TIM_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_TIM_CH_IRQ_MODE_IRQ_MODE_OFF              (0)

/** \\brief  Length for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.CNTOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_CNTOFL_LEN              (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.CNTOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_CNTOFL_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.CNTOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_CNTOFL_OFF              (2)

/** \\brief  Length for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.ECNTOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_ECNTOFL_LEN             (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.ECNTOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_ECNTOFL_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.ECNTOFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_ECNTOFL_OFF             (1)

/** \\brief  Length for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GLITCHDET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GLITCHDET_LEN           (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GLITCHDET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GLITCHDET_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GLITCHDET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GLITCHDET_OFF           (5)

/** \\brief  Length for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GPROFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GPROFL_LEN              (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GPROFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GPROFL_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.GPROFL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_GPROFL_OFF              (3)

/** \\brief  Length for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.NEWVAL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_NEWVAL_LEN              (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.NEWVAL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_NEWVAL_MSK              (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.NEWVAL */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_NEWVAL_OFF              (0)

/** \\brief  Length for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.TODET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_TODET_LEN               (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.TODET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_TODET_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_IRQ_NOTIFY_Bits.TODET */
#define IFX_GTM_TIM_CH_IRQ_NOTIFY_TODET_OFF               (4)

/** \\brief  Length for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT1 */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT1_LEN                   (8)

/** \\brief  Mask for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT1 */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT1_MSK                   (0xff)

/** \\brief  Offset for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT1 */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT1_OFF                   (8)

/** \\brief  Length for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT2 */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT2_LEN                   (8)

/** \\brief  Mask for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT2 */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT2_MSK                   (0xff)

/** \\brief  Offset for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT2 */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT2_OFF                   (16)

/** \\brief  Length for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT_LEN                    (8)

/** \\brief  Mask for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT_MSK                    (0xff)

/** \\brief  Offset for Ifx_GTM_TIM_CH_TDUC_Bits.TO_CNT */
#define IFX_GTM_TIM_CH_TDUC_TO_CNT_OFF                    (0)

/** \\brief  Length for Ifx_GTM_TIM_CH_TDUV_Bits.SLICING */
#define IFX_GTM_TIM_CH_TDUV_SLICING_LEN                   (2)

/** \\brief  Mask for Ifx_GTM_TIM_CH_TDUV_Bits.SLICING */
#define IFX_GTM_TIM_CH_TDUV_SLICING_MSK                   (0x3)

/** \\brief  Offset for Ifx_GTM_TIM_CH_TDUV_Bits.SLICING */
#define IFX_GTM_TIM_CH_TDUV_SLICING_OFF                   (24)

/** \\brief  Length for Ifx_GTM_TIM_CH_TDUV_Bits.TCS */
#define IFX_GTM_TIM_CH_TDUV_TCS_LEN                       (3)

/** \\brief  Mask for Ifx_GTM_TIM_CH_TDUV_Bits.TCS */
#define IFX_GTM_TIM_CH_TDUV_TCS_MSK                       (0x7)

/** \\brief  Offset for Ifx_GTM_TIM_CH_TDUV_Bits.TCS */
#define IFX_GTM_TIM_CH_TDUV_TCS_OFF                       (28)

/** \\brief  Length for Ifx_GTM_TIM_CH_TDUV_Bits.TCS_USE_SAMPLE_EVT */
#define IFX_GTM_TIM_CH_TDUV_TCS_USE_SAMPLE_EVT_LEN        (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_TDUV_Bits.TCS_USE_SAMPLE_EVT */
#define IFX_GTM_TIM_CH_TDUV_TCS_USE_SAMPLE_EVT_MSK        (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_TDUV_Bits.TCS_USE_SAMPLE_EVT */
#define IFX_GTM_TIM_CH_TDUV_TCS_USE_SAMPLE_EVT_OFF        (26)

/** \\brief  Length for Ifx_GTM_TIM_CH_TDUV_Bits.TDU_SAME_CNT_CLK */
#define IFX_GTM_TIM_CH_TDUV_TDU_SAME_CNT_CLK_LEN          (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_TDUV_Bits.TDU_SAME_CNT_CLK */
#define IFX_GTM_TIM_CH_TDUV_TDU_SAME_CNT_CLK_MSK          (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_TDUV_Bits.TDU_SAME_CNT_CLK */
#define IFX_GTM_TIM_CH_TDUV_TDU_SAME_CNT_CLK_OFF          (27)

/** \\brief  Length for Ifx_GTM_TIM_CH_TDUV_Bits.TOV1 */
#define IFX_GTM_TIM_CH_TDUV_TOV1_LEN                      (8)

/** \\brief  Mask for Ifx_GTM_TIM_CH_TDUV_Bits.TOV1 */
#define IFX_GTM_TIM_CH_TDUV_TOV1_MSK                      (0xff)

/** \\brief  Offset for Ifx_GTM_TIM_CH_TDUV_Bits.TOV1 */
#define IFX_GTM_TIM_CH_TDUV_TOV1_OFF                      (8)

/** \\brief  Length for Ifx_GTM_TIM_CH_TDUV_Bits.TOV2 */
#define IFX_GTM_TIM_CH_TDUV_TOV2_LEN                      (8)

/** \\brief  Mask for Ifx_GTM_TIM_CH_TDUV_Bits.TOV2 */
#define IFX_GTM_TIM_CH_TDUV_TOV2_MSK                      (0xff)

