Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_TOM_TGC0_OUTEN_CTRL_Bits.OUTEN_CTRL2 */
#define IFX_GTM_TOM_TGC0_OUTEN_CTRL_OUTEN_CTRL2_OFF       (4)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_OUTEN_CTRL_Bits.OUTEN_CTRL3 */
#define IFX_GTM_TOM_TGC0_OUTEN_CTRL_OUTEN_CTRL3_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_OUTEN_CTRL_Bits.OUTEN_CTRL3 */
#define IFX_GTM_TOM_TGC0_OUTEN_CTRL_OUTEN_CTRL3_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_OUTEN_CTRL_Bits.OUTEN_CTRL3 */
#define IFX_GTM_TOM_TGC0_OUTEN_CTRL_OUTEN_CTRL3_OFF       (6)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_OUTEN_CTRL_Bits.OUTEN_CTRL4 */
#define IFX_GTM_TOM_TGC0_OUTEN_CTRL_OUTEN_CTRL4_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_OUTEN_CTRL_Bits.OUTEN_CTRL4 */
#define IFX_GTM_TOM_TGC0_OUTEN_CTRL_OUTEN_CTRL4_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_OUTEN_CTRL_Bits.OUTEN_CTRL4 */
#define IFX_GTM_TOM_TGC0_OUTEN_CTRL_OUTEN_CTRL4_OFF       (8)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_OUTEN_CTRL_Bits.OUTEN_CTRL5 */
#define IFX_GTM_TOM_TGC0_OUTEN_CTRL_OUTEN_CTRL5_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_OUTEN_CTRL_Bits.OUTEN_CTRL5 */
#define IFX_GTM_TOM_TGC0_OUTEN_CTRL_OUTEN_CTRL5_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_OUTEN_CTRL_Bits.OUTEN_CTRL5 */
#define IFX_GTM_TOM_TGC0_OUTEN_CTRL_OUTEN_CTRL5_OFF       (10)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_OUTEN_CTRL_Bits.OUTEN_CTRL6 */
#define IFX_GTM_TOM_TGC0_OUTEN_CTRL_OUTEN_CTRL6_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_OUTEN_CTRL_Bits.OUTEN_CTRL6 */
#define IFX_GTM_TOM_TGC0_OUTEN_CTRL_OUTEN_CTRL6_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_OUTEN_CTRL_Bits.OUTEN_CTRL6 */
#define IFX_GTM_TOM_TGC0_OUTEN_CTRL_OUTEN_CTRL6_OFF       (12)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_OUTEN_CTRL_Bits.OUTEN_CTRL7 */
#define IFX_GTM_TOM_TGC0_OUTEN_CTRL_OUTEN_CTRL7_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_OUTEN_CTRL_Bits.OUTEN_CTRL7 */
#define IFX_GTM_TOM_TGC0_OUTEN_CTRL_OUTEN_CTRL7_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_OUTEN_CTRL_Bits.OUTEN_CTRL7 */
#define IFX_GTM_TOM_TGC0_OUTEN_CTRL_OUTEN_CTRL7_OFF       (14)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT0_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT0_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT0_OFF       (0)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT1_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT1_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT1_OFF       (2)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT2_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT2_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT2_OFF       (4)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT3_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT3_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT3_OFF       (6)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT4_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT4_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT4_OFF       (8)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT5_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT5_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT5_OFF       (10)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT6_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT6_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT6_OFF       (12)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT7_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT7_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC0_OUTEN_STAT_OUTEN_STAT7_OFF       (14)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_ACT_TB_Bits.ACT_TB */
#define IFX_GTM_TOM_TGC1_ACT_TB_ACT_TB_LEN                (24)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_ACT_TB_Bits.ACT_TB */
#define IFX_GTM_TOM_TGC1_ACT_TB_ACT_TB_MSK                (0xffffff)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_ACT_TB_Bits.ACT_TB */
#define IFX_GTM_TOM_TGC1_ACT_TB_ACT_TB_OFF                (0)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_ACT_TB_Bits.TB_TRIG */
#define IFX_GTM_TOM_TGC1_ACT_TB_TB_TRIG_LEN               (1)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_ACT_TB_Bits.TB_TRIG */
#define IFX_GTM_TOM_TGC1_ACT_TB_TB_TRIG_MSK               (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_ACT_TB_Bits.TB_TRIG */
#define IFX_GTM_TOM_TGC1_ACT_TB_TB_TRIG_OFF               (24)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_ACT_TB_Bits.TBU_SEL */
#define IFX_GTM_TOM_TGC1_ACT_TB_TBU_SEL_LEN               (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_ACT_TB_Bits.TBU_SEL */
#define IFX_GTM_TOM_TGC1_ACT_TB_TBU_SEL_MSK               (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_ACT_TB_Bits.TBU_SEL */
#define IFX_GTM_TOM_TGC1_ACT_TB_TBU_SEL_OFF               (25)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL0 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL0_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL0 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL0_MSK       (0x3)

