Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL0 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL0_LEN         (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL0 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL0_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL0 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL0_OFF         (0)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL1 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL1_LEN         (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL1 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL1_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL1 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL1_OFF         (2)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL2 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL2_LEN         (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL2 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL2_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL2 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL2_OFF         (4)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL3 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL3_LEN         (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL3 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL3_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL3 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL3_OFF         (6)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL4 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL4_LEN         (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL4 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL4_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL4 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL4_OFF         (8)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL5 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL5_LEN         (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL5 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL5_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL5 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL5_OFF         (10)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL6 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL6_LEN         (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL6 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL6_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL6 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL6_OFF         (12)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL7 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL7_LEN         (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL7 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL7_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL7 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL7_OFF         (14)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH0 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH0_LEN         (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH0 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH0_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH0 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH0_OFF         (16)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH1 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH1_LEN         (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH1 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH1_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH1 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH1_OFF         (18)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH2 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH2_LEN         (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH2 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH2_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH2 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH2_OFF         (20)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH3 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH3_LEN         (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH3 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH3_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH3 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH3_OFF         (22)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH4 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH4_LEN         (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH4 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH4_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH4 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH4_OFF         (24)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH5 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH5_LEN         (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH5 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH5_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH5 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH5_OFF         (26)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH6 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH6_LEN         (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH6 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH6_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH6 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH6_OFF         (28)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH7 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH7_LEN         (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH7 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH7_MSK         (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH7 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH7_OFF         (30)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.HOST_TRIG */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_HOST_TRIG_LEN           (1)

