Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.HOST_TRIG */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_HOST_TRIG_MSK           (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.HOST_TRIG */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_HOST_TRIG_OFF           (0)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH0 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH0_LEN             (1)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH0 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH0_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH0 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH0_OFF             (8)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH1 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH1_LEN             (1)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH1 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH1_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH1 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH1_OFF             (9)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH2 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH2_LEN             (1)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH2 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH2_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH2 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH2_OFF             (10)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH3 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH3_LEN             (1)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH3 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH3_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH3 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH3_OFF             (11)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH4 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH4_LEN             (1)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH4 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH4_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH4 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH4_OFF             (12)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH5 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH5_LEN             (1)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH5 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH5_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH5 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH5_OFF             (13)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH6 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH6_LEN             (1)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH6 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH6_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH6 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH6_OFF             (14)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH7 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH7_LEN             (1)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH7 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH7_MSK             (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.RST_CH7 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_RST_CH7_OFF             (15)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL0 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL0_LEN          (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL0 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL0_MSK          (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL0 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL0_OFF          (16)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL1 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL1_LEN          (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL1 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL1_MSK          (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL1 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL1_OFF          (18)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL2 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL2_LEN          (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL2 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL2_MSK          (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL2 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL2_OFF          (20)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL3 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL3_LEN          (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL3 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL3_MSK          (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL3 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL3_OFF          (22)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL4 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL4_LEN          (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL4 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL4_MSK          (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL4 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL4_OFF          (24)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL5 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL5_LEN          (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL5 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL5_MSK          (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL5 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL5_OFF          (26)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL6 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL6_LEN          (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL6 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL6_MSK          (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL6 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL6_OFF          (28)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.UPEN_CTRL7 */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_UPEN_CTRL7_LEN          (2)

