Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL7 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL7_OFF       (14)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT0_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT0_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT0_OFF       (0)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT1_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT1_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT1_OFF       (2)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT2_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT2_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT2_OFF       (4)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT3_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT3_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT3_OFF       (6)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT4_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT4_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT4_OFF       (8)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT5_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT5_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT5_OFF       (10)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT6_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT6_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT6_OFF       (12)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT7_LEN       (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT7_MSK       (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT7_OFF       (14)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXGTM_BF_H */
